{"input": "Send an email to Michael at michael.smith@example.com about the sales figures, then play Hotel California by Eagles and check the weather for tomorrow.", "output": "Send an email to Michael at michael.smith@example.com about the sales figures\nplay Hotel California by Eagles\ncheck the weather for tomorrow"}
{"input": "Schedule a Zoom meeting for Monday at 4 PM and send the invite to Anna and Tom, also play the song Bad Guy by Billie Eilish.", "output": "Schedule a Zoom meeting for Monday at 4 PM\nsend the invite to Anna and Tom\nplay the song Bad Guy by Billie Eilish"}
{"input": "What's the weather in New York? Please send an email to my assistant at assistant@example.com about the upcoming conference and then play Rolling in the Deep by Adele.", "output": "What's the weather in New York?\nsend an email to my assistant at assistant@example.com about the upcoming conference\nplay Rolling in the Deep by Adele"}
{"input": "Play Let Me Down Slowly by Alec Benjamin and send an email to HR at hr@example.com about the leave application, then schedule a doctor appointment on Friday.", "output": "Play Let Me Down Slowly by Alec Benjamin\nsend an email to HR at hr@example.com about the leave application\nschedule a doctor appointment on Friday"}
{"input": "Send an email to Mark at mark.jones@example.com and schedule a call with the client on Tuesday, after that play Thriller by Michael Jackson.", "output": "Send an email to Mark at mark.jones@example.com\nschedule a call with the client on Tuesday\nplay Thriller by Michael Jackson"}
{"input": "What's the latest news and then play the song Blinding Lights by The Weeknd, also send an email to my project manager at pm@example.com.", "output": "What's the latest news\nplay the song Blinding Lights by The Weeknd\nsend an email to my project manager at pm@example.com"}
{"input": "Schedule a team lunch next Wednesday at 1 PM and send an email invite to the entire team, then play Uptown Funk by Bruno Mars.", "output": "Schedule a team lunch next Wednesday at 1 PM\nsend an email invite to the entire team\nplay Uptown Funk by Bruno Mars"}
{"input": "Play someone you loved by Lewis Capaldi and send an email to my friend Olivia at olivia@example.com about the party, also check tomorrow's weather.", "output": "Play someone you loved by Lewis Capaldi\nsend an email to my friend Olivia at olivia@example.com about the party\ncheck tomorrow's weather"}
{"input": "Send an email to my professor at prof@example.edu about the assignment deadline and schedule a study session on Friday, then play Hey Jude by The Beatles.", "output": "Send an email to my professor at prof@example.edu about the assignment deadline\nschedule a study session on Friday\nplay Hey Jude by The Beatles"}
{"input": "Schedule a birthday party for next Saturday and send invites to all friends, then play Dancing Queen by ABBA and check today's news.", "output": "Schedule a birthday party for next Saturday\nsend invites to all friends\nplay Dancing Queen by ABBA\ncheck today's news"}
{"input": "Send an email to finance at finance@example.com about the budget report, then play Smells Like Teen Spirit by Nirvana and set an alarm for 6 AM.", "output": "Send an email to finance at finance@example.com about the budget report\nplay Smells Like Teen Spirit by Nirvana\nset an alarm for 6 AM"}
{"input": "Play the song Shape of You and send an email to the marketing team at marketing@example.com about the campaign results, also schedule a follow-up meeting.", "output": "Play the song Shape of You\nsend an email to the marketing team at marketing@example.com about the campaign results\nschedule a follow-up meeting"}
{"input": "Send an email to Emily at emily.brown@example.com about the project deadline and then play Perfect by Ed Sheeran, finally check the weather forecast.", "output": "Send an email to Emily at emily.brown@example.com about the project deadline\nplay Perfect by Ed Sheeran\ncheck the weather forecast"}
{"input": "Schedule a meeting for Thursday at 3 PM and send a reminder email to all attendees, then play Yesterday by The Beatles and tell me the latest news.", "output": "Schedule a meeting for Thursday at 3 PM\nsend a reminder email to all attendees\nplay Yesterday by The Beatles\ntell me the latest news"}
{"input": "Play Can’t Stop the Feeling by Justin Timberlake and send an email to customer support at support@example.com about my complaint, then check the weather in San Francisco.", "output": "Play Can’t Stop the Feeling by Justin Timberlake\nsend an email to customer support at support@example.com about my complaint\ncheck the weather in San Francisco"}
{"input": "Send an email to my lawyer at lawyer@example.com and schedule a court hearing on Monday, after that play Hallelujah by Leonard Cohen.", "output": "Send an email to my lawyer at lawyer@example.com\nschedule a court hearing on Monday\nplay Hallelujah by Leonard Cohen"}
{"input": "What's the weather like in London and send an email to the travel agency at travel@example.com about my booking, then play Someone Like You by Adele.", "output": "What's the weather like in London\nsend an email to the travel agency at travel@example.com about my booking\nplay Someone Like You by Adele"}
{"input": "Play Happy by Pharrell Williams and schedule a dentist appointment for Tuesday, then send an email to my assistant at assistant@example.com about the schedule.", "output": "Play Happy by Pharrell Williams\nschedule a dentist appointment for Tuesday\nsend an email to my assistant at assistant@example.com about the schedule"}
{"input": "Send an email to my team at team@example.com about the meeting agenda and then play Clocks by Coldplay, finally check the news headlines.", "output": "Send an email to my team at team@example.com about the meeting agenda\nplay Clocks by Coldplay\ncheck the news headlines"}
{"input": "Schedule a performance review meeting next Friday and send invites to all employees, then play Boulevard of Broken Dreams by Green Day.", "output": "Schedule a performance review meeting next Friday\nsend invites to all employees\nplay Boulevard of Broken Dreams by Green Day"}
{"input": "What's the weather today? Also, set a reminder for a meeting tomorrow at 10 am and then send a mail to my brother Ayush at hehe@gmail.com and tell him that I am inviting him to my birthday party, then play the song Kings & Queens.", "output": "What's the weather today?\nset a reminder for a meeting tomorrow at 10 am\nsend a mail to my brother Ayush at hehe@gmail.com and tell him that I am inviting him to my birthday party\nplay the song Kings & Queens."}
{"input": "Send an email to Lisa at lisa.anderson@example.com about the quarterly report and then schedule a calendar event for the project presentation next Friday at 3 PM, after that play Bohemian Rhapsody by Queen and finally fetch the latest news headlines.", "output": "Send an email to Lisa at lisa.anderson@example.com about the quarterly report\nschedule a calendar event for the project presentation next Friday at 3 PM\nplay Bohemian Rhapsody by Queen\nfetch the latest news headlines"}
{"input": "Could you please play Shape of You by Ed Sheeran and send an email to my manager John at john.doe@company.com confirming the meeting? Also, what's the weather forecast for the weekend and set an alarm for 7 AM tomorrow.", "output": "Play Shape of You by Ed Sheeran\nsend an email to my manager John at john.doe@company.com confirming the meeting\nwhat's the weather forecast for the weekend\nset an alarm for 7 AM tomorrow"}
{"input": "Schedule a dentist appointment for next Monday at 11 AM and send an email to the clinic at clinic@example.com with my medical history, then play Stairway to Heaven by Led Zeppelin and tell me the latest news updates.", "output": "Schedule a dentist appointment for next Monday at 11 AM\nsend an email to the clinic at clinic@example.com with my medical history\nplay Stairway to Heaven by Led Zeppelin\ntell me the latest news updates"}
{"input": "Please send an email to Sarah at sarah@example.com thanking her for the presentation, then add eggs, milk, and bread to my shopping list and finally play Billie Jean by Michael Jackson.", "output": "Send an email to Sarah at sarah@example.com thanking her for the presentation\nadd eggs, milk, and bread to my shopping list\nplay Billie Jean by Michael Jackson"}
{"input": "What's the weather like in Tokyo and then play Let It Be by The Beatles and schedule a team meeting for Friday at 2 PM, also send an email to the HR department at hr@company.com about the new policy.", "output": "What's the weather like in Tokyo\nplay Let It Be by The Beatles\nschedule a team meeting for Friday at 2 PM\nsend an email to the HR department at hr@company.com about the new policy"}
{"input": "Play the song Love Me Like You Do by Ellie Goulding and send an email to Alex at alex@example.com with the subject Project Update, then set a reminder to call Mom tomorrow at 6 PM and fetch the weather report for New York.", "output": "Play the song Love Me Like You Do by Ellie Goulding\nsend an email to Alex at alex@example.com with the subject Project Update\nset a reminder to call Mom tomorrow at 6 PM\nfetch the weather report for New York"}
{"input": "Send an email to my colleague Emma at emma@work.com regarding the budget review, then play Don't Stop Believin' by Journey and schedule a doctor's appointment for next Wednesday at 9 AM, finally show me today's news.", "output": "Send an email to my colleague Emma at emma@work.com regarding the budget review\nplay Don't Stop Believin' by Journey\nschedule a doctor's appointment for next Wednesday at 9 AM\nshow me today's news"}
{"input": "Set an alarm for 6 AM and play Here Comes The Sun by The Beatles, then send an email to Dad at dad@example.com telling him I'll visit next week and also check the weather for Saturday.", "output": "Set an alarm for 6 AM\nplay Here Comes The Sun by The Beatles\nsend an email to Dad at dad@example.com telling him I'll visit next week\ncheck the weather for Saturday"}
{"input": "Schedule a lunch meeting with the team at 1 PM on Thursday and send an email invitation to all members, then play Smells Like Teen Spirit by Nirvana and finally fetch the breaking news headlines.", "output": "Schedule a lunch meeting with the team at 1 PM on Thursday\nsend an email invitation to all members\nplay Smells Like Teen Spirit by Nirvana\nfetch the breaking news headlines"}
{"input": "Send an email to John and schedule a meeting tomorrow at 3pm", "output": "Send an email to John\nschedule a meeting tomorrow at 3pm"}
{"input": "Play some jazz music then fetch the weather report", "output": "Play some jazz music\nfetch the weather report"}
{"input": "Send mail to Alice, play some jazz, and tell me the news", "output": "Send mail to Alice\nplay some jazz\ntell me the news"}
{"input": "Schedule a calendar event for next Monday and send an email to my team", "output": "Schedule a calendar event for next Monday\nsend an email to my team"}
{"input": "What's the weather like today and play my workout playlist", "output": "What's the weather like today\nplay my workout playlist"}
{"input": "Send a reminder email to Bob then show me today's news headlines", "output": "Send a reminder email to Bob\nshow me today's news headlines"}
{"input": "Play music and set a timer for 10 minutes", "output": "Play music\nset a timer for 10 minutes"}
{"input": "Book a meeting room for Friday and send the invite to Sarah", "output": "Book a meeting room for Friday\nsend the invite to Sarah"}
{"input": "Tell me the latest news and add milk to my shopping list", "output": "Tell me the latest news\nadd milk to my shopping list"}
{"input": "Send an email to my boss then play relaxing music", "output": "Send an email to my boss\nplay relaxing music"}
{"input": "Play rock music, check the weather, and schedule a doctor's appointment", "output": "Play rock music\ncheck the weather\nschedule a doctor's appointment"}
{"input": "Set an alarm for 7 AM and send the daily report email", "output": "Set an alarm for 7 AM\nsend the daily report email"}
{"input": "Send an email to Alice and Bob and then play their favorite songs", "output": "Send an email to Alice and Bob\nplay their favorite songs"}
{"input": "Schedule a meeting at 10 and remind me to call mom afterwards", "output": "Schedule a meeting at 10\nremind me to call mom afterwards"}
{"input": "Fetch the weather forecast and play my study playlist", "output": "Fetch the weather forecast\nplay my study playlist"}
{"input": "Send an email and show me the news", "output": "Send an email\nshow me the news"}
{"input": "Play my favorite podcast and schedule a workout session", "output": "Play my favorite podcast\nschedule a workout session"}
{"input": "Send the weekly update email then play jazz music", "output": "Send the weekly update email\nplay jazz music"}
{"input": "Add eggs to the grocery list and send a reminder email", "output": "Add eggs to the grocery list\nsend a reminder email"}
{"input": "Play classical music then check the weather tomorrow", "output": "Play classical music\ncheck the weather tomorrow"}
{"input": "Send email to manager and play motivational music", "output": "Send email to manager\nplay motivational music"}
{"input": "Schedule dentist appointment and send an invite to my partner", "output": "Schedule dentist appointment\nsend an invite to my partner"}
{"input": "Send an email and then play my relaxing playlist", "output": "Send an email\nplay my relaxing playlist"}
{"input": "Play some pop music and check today's weather", "output": "Play some pop music\ncheck today's weather"}
{"input": "Send email to HR and schedule a team meeting", "output": "Send email to HR\nschedule a team meeting"}
{"input": "Show me the latest news and play jazz music", "output": "Show me the latest news\nplay jazz music"}
{"input": "Set a reminder and then send a follow-up email", "output": "Set a reminder\nsend a follow-up email"}
{"input": "Play music then schedule a call with Tom", "output": "Play music\nschedule a call with Tom"}
{"input": "Send email to client and check the weather", "output": "Send email to client\ncheck the weather"}
{"input": "Schedule lunch meeting and send email confirmation", "output": "Schedule lunch meeting\nsend email confirmation"}
{"input": "Play some relaxing tunes and show me today's news headlines", "output": "Play some relaxing tunes\nshow me today's news headlines"}
{"input": "Send an email to Jane at jane.doe@example.com about the meeting notes and then play Thinking Out Loud by Ed Sheeran, also tell me the weather in Mumbai.", "output": "Send an email to Jane at jane.doe@example.com about the meeting notes\nplay Thinking Out Loud by Ed Sheeran\ntell me the weather in Mumbai"}
{"input": "Schedule a video call with my mentor on Saturday at 10 AM and send a reminder email, then play Counting Stars by OneRepublic.", "output": "Schedule a video call with my mentor on Saturday at 10 AM\nsend a reminder email\nplay Counting Stars by OneRepublic"}
{"input": "What's the current temperature in Delhi and then play the song Let Her Go by Passenger?", "output": "What's the current temperature in Delhi\nplay the song Let Her Go by Passenger"}
{"input": "Send an email to team@startup.com summarizing today’s demo and also schedule a follow-up call for next Monday.", "output": "Send an email to team@startup.com summarizing today’s demo\nschedule a follow-up call for next Monday"}
{"input": "Play some lofi beats and check the news for today.", "output": "Play some lofi beats\ncheck the news for today"}
{"input": "Set a timer for 15 minutes, then send a birthday email to Ria at ria@example.com.", "output": "Set a timer for 15 minutes\nsend a birthday email to Ria at ria@example.com"}
{"input": "Schedule a brainstorming session tomorrow at noon and then play Thunder by Imagine Dragons.", "output": "Schedule a brainstorming session tomorrow at noon\nplay Thunder by Imagine Dragons"}
{"input": "Send an email to Alex confirming the dinner plan and also check tomorrow's weather in Jaipur.", "output": "Send an email to Alex confirming the dinner plan\ncheck tomorrow's weather in Jaipur"}
{"input": "Play Perfect Symphony by Ed Sheeran and Andrea Bocelli, then send an update to the product team.", "output": "Play Perfect Symphony by Ed Sheeran and Andrea Bocelli\nsend an update to the product team"}
{"input": "Check the weather for Manali and play my morning playlist.", "output": "Check the weather for Manali\nplay my morning playlist"}
{"input": "Send feedback to marketing@example.com and play Friends theme song, then show me breaking news.", "output": "Send feedback to marketing@example.com\nplay Friends theme song\nshow me breaking news"}
{"input": "Schedule a team sync call on Wednesday and set a reminder for 10 AM, then send the invite.", "output": "Schedule a team sync call on Wednesday\nset a reminder for 10 AM\nsend the invite"}
{"input": "Send congratulations email to Priya for her promotion and also play Firework by Katy Perry.", "output": "Send congratulations email to Priya for her promotion\nplay Firework by Katy Perry"}
{"input": "Play Rain On Me by Lady Gaga and Ariana Grande and check the weather in Goa for this weekend.", "output": "Play Rain On Me by Lady Gaga and Ariana Grande\ncheck the weather in Goa for this weekend"}
{"input": "Send a thank you email to the HR team and set a follow-up reminder for Thursday.", "output": "Send a thank you email to the HR team\nset a follow-up reminder for Thursday"}
{"input": "Schedule a call with the client at 3 PM, send a calendar invite, and then play Relaxing Piano Music.", "output": "Schedule a call with the client at 3 PM\nsend a calendar invite\nplay Relaxing Piano Music"}
{"input": "Send an email to grandma and check if it will rain in Shimla tomorrow.", "output": "Send an email to grandma\ncheck if it will rain in Shimla tomorrow"}
{"input": "Play my favorite chill playlist and show me the latest updates from NDTV.", "output": "Play my favorite chill playlist\nshow me the latest updates from NDTV"}
{"input": "Book a meeting room for Friday and send the invite to Ravi and Neha, then play Summer of '69.", "output": "Book a meeting room for Friday\nsend the invite to Ravi and Neha\nplay Summer of '69"}
{"input": "What's the news today and send a status update to my team lead?", "output": "What's the news today\nsend a status update to my team lead"}
{"input": "Play instrumental background music and send the event summary to attendees.", "output": "Play instrumental background music\nsend the event summary to attendees"}
{"input": "Send email to boss regarding monthly targets and check weather in Pune.", "output": "Send email to boss regarding monthly targets\ncheck weather in Pune"}
{"input": "Schedule Zoom call with client, play soft jazz, and show me the latest emails.", "output": "Schedule Zoom call with client\nplay soft jazz\nshow me the latest emails"}
{"input": "Add milk and apples to shopping list and play Sunday Morning by Maroon 5.", "output": "Add milk and apples to shopping list\nplay Sunday Morning by Maroon 5"}
{"input": "Send RSVP to the wedding invitation and check weather forecast for Udaipur.", "output": "Send RSVP to the wedding invitation\ncheck weather forecast for Udaipur"}
{"input": "Play Shape of You and schedule a personal training session at 7 PM.", "output": "Play Shape of You\nschedule a personal training session at 7 PM"}
{"input": "Send an email to Neel about the client feedback, then play Journey’s Greatest Hits.", "output": "Send an email to Neel about the client feedback\nplay Journey’s Greatest Hits"}
{"input": "Check today’s weather and play the latest episode of my podcast.", "output": "Check today’s weather\nplay the latest episode of my podcast"}
{"input": "Send report to analytics@example.com, schedule a review meeting, and play All of Me.", "output": "Send report to analytics@example.com\nschedule a review meeting\nplay All of Me"}
{"input": "Remind me to drink water every 2 hours and play focus music.", "output": "Remind me to drink water every 2 hours\nplay focus music"}
{"input": "Send budget approval email and schedule finance call at 5 PM.", "output": "Send budget approval email\nschedule finance call at 5 PM"}
{"input": "Check weather for today, show me trending news, and play my workout mix.", "output": "Check weather for today\nshow me trending news\nplay my workout mix"}
{"input": "Email professor my assignment and schedule submission reminder.", "output": "Email professor my assignment\nschedule submission reminder"}
{"input": "Play lo-fi jazz and send birthday wishes to Rahul.", "output": "Play lo-fi jazz\nsend birthday wishes to Rahul"}
{"input": "Set alarm for 5 AM, play motivational quotes podcast, and send my itinerary to mom.", "output": "Set alarm for 5 AM\nplay motivational quotes podcast\nsend my itinerary to mom"}
{"input": "Schedule a group project call, email participants, and play Morning Mood by Grieg.", "output": "Schedule a group project call\nemail participants\nplay Morning Mood by Grieg"}
{"input": "Send cancellation email for the meeting and play Sad Songs playlist.", "output": "Send cancellation email for the meeting\nplay Sad Songs playlist"}
{"input": "What's the weather in Bangalore? Also, send message to Arjun and play Humma Song.", "output": "What's the weather in Bangalore?\nsend message to Arjun\nplay Humma Song"}
{"input": "Play some party music, email playlist to friends, and check temperature outside.", "output": "Play some party music\nemail playlist to friends\ncheck temperature outside"}
{"input": "Schedule my flight reminder and email travel agency.", "output": "Schedule my flight reminder\nemail travel agency"}
{"input": "Check temperature in Leh and play Coldplay songs.", "output": "Check temperature in Leh\nplay Coldplay songs"}
{"input": "Send weekly newsletter and then schedule the review call.", "output": "Send weekly newsletter\nschedule the review call"}
{"input": "Play Numb by Linkin Park, check today’s headlines, and email report to boss.", "output": "Play Numb by Linkin Park\ncheck today’s headlines\nemail report to boss"}
{"input": "Send grocery list to Anjali and play my favorites.", "output": "Send grocery list to Anjali\nplay my favorites"}
{"input": "Book train ticket for tomorrow and send confirmation to dad.", "output": "Book train ticket for tomorrow\nsend confirmation to dad"}
{"input": "Play jazz, show weather in Hyderabad, and send mail to Dev.", "output": "Play jazz\nshow weather in Hyderabad\nsend mail to Dev"}
{"input": "Email my CV to recruiter@example.com and play instrumental background music.", "output": "Email my CV to recruiter@example.com\nplay instrumental background music"}
{"input": "Schedule doctor visit, notify mom, and check temperature in Chennai.", "output": "Schedule doctor visit\nnotify mom\ncheck temperature in Chennai"}
{"input": "Check rain forecast in Ooty, email picnic plan to friends, and play Chillhop.", "output": "Check rain forecast in Ooty\nemail picnic plan to friends\nplay Chillhop"}
{"input": "Send resume to careers@example.com and play relaxing flute music.", "output": "Send resume to careers@example.com\nplay relaxing flute music"}
{"input": "Add water bottle to cart, send it to dad, and play yoga music.", "output": "Add water bottle to cart\nsend it to dad\nplay yoga music"}
{"input": "Check weather in Kochi, send email to travel buddy, and play traditional Malayalam songs.", "output": "Check weather in Kochi\nsend email to travel buddy\nplay traditional Malayalam songs"}
{"input": "Send an email to ramesh.kumar@infotech.com regarding the delayed server response and include log files from yesterday, then check the weather in Hyderabad.", "output": "Send an email to ramesh.kumar@infotech.com regarding the delayed server response and include log files from yesterday\ncheck the weather in Hyderabad"}
{"input": "Email an update to priya.mehta@startuplab.io explaining the marketing budget revisions and attach the updated Excel file, also play some jazz.", "output": "Email an update to priya.mehta@startuplab.io explaining the marketing budget revisions and attach the updated Excel file\nplay some jazz"}
{"input": "Check the weather in Manali for this weekend and send an itinerary email to my travel partner at arjun.verma23@gmail.com with the plan.", "output": "Check the weather in Manali for this weekend\nsend an itinerary email to my travel partner at arjun.verma23@gmail.com with the plan"}
{"input": "Send an appreciation email to my professor at smita.sharma@university.edu thanking her for the recommendation letter, and then play 'Canon in D'.", "output": "Send an appreciation email to my professor at smita.sharma@university.edu thanking her for the recommendation letter\nplay 'Canon in D'"}
{"input": "Email the PDF of our design proposal to rajiv.m@clienthub.com and then check the temperature in Delhi.", "output": "Email the PDF of our design proposal to rajiv.m@clienthub.com\ncheck the temperature in Delhi"}
{"input": "Send a complaint to service@airlinesupport.com mentioning the seat malfunction and attach the boarding pass image, also check if it’s raining in Mumbai.", "output": "Send a complaint to service@airlinesupport.com mentioning the seat malfunction and attach the boarding pass image\ncheck if it’s raining in Mumbai"}
{"input": "Write and send an apology email to teamlead@xyzcorp.net about missing today’s scrum meeting and explain the reason, then play a relaxing piano track.", "output": "Write and send an apology email to teamlead@xyzcorp.net about missing today’s scrum meeting and explain the reason\nplay a relaxing piano track"}
{"input": "Email my updated resume to hr@techwave.ai with subject 'Application for Backend Developer Role', and then play some motivational music.", "output": "Email my updated resume to hr@techwave.ai with subject 'Application for Backend Developer Role'\nplay some motivational music"}
{"input": "Send a reminder to ankit.patel@zentech.com about tomorrow’s code review and attach the final version of the repo summary, then check today’s news.", "output": "Send a reminder to ankit.patel@zentech.com about tomorrow’s code review and attach the final version of the repo summary\ncheck today’s news"}
{"input": "Draft an email to my landlord at sharma.propertyrentals@gmail.com explaining the water leakage in the kitchen and request urgent repair, then check if it will rain today.", "output": "Draft an email to my landlord at sharma.propertyrentals@gmail.com explaining the water leakage in the kitchen and request urgent repair\ncheck if it will rain today"}
{"input": "Send a feedback email to feedback@bookmystay.com about the great room service and mention the staff names, and then play soft instrumental music.", "output": "Send a feedback email to feedback@bookmystay.com about the great room service and mention the staff names\nplay soft instrumental music"}
{"input": "Check the temperature in Mussoorie and then email our trip plan to meena.rai@travelcompanion.org with dates and hotel options.", "output": "Check the temperature in Mussoorie\nemail our trip plan to meena.rai@travelcompanion.org with dates and hotel options"}
{"input": "Play 'Sunflower' by Post Malone and email my mentor at rajat.khurana@mentorsphere.com summarizing today’s hackathon experience.", "output": "Play 'Sunflower' by Post Malone\nemail my mentor at rajat.khurana@mentorsphere.com summarizing today’s hackathon experience"}
{"input": "Send meeting notes to my manager at reena.jain@codeforge.ai with bullet points from today's team call, then play lofi beats.", "output": "Send meeting notes to my manager at reena.jain@codeforge.ai with bullet points from today's team call\nplay lofi beats"}
{"input": "Email the group photo from the event to sangeeta.events@outlook.com and include a thank-you message, then check today's forecast for Pune.", "output": "Email the group photo from the event to sangeeta.events@outlook.com and include a thank-you message\ncheck today's forecast for Pune"}
{"input": "Send the internship report to devika.s@internpanel.org with all graphs embedded, then play classical Indian music.", "output": "Send the internship report to devika.s@internpanel.org with all graphs embedded\nplay classical Indian music"}
{"input": "Email chef.nikheel@cookacademy.com about my experience with the cooking class and suggest improvements, then tell me the temperature in Chennai.", "output": "Email chef.nikheel@cookacademy.com about my experience with the cooking class and suggest improvements\ntell me the temperature in Chennai"}
{"input": "Send a congratulatory email to divya.singh@corporategrowth.com on her promotion and ask when the party is, then play some party music.", "output": "Send a congratulatory email to divya.singh@corporategrowth.com on her promotion and ask when the party is\nplay some party music"}
{"input": "Draft and send a support request email to help@digitalwallets.com about a failed transaction with all details, and then check the weather in Goa.", "output": "Draft and send a support request email to help@digitalwallets.com about a failed transaction with all details\ncheck the weather in Goa"}
{"input": "Check the news headlines and email them to my friend at amit.kaur91@gmail.com, then play a podcast about productivity.", "output": "Check the news headlines\nemail them to my friend at amit.kaur91@gmail.com\nplay a podcast about productivity"}
{"input": "Send a mail to nina.wells@example.com about the venue changes, and then play Ocean Eyes by Billie Eilish.", "output": "Send a mail to nina.wells@example.com about the venue changes\nplay Ocean Eyes by Billie Eilish"}
{"input": "Play Believer by Imagine Dragons and let me know the weather in Lucknow.", "output": "Play Believer by Imagine Dragons\nlet me know the weather in Lucknow"}
{"input": "Schedule my dentist appointment for Tuesday 4 PM and send email to confirm it.", "output": "Schedule my dentist appointment for Tuesday 4 PM\nsend email to confirm it"}
{"input": "Tell me the latest headlines and send a quick update to Anuj.", "output": "Tell me the latest headlines\nsend a quick update to Anuj"}
{"input": "Play a calming evening playlist and remind me to take medicine at 9 PM.", "output": "Play a calming evening playlist\nremind me to take medicine at 9 PM"}
{"input": "Send invitation email to tara@example.com and play Apna Bana Le.", "output": "Send invitation email to tara@example.com\nplay Apna Bana Le"}
{"input": "Set up a team meeting for Friday 11 AM and tell me tomorrow’s forecast for Indore.", "output": "Set up a team meeting for Friday 11 AM\ntell me tomorrow’s forecast for Indore"}
{"input": "Play my dinner jazz playlist and schedule my yoga reminder for 6 AM.", "output": "Play my dinner jazz playlist\nschedule my yoga reminder for 6 AM"}
{"input": "Email the final draft to client@agency.com and check if it's sunny in Chennai today.", "output": "Email the final draft to client@agency.com\ncheck if it's sunny in Chennai today"}
{"input": "What’s the weather in Shimla and can you play Vande Mataram instrumental?", "output": "What’s the weather in Shimla\nplay Vande Mataram instrumental"}
{"input": "Remind me to file taxes next Monday and play classical music for focus.", "output": "Remind me to file taxes next Monday\nplay classical music for focus"}
{"input": "Send the photos to mohan.singh@example.com and let me know today’s weather in Patna.", "output": "Send the photos to mohan.singh@example.com\ntoday’s weather in Patna"}
{"input": "Play Hanuman Chalisa and schedule bhajan reminder for Sunday evening.", "output": "Play Hanuman Chalisa\nschedule bhajan reminder for Sunday evening"}
{"input": "Email the code review notes to project.team@example.com and show me breaking news.", "output": "Email the code review notes to project.team@example.com\nshow me breaking news"}
{"input": "Schedule a reminder for team review on Saturday and then play Lagdi Lahore Di.", "output": "Schedule a reminder for team review on Saturday\nplay Lagdi Lahore Di"}
{"input": "What's the temperature outside and also send an appreciation email to Ruchi.", "output": "What's the temperature outside\nsend an appreciation email to Ruchi"}
{"input": "Play my peaceful morning playlist and also check news from The Hindu.", "output": "Play my peaceful morning playlist\ncheck news from The Hindu"}
{"input": "Send interview questions to shreya.tiwari@example.com and check rain prediction for Bhopal.", "output": "Send interview questions to shreya.tiwari@example.com\ncheck rain prediction for Bhopal"}
{"input": "Remind me to water plants every 3 days and play garden ambiance music.", "output": "Remind me to water plants every 3 days\nplay garden ambiance music"}
{"input": "Schedule a call with Maya on Sunday 3 PM and email her the Zoom link.", "output": "Schedule a call with Maya on Sunday 3 PM\nemail her the Zoom link"}
{"input": "Send birthday wishes to raghav@example.com and play Birthday Song by 2 Chainz.", "output": "Send birthday wishes to raghav@example.com\nplay Birthday Song by 2 Chainz"}
{"input": "Play Today Was a Good Day and tell me if it’s going to rain in Nagpur.", "output": "Play Today Was a Good Day\ntell me if it’s going to rain in Nagpur"}
{"input": "Set a reminder to submit expense report on Friday and check today’s top headlines.", "output": "Set a reminder to submit expense report on Friday\ncheck today’s top headlines"}
{"input": "Email details of the workshop to neeraj@example.com and play instrumental background.", "output": "Email details of the workshop to neeraj@example.com\nplay instrumental background"}
{"input": "Schedule a call with Akash and remind me 10 minutes before, then play Tujh Mein Rab Dikhta Hai.", "output": "Schedule a call with Akash\nremind me 10 minutes before\nplay Tujh Mein Rab Dikhta Hai"}
{"input": "Send report to boss@company.com and also check the latest news on India Today.", "output": "Send report to boss@company.com\ncheck the latest news on India Today"}
{"input": "Play my motivational mix and set daily reminder to stretch at 10 AM.", "output": "Play my motivational mix\nset daily reminder to stretch at 10 AM"}
{"input": "Check weather in Mussoorie and send hotel confirmation to priya@example.com.", "output": "Check weather in Mussoorie\nsend hotel confirmation to priya@example.com"}
{"input": "Schedule dentist visit and play Heartbeat Song by Kelly Clarkson.", "output": "Schedule dentist visit\nplay Heartbeat Song by Kelly Clarkson"}
{"input": "Send a quick thank-you note to meena@example.com and play Bollywood retro mix.", "output": "Send a quick thank-you note to meena@example.com\nplay Bollywood retro mix"}
{"input": "Play dance mix playlist, email the guest list to tanvi@example.com, and check weather in Dehradun.", "output": "Play dance mix playlist\nemail the guest list to tanvi@example.com\ncheck weather in Dehradun"}
{"input": "Check tomorrow’s weather in Jaipur and play soothing bhajans.", "output": "Check tomorrow’s weather in Jaipur\nplay soothing bhajans"}
{"input": "Schedule grocery delivery reminder for 5 PM and send update to mom.", "output": "Schedule grocery delivery reminder for 5 PM\nsend update to mom"}
{"input": "Email details of the hackathon to mentor@example.com and show me top tech headlines.", "output": "Email details of the hackathon to mentor@example.com\nshow me top tech headlines"}
{"input": "Send proposal to nina.kaur@example.com and play my focus playlist.", "output": "Send proposal to nina.kaur@example.com\nplay my focus playlist"}
{"input": "Remind me to buy groceries at 6 PM and check if it will rain in Ranchi.", "output": "Remind me to buy groceries at 6 PM\ncheck if it will rain in Ranchi"}
{"input": "Play top trending Hindi songs and email playlist to Avni.", "output": "Play top trending Hindi songs\nemail playlist to Avni"}
{"input": "Set a reminder to pick up laundry and also check weather for next weekend in Lonavala.", "output": "Set a reminder to pick up laundry\ncheck weather for next weekend in Lonavala"}
{"input": "Schedule coding session for 10 AM tomorrow and play lo-fi chill beats.", "output": "Schedule coding session for 10 AM tomorrow\nplay lo-fi chill beats"}
{"input": "Play Ranjha by B Praak and show me today’s news from Hindustan Times.", "output": "Play Ranjha by B Praak\nshow me today’s news from Hindustan Times"}
{"input": "Email minutes of the meeting to office.team@example.com and check the forecast for Kolkata.", "output": "Email minutes of the meeting to office.team@example.com\ncheck the forecast for Kolkata"}
{"input": "Remind me about tomorrow’s standup call at 9 AM and play instrumental workspace tunes.", "output": "Remind me about tomorrow’s standup call at 9 AM\nplay instrumental workspace tunes"}
{"input": "Schedule a feedback call at 1 PM with Ankit and check if it will be cloudy in Ahmedabad.", "output": "Schedule a feedback call at 1 PM with Ankit\ncheck if it will be cloudy in Ahmedabad"}
{"input": "Send event invite to ananya.m@example.com and play the song Bekhayali.", "output": "Send event invite to ananya.m@example.com\nplay the song Bekhayali"}
{"input": "Set a reminder to water the plants at 7 AM and play some flute instrumental.", "output": "Set a reminder to water the plants at 7 AM\nplay some flute instrumental"}
{"input": "Check the news for India and send feedback form to sam@example.com.", "output": "Check the news for India\nsend feedback form to sam@example.com"}
{"input": "Play my relaxation track and email RSVP to the team.", "output": "Play my relaxation track\nemail RSVP to the team"}
{"input": "Send a follow-up mail to tanmay.b@example.com and tell me the weather in Delhi right now.", "output": "Send a follow-up mail to tanmay.b@example.com\ntell me the weather in Delhi right now"}
{"input": "Schedule my call with the recruiter at 11 AM Friday and play Soft Piano Study playlist.", "output": "Schedule my call with the recruiter at 11 AM Friday\nplay Soft Piano Study playlist"}
{"input": "Check today’s weather for Noida, then send status update to the finance team.", "output": "Check today’s weather for Noida\nsend status update to the finance team"}
{"input": "Play favorite Punjabi tracks and send draft email to writer@example.com.", "output": "Play favorite Punjabi tracks\nsend draft email to writer@example.com"}
{"input": "Email client update to rajiv@solutions.com and set a reminder for next week's review.", "output": "Email client update to rajiv@solutions.com\nset a reminder for next week's review"}
{"input": "Show me cricket news and play Chak De India.", "output": "Show me cricket news\nplay Chak De India"}
{"input": "Schedule a review session at 6 PM and send a confirmation to mentor@example.com.", "output": "Schedule a review session at 6 PM\nsend a confirmation to mentor@example.com"}
{"input": "Send a birthday greeting to aarti@example.com and check temperature in Manali today.", "output": "Send a birthday greeting to aarti@example.com\ncheck temperature in Manali today"}
{"input": "Remind me to call home at 8 PM and play some peaceful sounds.", "output": "Remind me to call home at 8 PM\nplay some peaceful sounds"}
{"input": "Play patriotic songs and send documents to teacher@school.com.", "output": "Play patriotic songs\nsend documents to teacher@school.com"}
{"input": "Schedule workout reminder for 7 AM and show latest NDTV headlines.", "output": "Schedule workout reminder for 7 AM\nshow latest NDTV headlines"}
{"input": "Send the class notes to kavita@example.com and play a concentration mix.", "output": "Send the class notes to kavita@example.com\nplay a concentration mix"}
{"input": "What's the weather in Pondicherry? And also send email confirmation to event host.", "output": "What's the weather in Pondicherry?\nsend email confirmation to event host"}
{"input": "Check rainfall in Mangalore and play Chillstep Vibes playlist.", "output": "Check rainfall in Mangalore\nplay Chillstep Vibes playlist"}
{"input": "Email feedback to product.manager@example.com and remind me about it next week.", "output": "Email feedback to product.manager@example.com\nremind me about it next week"}
{"input": "Play Sunflower by Post Malone and check today’s forecast for Guwahati.", "output": "Play Sunflower by Post Malone\ncheck today’s forecast for Guwahati"}
{"input": "Set a reminder for my exam at 8:30 AM and send update to study group.", "output": "Set a reminder for my exam at 8:30 AM\nsend update to study group"}
{"input": "Email project summary to meera.k@example.com and play Humraah.", "output": "Email project summary to meera.k@example.com\nplay Humraah"}
{"input": "Send acceptance email to recruiter@example.com and also tell me the temperature in Chandigarh.", "output": "Send acceptance email to recruiter@example.com\ntell me the temperature in Chandigarh"}
{"input": "Play morning mantra and set meeting reminder for Monday at 9 AM.", "output": "Play morning mantra\nset meeting reminder for Monday at 9 AM"}
{"input": "Check temperature in Kodaikanal and send thanks email to Rahul.", "output": "Check temperature in Kodaikanal\nsend thanks email to Rahul"}
{"input": "Schedule my mentoring session for Saturday 5 PM and play acoustic evening tracks.", "output": "Schedule my mentoring session for Saturday 5 PM\nplay acoustic evening tracks"}
{"input": "Play Sai Bhajan playlist and check weather for Haridwar.", "output": "Play Sai Bhajan playlist\ncheck weather for Haridwar"}
{"input": "Email the presentation to boss@example.com and show me the top stories from BBC.", "output": "Email the presentation to boss@example.com\nshow me the top stories from BBC"}
{"input": "Send weekly progress email to the supervisor and play lo-fi rain sounds.", "output": "Send weekly progress email to the supervisor\nplay lo-fi rain sounds"}
{"input": "What’s the news in Mumbai today and play Zinda by Siddharth Mahadevan.", "output": "What’s the news in Mumbai today\nplay Zinda by Siddharth Mahadevan"}
{"input": "Set birthday reminder for Neha on Sunday and email gift ideas to myself.", "output": "Set birthday reminder for Neha on Sunday\nemail gift ideas to myself"}
{"input": "Send daily tracker to kavya@example.com and play daily meditation music.", "output": "Send daily tracker to kavya@example.com\nplay daily meditation music"}
{"input": "Schedule physics study session for 6 PM and check tomorrow’s weather in Pune.", "output": "Schedule physics study session for 6 PM\ncheck tomorrow’s weather in Pune"}
{"input": "Play Zaalima by Arijit and email calendar invite to project team.", "output": "Play Zaalima by Arijit\nemail calendar invite to project team"}
{"input": "Check today's headlines and remind me about journal submission tomorrow.", "output": "Check today's headlines\nremind me about journal submission tomorrow"}
{"input": "Schedule a webinar at 4 PM Friday and send the invite to entire batch.", "output": "Schedule a webinar at 4 PM Friday\nsend the invite to entire batch"}
{"input": "Send follow-up email to aditi@example.com and play Ocean Drive by Duke Dumont.", "output": "Send follow-up email to aditi@example.com\nplay Ocean Drive by Duke Dumont"}
{"input": "Email the updated app screenshots to kriti.arora@designhub.io for the portfolio update and then play 'Night Changes' by One Direction.", "output": "Email the updated app screenshots to kriti.arora@designhub.io for the portfolio update\nplay 'Night Changes' by One Direction"}
{"input": "Send the invoice to billing@webtools.com with the subject 'March Services Payment', and also check the weather in Bangalore.", "output": "Send the invoice to billing@webtools.com with the subject 'March Services Payment'\ncheck the weather in Bangalore"}
{"input": "Send a formal resignation email to hr@consultify.org stating my last working day as July 15th, and then play something calming.", "output": "Send a formal resignation email to hr@consultify.org stating my last working day as July 15th\nplay something calming"}
{"input": "Draft a mail to editor@writingmonthly.com submitting my short story 'The Last Train' for publication, and then check the latest news.", "output": "Draft a mail to editor@writingmonthly.com submitting my short story 'The Last Train' for publication\ncheck the latest news"}
{"input": "Email a thank-you note to rahul.das@careerlaunchers.in for the mock interview session and feedback, then check tomorrow’s forecast in Delhi.", "output": "Email a thank-you note to rahul.das@careerlaunchers.in for the mock interview session and feedback\ncheck tomorrow’s forecast in Delhi"}
{"input": "Send my prescription copy to dr.malini@cityclinic.org and ask if I should continue the same dosage, then play instrumental flute music.", "output": "Send my prescription copy to dr.malini@cityclinic.org and ask if I should continue the same dosage\nplay instrumental flute music"}
{"input": "Email the class notes to akash.mathur@campusmail.edu for today's economics lecture, and then check if it's going to rain in Lucknow today.", "output": "Email the class notes to akash.mathur@campusmail.edu for today's economics lecture\ncheck if it's going to rain in Lucknow today"}
{"input": "Send a progress update to our client at jaya.raghavan@enterprisetech.biz with timeline estimates, and play some coding-friendly music.", "output": "Send a progress update to our client at jaya.raghavan@enterprisetech.biz with timeline estimates\nplay some coding-friendly music"}
{"input": "Email a complaint to admin@metrosociety.in about the broken lift and attach the video from the CCTV, then check the temperature outside.", "output": "Email a complaint to admin@metrosociety.in about the broken lift and attach the video from the CCTV\ncheck the temperature outside"}
{"input": "Send my pitch deck to investors@fundlabs.com with a brief elevator pitch in the message body, and play the song 'Believer' by Imagine Dragons.", "output": "Send my pitch deck to investors@fundlabs.com with a brief elevator pitch in the message body\nplay the song 'Believer' by Imagine Dragons"}
{"input": "Draft and send a project status update to nikhil.sinha@buildspace.in with current challenges and blockers, and then play some ambient sounds.", "output": "Draft and send a project status update to nikhil.sinha@buildspace.in with current challenges and blockers\nplay some ambient sounds"}
{"input": "Email the scanned passport to visa.support@embassy.org and ask for status on the visa appointment, then tell me the weather in Tokyo.", "output": "Email the scanned passport to visa.support@embassy.org and ask for status on the visa appointment\ntell me the weather in Tokyo"}
{"input": "Send an invite email to my classmates at group.project2025@university.edu for Sunday’s final discussion, then check the latest India news.", "output": "Send an invite email to my classmates at group.project2025@university.edu for Sunday’s final discussion\ncheck the latest India news"}
{"input": "Forward the welcome email from ABC company to my father at rajesh.gupta1958@yahoo.com, and then play relaxing meditation tracks.", "output": "Forward the welcome email from ABC company to my father at rajesh.gupta1958@yahoo.com\nplay relaxing meditation tracks"}
{"input": "Write and send a birthday email to shweta.kapoor@mediahouse.com and include a photo collage, then check the weather for this Friday in Kolkata.", "output": "Write and send a birthday email to shweta.kapoor@mediahouse.com and include a photo collage\ncheck the weather for this Friday in Kolkata"}
{"input": "Send an invoice correction mail to support@payfaster.com for transaction ID 8237AC with revised amount, and then play something energetic.", "output": "Send an invoice correction mail to support@payfaster.com for transaction ID 8237AC with revised amount\nplay something energetic"}
{"input": "Email the latest research summary to prof.kuldeep@iitk.ac.in with sources in APA format, then check if it will be sunny tomorrow.", "output": "Email the latest research summary to prof.kuldeep@iitk.ac.in with sources in APA format\ncheck if it will be sunny tomorrow"}
{"input": "Send a follow-up email to recruiter@netgen.io about my interview last Monday and ask for an update, then check the news about tech layoffs.", "output": "Send a follow-up email to recruiter@netgen.io about my interview last Monday and ask for an update\ncheck the news about tech layoffs"}
{"input": "Mail the updated Gantt chart to neha.tanwar@projectflow.in with task owners added, and then play 'Counting Stars' by OneRepublic.", "output": "Mail the updated Gantt chart to neha.tanwar@projectflow.in with task owners added\nplay 'Counting Stars' by OneRepublic"}
{"input": "Send the refund request to care@ecombuyer.com with all order IDs and invoice screenshots, and check today's weather in Shimla.", "output": "Send the refund request to care@ecombuyer.com with all order IDs and invoice screenshots\ncheck today's weather in Shimla"}
{"input": "Send an email to sneha.rathi@medinova.org summarizing the outcomes of today's clinical data review and attach the latest patient trial stats in PDF, then check the weather in Nagpur.", "output": "Send an email to sneha.rathi@medinova.org summarizing the outcomes of today's clinical data review and attach the latest patient trial stats in PDF\ncheck the weather in Nagpur"}
{"input": "Email professor.malik@iitb.ac.in to clarify the grading rubric for our machine learning project and include questions I had about the report format, then play ambient coding music.", "output": "Email professor.malik@iitb.ac.in to clarify the grading rubric for our machine learning project and include questions I had about the report format\nplay ambient coding music"}
{"input": "Send a follow-up email to ritesh.pillai@finanalytics.com requesting feedback on my financial model presentation, and attach the revised Excel sheet with the corrected forecasts, then check if it's raining in Kochi.", "output": "Send a follow-up email to ritesh.pillai@finanalytics.com requesting feedback on my financial model presentation, and attach the revised Excel sheet with the corrected forecasts\ncheck if it's raining in Kochi"}
{"input": "Draft a mail to trip.organizer@mountainquest.in detailing our trekking group size, accommodation preferences, and meal requirements for the Sikkim expedition, and then check the forecast for Gangtok.", "output": "Draft a mail to trip.organizer@mountainquest.in detailing our trekking group size, accommodation preferences, and meal requirements for the Sikkim expedition\ncheck the forecast for Gangtok"}
{"input": "Send an official resignation email to hr@parallaxmedia.com, mention last working day as June 30th, express thanks for the experience, and request a formal relieving letter, then play some goodbye-themed songs.", "output": "Send an official resignation email to hr@parallaxmedia.com, mention last working day as June 30th, express thanks for the experience, and request a formal relieving letter\nplay some goodbye-themed songs"}
{"input": "Email the scholarship application essay and required documents to admissions@kyotouniv.ac.jp with the subject 'MEXT Scholarship Submission - Saumya Gupta', then check the weather forecast for Kyoto.", "output": "Email the scholarship application essay and required documents to admissions@kyotouniv.ac.jp with the subject 'MEXT Scholarship Submission - Saumya Gupta'\ncheck the weather forecast for Kyoto"}
{"input": "Send a birthday greeting to my uncle at pradeep.sharma1947@gmail.com and include a recent family photo with a personalized message, then play a happy birthday tune.", "output": "Send a birthday greeting to my uncle at pradeep.sharma1947@gmail.com and include a recent family photo with a personalized message\nplay a happy birthday tune"}
{"input": "Email the scanned signed NDA to legal@startupconnect.in and confirm my availability for the onboarding call on Monday, then play instrumental jazz.", "output": "Email the scanned signed NDA to legal@startupconnect.in and confirm my availability for the onboarding call on Monday\nplay instrumental jazz"}
{"input": "Draft a complaint email to support@smartgadgets.com reporting a faulty smartwatch screen and include the invoice number and product images, then check the temperature in Indore.", "output": "Draft a complaint email to support@smartgadgets.com reporting a faulty smartwatch screen and include the invoice number and product images\ncheck the temperature in Indore"}
{"input": "Email the expense reimbursement form to accounts@visiontech.com, mention all attached bills and travel dates, and request approval by Friday, then play some relaxing background music.", "output": "Email the expense reimbursement form to accounts@visiontech.com, mention all attached bills and travel dates, and request approval by Friday\nplay some relaxing background music"}
{"input": "Send an email to my peer reviewer at mehak.arora@researchcircle.org highlighting the changes I made in the final paper draft based on her comments, and attach the latest PDF version, then check today's weather in Ahmedabad.", "output": "Send an email to my peer reviewer at mehak.arora@researchcircle.org highlighting the changes I made in the final paper draft based on her comments, and attach the latest PDF version\ncheck today's weather in Ahmedabad"}
{"input": "Email the edited promotional video link and caption draft to arjun.marketing@digibuzz.io for approval before the campaign launch, then play trending Bollywood songs.", "output": "Email the edited promotional video link and caption draft to arjun.marketing@digibuzz.io for approval before the campaign launch\nplay trending Bollywood songs"}
{"input": "Send an update to shalini.bose@urbaninfra.in summarizing the civil site inspection findings with photos attached, and suggest a follow-up meeting for next Wednesday, then check weather in Bhopal.", "output": "Send an update to shalini.bose@urbaninfra.in summarizing the civil site inspection findings with photos attached, and suggest a follow-up meeting for next Wednesday\ncheck weather in Bhopal"}
{"input": "Send the scanned mark sheet and ID proof to nikhil.rajan@jobspire.co for the internship background check, and confirm the availability for training next week, then play study music.", "output": "Send the scanned mark sheet and ID proof to nikhil.rajan@jobspire.co for the internship background check, and confirm the availability for training next week\nplay study music"}
{"input": "Email a summary of the survey results to team@greenimpact.org with a note on the positive trends, and attach the survey charts, then check whether it's sunny in Bengaluru.", "output": "Email a summary of the survey results to team@greenimpact.org with a note on the positive trends, and attach the survey charts\ncheck whether it's sunny in Bengaluru"}
{"input": "Write and send a message to admissions@mastersinai.edu inquiring about the missing confirmation letter and attach proof of payment, then check the news headlines.", "output": "Write and send a message to admissions@mastersinai.edu inquiring about the missing confirmation letter and attach proof of payment\ncheck the news headlines"}
{"input": "Email my project supervisor at sumit.kapoor@edulab.com with an update on the backend development progress and request a review of my latest commit, then play my coding playlist.", "output": "Email my project supervisor at sumit.kapoor@edulab.com with an update on the backend development progress and request a review of my latest commit\nplay my coding playlist"}
{"input": "Send a cover letter and portfolio to talent.hiring@creatixstudio.com applying for the UI/UX Designer Intern role, and customize the message to highlight my Figma work, then play lo-fi ambient sounds.", "output": "Send a cover letter and portfolio to talent.hiring@creatixstudio.com applying for the UI/UX Designer Intern role, and customize the message to highlight my Figma work\nplay lo-fi ambient sounds"}
{"input": "Email confirmation to event.coordinator@robotrix.org about my workshop slot and share the 5-slide deck I’ll use for the demo, then check the temperature in Jaipur.", "output": "Email confirmation to event.coordinator@robotrix.org about my workshop slot and share the 5-slide deck I’ll use for the demo\ncheck the temperature in Jaipur"}
{"input": "Send a follow-up to priya@vocalartists.in regarding the audition feedback and ask if recordings from the last session will be shared, then play some relaxing R&B.", "output": "Send a follow-up to priya@vocalartists.in regarding the audition feedback and ask if recordings from the last session will be shared\nplay some relaxing R&B"}
{"input": "Email the PPT slides to meera.sharma@designstorm.in and ask if she needs a walkthrough before Monday, then play 'Shivers' by Ed Sheeran.", "output": "Email the PPT slides to meera.sharma@designstorm.in and ask if she needs a walkthrough before Monday\nplay 'Shivers' by Ed Sheeran"}
{"input": "Send a formal appreciation mail to team@productedge.com for their outstanding performance last quarter, and check the weather for tomorrow morning.", "output": "Send a formal appreciation mail to team@productedge.com for their outstanding performance last quarter\ncheck the weather for tomorrow morning"}
{"input": "Mail my resignation letter to boss@megasoftcorp.com with a polite note and final date as 30th June, and then check today’s headlines.", "output": "Mail my resignation letter to boss@megasoftcorp.com with a polite note and final date as 30th June\ncheck today’s headlines"}
{"input": "Send a leave application email to hr.senior@codepulse.in for sick leave until Wednesday, then play a relaxing piano playlist.", "output": "Send a leave application email to hr.senior@codepulse.in for sick leave until Wednesday\nplay a relaxing piano playlist"}
{"input": "Email the signed MoU to legalteam@partnerworks.org and confirm the start date in the mail, then check whether it will rain tomorrow in Pune.", "output": "Email the signed MoU to legalteam@partnerworks.org and confirm the start date in the mail\ncheck whether it will rain tomorrow in Pune"}
{"input": "Send the recipe draft to editor@foodcraftzine.com and ask if it fits their format, then play acoustic music from the 2000s.", "output": "Send the recipe draft to editor@foodcraftzine.com and ask if it fits their format\nplay acoustic music from the 2000s"}
{"input": "Email the offer letter to jatin.mehra@talenthub.in with a joining confirmation note, and check the weather in Jaipur for Sunday.", "output": "Email the offer letter to jatin.mehra@talenthub.in with a joining confirmation note\ncheck the weather in Jaipur for Sunday"}
{"input": "Draft an email to info@ruralhealth.org asking for data on clean water initiatives, then check if there’s any news about WHO today.", "output": "Draft an email to info@ruralhealth.org asking for data on clean water initiatives\ncheck if there’s any news about WHO today"}
{"input": "Send the final blog draft to tanvi.jain@techwrite.in and CC the SEO team, and then play indie pop songs.", "output": "Send the final blog draft to tanvi.jain@techwrite.in and CC the SEO team\nplay indie pop songs"}
{"input": "Email the meeting summary to leadership@globexlabs.com with bullet points and next steps, and check the forecast for next Friday in Hyderabad.", "output": "Email the meeting summary to leadership@globexlabs.com with bullet points and next steps\ncheck the forecast for next Friday in Hyderabad"}
{"input": "Send an apology mail to feedback@fastkart.in for the delivery delay and offer a discount, then tell me the current weather in Chennai.", "output": "Send an apology mail to feedback@fastkart.in for the delivery delay and offer a discount\ntell me the current weather in Chennai"}
{"input": "Mail the scanned certificates to scholarship@eduassist.org and ask for deadline confirmation, then play lo-fi beats.", "output": "Mail the scanned certificates to scholarship@eduassist.org and ask for deadline confirmation\nplay lo-fi beats"}
{"input": "Send a weekly update email to our mentor at dr.rakesh@researchcell.edu including progress on phase 2, then check the news on AI regulations.", "output": "Send a weekly update email to our mentor at dr.rakesh@researchcell.edu including progress on phase 2\ncheck the news on AI regulations"}
{"input": "Email the signed lease agreement to rentaloffice@apartmentsplus.in and attach rent receipts, then check Saturday’s weather in Mumbai.", "output": "Email the signed lease agreement to rentaloffice@apartmentsplus.in and attach rent receipts\ncheck Saturday’s weather in Mumbai"}
{"input": "Send the cover letter to hiring@medtechlabs.com with the subject 'Application – Biomedical Engineer', then play 'Thunder' by Imagine Dragons.", "output": "Send the cover letter to hiring@medtechlabs.com with the subject 'Application – Biomedical Engineer'\nplay 'Thunder' by Imagine Dragons"}
{"input": "Draft an email to socialmedia@greenwatch.org offering our collaboration idea, and then play peaceful nature sounds.", "output": "Draft an email to socialmedia@greenwatch.org offering our collaboration idea\nplay peaceful nature sounds"}
{"input": "Email the assignment PDF to prof.ray@iitdelhi.ac.in with subject 'Submission - Digital Circuits Lab 6', then check today’s weather in Delhi.", "output": "Email the assignment PDF to prof.ray@iitdelhi.ac.in with subject 'Submission - Digital Circuits Lab 6'\ncheck today’s weather in Delhi"}
{"input": "Send the budget estimate to finance@urbanrise.com and confirm the funding timeline, then tell me what’s trending in today’s news.", "output": "Send the budget estimate to finance@urbanrise.com and confirm the funding timeline\ntell me what’s trending in today’s news"}
{"input": "Email my class presentation to ritu.sharma@schoolmail.edu and ask if I can get feedback by Tuesday, then play a Hindi pop song.", "output": "Email my class presentation to ritu.sharma@schoolmail.edu and ask if I can get feedback by Tuesday\nplay a Hindi pop song"}
{"input": "Send a mail to techsupport@smarthome.io about the firmware update failing on my device, then check the weather for next week in Manali.", "output": "Send a mail to techsupport@smarthome.io about the firmware update failing on my device\ncheck the weather for next week in Manali"}
{"input": "Send an email to karan.tiwari@mediaworks.co thanking him for the PR collaboration and attach the media kit, then check the weather in Bengaluru.", "output": "Send an email to karan.tiwari@mediaworks.co thanking him for the PR collaboration and attach the media kit\ncheck the weather in Bengaluru"}
{"input": "Email a meeting request to sneha.pillai@greencorp.org for next Monday and include the project roadmap, then play soft rock.", "output": "Email a meeting request to sneha.pillai@greencorp.org for next Monday and include the project roadmap\nplay soft rock"}
{"input": "Draft a reminder for my dentist appointment at 3 PM tomorrow and also email dr.kapoor@smiledental.in confirming my visit.", "output": "Draft a reminder for my dentist appointment at 3 PM tomorrow\nemail dr.kapoor@smiledental.in confirming my visit"}
{"input": "Send a detailed status update to leads@buildsync.io with timelines and blockers, then play some coding music.", "output": "Send a detailed status update to leads@buildsync.io with timelines and blockers\nplay some coding music"}
{"input": "Check the forecast for Jaipur this weekend and send a weather update email to my parents at malik.family@gmail.com.", "output": "Check the forecast for Jaipur this weekend\nsend a weather update email to my parents at malik.family@gmail.com"}
{"input": "Email sanjana@literatureclub.edu about the event feedback and attach the scanned feedback forms, then play lo-fi jazz.", "output": "Email sanjana@literatureclub.edu about the event feedback and attach the scanned feedback forms\nplay lo-fi jazz"}
{"input": "Send a birthday greeting to amit.r@designzone.com with a personal note, and set a reminder to call him at 7 PM.", "output": "Send a birthday greeting to amit.r@designzone.com with a personal note\nset a reminder to call him at 7 PM"}
{"input": "Draft and email a clarification about the budget overages to finance@ecosmart.in, then check if it will rain in Kochi tomorrow.", "output": "Draft and email a clarification about the budget overages to finance@ecosmart.in\ncheck if it will rain in Kochi tomorrow"}
{"input": "Email the academic transcript to my counselor at kavita.gupta@gradplus.org and include my application ID, then play ambient study music.", "output": "Email the academic transcript to my counselor at kavita.gupta@gradplus.org and include my application ID\nplay ambient study music"}
{"input": "Send a formal thank-you message to guest.speaker@eventsuite.com and attach the appreciation certificate, then check today’s headlines.", "output": "Send a formal thank-you message to guest.speaker@eventsuite.com and attach the appreciation certificate\ncheck today’s headlines"}
{"input": "Play 'Perfect' by Ed Sheeran and also email the lyrics to aarti.musiclover@gmail.com as she requested.", "output": "Play 'Perfect' by Ed Sheeran\nemail the lyrics to aarti.musiclover@gmail.com"}
{"input": "Schedule a reminder for yoga class at 6 AM daily and email my trainer at neha.fitness@gmail.com confirming the new time.", "output": "Schedule a reminder for yoga class at 6 AM daily\nemail my trainer at neha.fitness@gmail.com confirming the new time"}
{"input": "Email my presentation deck to anil.joshi@corporateskills.org before 4 PM and also play some jazz instrumentals.", "output": "Email my presentation deck to anil.joshi@corporateskills.org before 4 PM\nplay some jazz instrumentals"}
{"input": "Check the news and email me any updates about space tech to research@astroclub.io.", "output": "Check the news\nemail me any updates about space tech to research@astroclub.io"}
{"input": "Set a schedule for team sync-up at 10 AM Friday and email everyone the link to the video call.", "output": "Set a schedule for team sync-up at 10 AM Friday\nemail everyone the link to the video call"}
{"input": "Send an email to admissions@gradportal.edu about my deferred application status and include my reference ID, then check the forecast for Chandigarh.", "output": "Send an email to admissions@gradportal.edu about my deferred application status and include my reference ID\ncheck the forecast for Chandigarh"}
{"input": "Email ravi.singh@nextgenlabs.in the bug report and attach screenshots, then play instrumental focus music.", "output": "Email ravi.singh@nextgenlabs.in the bug report and attach screenshots\nplay instrumental focus music"}
{"input": "Set a reminder to water the plants every morning at 6:30 AM and email the list of indoor plants to my gardener at mehul.greenthumb@gmail.com.", "output": "Set a reminder to water the plants every morning at 6:30 AM\nemail the list of indoor plants to my gardener at mehul.greenthumb@gmail.com"}
{"input": "Play ‘Shape of You’ and email the song recommendation to sam@musicdigest.com.", "output": "Play ‘Shape of You’\nemail the song recommendation to sam@musicdigest.com"}
{"input": "Check the current weather in Shimla and email the details to anuj.kapoor@vacayplans.in with suggestions for winter clothes.", "output": "Check the current weather in Shimla\nemail the details to anuj.kapoor@vacayplans.in with suggestions for winter clothes"}
{"input": "Send a formal resignation letter to hr@zylotech.com and include my last working day, then play soft acoustic music.", "output": "Send a formal resignation letter to hr@zylotech.com and include my last working day\nplay soft acoustic music"}
{"input": "Draft a reminder to submit the tax documents by Thursday and email a checklist to accountant@taxwise.in.", "output": "Draft a reminder to submit the tax documents by Thursday\nemail a checklist to accountant@taxwise.in"}
{"input": "Email arnav.bose@techbridge.org the final build version with release notes, then check news on startup funding.", "output": "Email arnav.bose@techbridge.org the final build version with release notes\ncheck news on startup funding"}
{"input": "Play chillstep music and email the playlist link to rajeev@audiocircle.fm.", "output": "Play chillstep music\nemail the playlist link to rajeev@audiocircle.fm"}
{"input": "Set a recurring schedule for project backup every Friday at 5 PM and notify admin@serversecure.net via email.", "output": "Set a recurring schedule for project backup every Friday at 5 PM\nnotify admin@serversecure.net via email"}
{"input": "Email the revised user guide to jyoti.mahajan@uxflow.com and attach the updated screenshots, then check the weather in Surat.", "output": "Email the revised user guide to jyoti.mahajan@uxflow.com and attach the updated screenshots\ncheck the weather in Surat"}
{"input": "Play Beethoven’s Symphony No. 5 and send an email to music@historyofclassics.org sharing my thoughts on it.", "output": "Play Beethoven’s Symphony No. 5\nsend an email to music@historyofclassics.org sharing my thoughts on it"}
{"input": "Send a confirmation email to clientsupport@homespace.com about the repair appointment and set a reminder for the visit at 3 PM.", "output": "Send a confirmation email to clientsupport@homespace.com about the repair appointment\nset a reminder for the visit at 3 PM"}
{"input": "Email my insurance documents to claims@medicare360.com and ask for claim status, then check the weather in Bhopal.", "output": "Email my insurance documents to claims@medicare360.com and ask for claim status\ncheck the weather in Bhopal"}
{"input": "Schedule a daily reminder for meditation at 8 AM and email the routine to my coach at wellness@mindfit.in.", "output": "Schedule a daily reminder for meditation at 8 AM\nemail the routine to my coach at wellness@mindfit.in"}
{"input": "Email shruti.verma@internview.io my feedback on the candidate screening tool and suggest improvements, then play nature sounds.", "output": "Email shruti.verma@internview.io my feedback on the candidate screening tool and suggest improvements\nplay nature sounds"}
{"input": "Send the dinner party invite to guestlist@socialbuzz.com and include RSVP details, then check today’s top news.", "output": "Send the dinner party invite to guestlist@socialbuzz.com and include RSVP details\ncheck today’s top news"}
{"input": "Play ‘Vande Mataram’ and email a short essay about it to my niece at aarushi.student@gmail.com.", "output": "Play ‘Vande Mataram’\nemail a short essay about it to my niece at aarushi.student@gmail.com"}
{"input": "Set a reminder for the office security audit on 12th June at 11 AM and email the schedule to operations@metshield.com.", "output": "Set a reminder for the office security audit on 12th June at 11 AM\nemail the schedule to operations@metshield.com"}
{"input": "Check tomorrow’s weather in Mysuru and email the travel advisory to sumit@triply.ai.", "output": "Check tomorrow’s weather in Mysuru\nemail the travel advisory to sumit@triply.ai"}
{"input": "Play some upbeat workout music and send a list of similar tracks to fitbuzz@trainingsuite.io.", "output": "Play some upbeat workout music\nsend a list of similar tracks to fitbuzz@trainingsuite.io"}
{"input": "Email rohit.mukherjee@gearspark.io the test report for engine module and copy qa@gearspark.io, then check the forecast in Nagpur.", "output": "Email rohit.mukherjee@gearspark.io the test report for engine module and copy qa@gearspark.io\ncheck the forecast in Nagpur"}
{"input": "Draft a reminder for monthly grocery shopping and email the grocery list to homehelper@domesticdesk.com.", "output": "Draft a reminder for monthly grocery shopping\nemail the grocery list to homehelper@domesticdesk.com"}
{"input": "Check the news related to electric vehicles and email the relevant articles to ecoauto@greenfleet.org.", "output": "Check the news related to electric vehicles\nemail the relevant articles to ecoauto@greenfleet.org"}
{"input": "Send an email to booking@spapurehealing.com requesting a 5 PM appointment slot for next Tuesday, then play calming ocean waves.", "output": "Send an email to booking@spapurehealing.com requesting a 5 PM appointment slot for next Tuesday\nplay calming ocean waves"}
{"input": "Schedule a reminder to pay the electricity bill on the 9th of each month and notify utility@paycenter.in via email.", "output": "Schedule a reminder to pay the electricity bill on the 9th of each month\nnotify utility@paycenter.in via email"}
{"input": "Email my group project draft to mentor@campusedge.edu and ask for review, then check the weather in Dehradun.", "output": "Email my group project draft to mentor@campusedge.edu and ask for review\ncheck the weather in Dehradun"}
{"input": "Send congratulations to neha@careersteps.in for her promotion and ask when she’s free for a call, then play celebration music.", "output": "Send congratulations to neha@careersteps.in for her promotion and ask when she’s free for a call\nplay celebration music"}
{"input": "Check if it will be sunny in Udaipur this weekend and email the information to anjali.travels@plannerhub.com.", "output": "Check if it will be sunny in Udaipur this weekend\nemail the information to anjali.travels@plannerhub.com"}
{"input": "Play a morning devotional song and email the link to my aunt at preeti.devotion@gmail.com.", "output": "Play a morning devotional song\nemail the link to my aunt at preeti.devotion@gmail.com"}
{"input": "Set a reminder for 7:45 PM to join the webinar and email the access link to arpit@websummit.io.", "output": "Set a reminder for 7:45 PM to join the webinar\nemail the access link to arpit@websummit.io"}
{"input": "Email a reminder to bhavana.das@designsphere.com about the pending logo revisions and attach the updated feedback notes, then check if it’s cloudy in Chandigarh.", "output": "Email a reminder to bhavana.das@designsphere.com about the pending logo revisions and attach the updated feedback notes\ncheck if it’s cloudy in Chandigarh"}
{"input": "Send a detailed query to support@digipaywallet.com about the failed refund transaction and attach the transaction screenshot and order ID, then play some chill electronic music.", "output": "Send a detailed query to support@digipaywallet.com about the failed refund transaction and attach the transaction screenshot and order ID\nplay some chill electronic music"}
{"input": "Draft a recommendation request email to dr.neeraj.gupta@iitd.ac.in highlighting the internship I’m applying for and attach my resume and SOP draft, then check weather in Delhi tomorrow.", "output": "Draft a recommendation request email to dr.neeraj.gupta@iitd.ac.in highlighting the internship I’m applying for and attach my resume and SOP draft\ncheck weather in Delhi tomorrow"}
{"input": "Send a professional email to ravi.krishnan@quantumfintech.com summarizing the meeting discussion and attach the updated investment forecast PDF, then play some classical background music.", "output": "Send a professional email to ravi.krishnan@quantumfintech.com summarizing the meeting discussion and attach the updated investment forecast PDF\nplay some classical background music"}
{"input": "Email my training certificate and project report to swati.jain@skillboost.org and thank her for mentoring me during the AI course, then check temperature in Pune today.", "output": "Email my training certificate and project report to swati.jain@skillboost.org and thank her for mentoring me during the AI course\ncheck temperature in Pune today"}
{"input": "Send a clarification email to manoj.bhatia@bankplus.in regarding the account verification delay and attach the Aadhaar and PAN again, then check today’s forecast in Kolkata.", "output": "Send a clarification email to manoj.bhatia@bankplus.in regarding the account verification delay and attach the Aadhaar and PAN again\ncheck today’s forecast in Kolkata"}
{"input": "Email a leave request to hr@greenleafagro.com mentioning health reasons and attach the doctor’s prescription, then play peaceful nature sounds.", "output": "Email a leave request to hr@greenleafagro.com mentioning health reasons and attach the doctor’s prescription\nplay peaceful nature sounds"}
{"input": "Send an appreciation note to vikas.rao@fuseworks.dev for his help with the project deadline extension and ask if we can connect tomorrow, then play morning jazz.", "output": "Send an appreciation note to vikas.rao@fuseworks.dev for his help with the project deadline extension and ask if we can connect tomorrow\nplay morning jazz"}
{"input": "Send project timelines and feature roadmap as an email to client.support@zebracloud.io and attach the planning spreadsheet, then check news about tech layoffs.", "output": "Send project timelines and feature roadmap as an email to client.support@zebracloud.io and attach the planning spreadsheet\ncheck news about tech layoffs"}
{"input": "Write a thank-you email to anu.ravindran@ngoimpact.org for the volunteering opportunity and include the event feedback, then play an acoustic playlist.", "output": "Write a thank-you email to anu.ravindran@ngoimpact.org for the volunteering opportunity and include the event feedback\nplay an acoustic playlist"}
{"input": "Email my assignment draft on social inequality to professor.anita@univsocial.edu and ask if she can review by Monday, then play low-volume study music.", "output": "Email my assignment draft on social inequality to professor.anita@univsocial.edu and ask if she can review by Monday\nplay low-volume study music"}
{"input": "Send a formal query to embassy.visa@tokyomission.jp asking about missing document status for my visa application and attach the acknowledgment receipt, then check weather in Tokyo.", "output": "Send a formal query to embassy.visa@tokyomission.jp asking about missing document status for my visa application and attach the acknowledgment receipt\ncheck weather in Tokyo"}
{"input": "Email the edited blog post to editorial@travelcharmers.com with the revised photos and captions attached, then play some ambient soundscapes.", "output": "Email the edited blog post to editorial@travelcharmers.com with the revised photos and captions attached\nplay some ambient soundscapes"}
{"input": "Send a job application to radhika.hr@bitfinity.co for the role of QA Intern, include my CV and short portfolio link, then play some coding music.", "output": "Send a job application to radhika.hr@bitfinity.co for the role of QA Intern, include my CV and short portfolio link\nplay some coding music"}
{"input": "Email the source code and documentation of my app to ankit.mehta@techreviewers.net for review and mention known bugs in the README, then check the weather in Bengaluru.", "output": "Email the source code and documentation of my app to ankit.mehta@techreviewers.net for review and mention known bugs in the README\ncheck the weather in Bengaluru"}
{"input": "Send a query to cs.helpdesk@uniportal.edu regarding login issues with my ID and attach a screenshot of the error page, then play soft instrumental tracks.", "output": "Send a query to cs.helpdesk@uniportal.edu regarding login issues with my ID and attach a screenshot of the error page\nplay soft instrumental tracks"}
{"input": "Email a complaint to contact@freshmartonline.com about missing items in my grocery order and include photos of the package, then check today’s news.", "output": "Email a complaint to contact@freshmartonline.com about missing items in my grocery order and include photos of the package\ncheck today’s news"}
{"input": "Write to placement.cell@northcampus.edu about delay in my offer letter from Techly Inc and request an update, then play calm focus music.", "output": "Write to placement.cell@northcampus.edu about delay in my offer letter from Techly Inc and request an update\nplay calm focus music"}
{"input": "Email the updated presentation slides to mohit.bajaj@edtechlabs.in for his session and ask if I should also prepare a 2-minute intro script, then check weather in Hyderabad today.", "output": "Email the updated presentation slides to mohit.bajaj@edtechlabs.in for his session and ask if I should also prepare a 2-minute intro script\ncheck weather in Hyderabad today"}
{"input": "Send all tax documents to accountant@wealthsafe.in with a message requesting ITR filing support by this weekend, then play finance podcast.", "output": "Send all tax documents to accountant@wealthsafe.in with a message requesting ITR filing support by this weekend\nplay finance podcast"}
{"input": "Email my GRE scorecard and university shortlist to rakhi.advisor@higheredglobal.com and ask if she can help prioritize based on profile, then check if it's raining in Boston.", "output": "Email my GRE scorecard and university shortlist to rakhi.advisor@higheredglobal.com and ask if she can help prioritize based on profile\ncheck if it's raining in Boston"}
{"input": "Send a resignation email to devmanager@megabyteapps.com with last day details and request for experience letter, then play some rock music.", "output": "Send a resignation email to devmanager@megabyteapps.com with last day details and request for experience letter\nplay some rock music"}
{"input": "Send the edited policy draft to legal.head@transactcorp.net and highlight section 4 for her review, then check weather forecast in Mumbai.", "output": "Send the edited policy draft to legal.head@transactcorp.net and highlight section 4 for her review\ncheck weather forecast in Mumbai"}
{"input": "Email the RSVP for the wedding invite to tanvi.khandelwal@outlook.com and attach a digital gift card, then play happy celebration music.", "output": "Email the RSVP for the wedding invite to tanvi.khandelwal@outlook.com and attach a digital gift card\nplay happy celebration music"}
{"input": "Email the monthly progress report to director@projectgreen.in and include photos of all plantation activities and budget summary, then play peaceful flute music.", "output": "Email the monthly progress report to director@projectgreen.in and include photos of all plantation activities and budget summary\nplay peaceful flute music"}
{"input": "Send a delivery issue report to support@quickparcel.com regarding my late shipment and attach a photo of the damaged box, then check rain probability in Chennai.", "output": "Send a delivery issue report to support@quickparcel.com regarding my late shipment and attach a photo of the damaged box\ncheck rain probability in Chennai"}
{"input": "Send confirmation to sunil.gupta@journalhub.org for the paper review assignment and mention I’ll complete by June 14, then play lo-fi chill beats.", "output": "Send confirmation to sunil.gupta@journalhub.org for the paper review assignment and mention I’ll complete by June 14\nplay lo-fi chill beats"}
{"input": "Write a thank-you email to mentor.suman@futurefoundry.in for her help with my capstone project and include final GitHub repo link, then check the weather in Surat today.", "output": "Write a thank-you email to mentor.suman@futurefoundry.in for her help with my capstone project and include final GitHub repo link\ncheck the weather in Surat today"}
{"input": "Email a copy of the registration certificate to admin.office@digitalfest.org and confirm my booth number for Saturday, then play upbeat electronic music.", "output": "Email a copy of the registration certificate to admin.office@digitalfest.org and confirm my booth number for Saturday\nplay upbeat electronic music"}
{"input": "Send a proposal email to neha.sawant@eventorbits.com for co-hosting a tech panel in August and attach the draft agenda, then check Delhi’s weather for next Sunday.", "output": "Send a proposal email to neha.sawant@eventorbits.com for co-hosting a tech panel in August and attach the draft agenda\ncheck Delhi’s weather for next Sunday"}
{"input": "Email internship progress report to prof.iyer@iitm.ac.in and thank him for his recent suggestions, then check the weather in Kolkata for tomorrow.", "output": "Email internship progress report to prof.iyer@iitm.ac.in and thank him for his recent suggestions\ncheck the weather in Kolkata for tomorrow"}
{"input": "Send the invoice to billing@creativesnap.io and mention that payment is due in 7 days, then play 'Counting Stars' by OneRepublic.", "output": "Send the invoice to billing@creativesnap.io and mention that payment is due in 7 days\nplay 'Counting Stars' by OneRepublic"}
{"input": "Draft a reply to ankur.shah@newsnet.in asking for an interview slot on Thursday morning, then tell me today’s top news stories.", "output": "Draft a reply to ankur.shah@newsnet.in asking for an interview slot on Thursday morning\ntell me today’s top news stories"}
{"input": "Send apology email to clientcare@stylocity.com for the poor service experience and offer 15% discount, then play 'Someone You Loved' by Lewis Capaldi.", "output": "Send apology email to clientcare@stylocity.com for the poor service experience and offer 15% discount\nplay 'Someone You Loved' by Lewis Capaldi"}
{"input": "Mail my project synopsis to professor.nair@nitc.ac.in and confirm if he needs the full report too, then check if it will rain in Kochi tomorrow.", "output": "Mail my project synopsis to professor.nair@nitc.ac.in and confirm if he needs the full report too\ncheck if it will rain in Kochi tomorrow"}
{"input": "Send confirmation email to info@internconnect.org for the web development workshop on June 15, then play trending Bollywood songs.", "output": "Send confirmation email to info@internconnect.org for the web development workshop on June 15\nplay trending Bollywood songs"}
{"input": "Email the wireframe designs to dev.team@uihub.in and ask for review comments before Friday, then check this weekend’s weather in Bangalore.", "output": "Email the wireframe designs to dev.team@uihub.in and ask for review comments before Friday\ncheck this weekend’s weather in Bangalore"}
{"input": "Send the progress update to manager.ravi@solardrive.in and ask if there's a review meeting this week, then check latest energy sector news.", "output": "Send the progress update to manager.ravi@solardrive.in and ask if there's a review meeting this week\ncheck latest energy sector news"}
{"input": "Mail my resume and portfolio to jobs@creativebench.in with subject 'Graphic Designer Application', then play jazz instrumental music.", "output": "Mail my resume and portfolio to jobs@creativebench.in with subject 'Graphic Designer Application'\nplay jazz instrumental music"}
{"input": "Send a query to care@citymedhospitals.com asking about MRI scan costs and available slots, then check tomorrow’s weather in Noida.", "output": "Send a query to care@citymedhospitals.com asking about MRI scan costs and available slots\ncheck tomorrow’s weather in Noida"}
{"input": "Email the research methodology to team@deepmined.org and ask them to review section 3, then play a motivational podcast.", "output": "Email the research methodology to team@deepmined.org and ask them to review section 3\nplay a motivational podcast"}
{"input": "Send final travel itinerary to dad at rajeev.gupta@email.com and ask if he’s okay with flight timings, then check Delhi’s weekend forecast.", "output": "Send final travel itinerary to dad at rajeev.gupta@email.com and ask if he’s okay with flight timings\ncheck Delhi’s weekend forecast"}
{"input": "Email the client list to ajay.kumar@salesforce.in and mention we reached our Q2 targets, then play 'Believer' by Imagine Dragons.", "output": "Email the client list to ajay.kumar@salesforce.in and mention we reached our Q2 targets\nplay 'Believer' by Imagine Dragons"}
{"input": "Send an invitation mail to arjun.pillai@founderstack.com for our startup pitch demo on 9th July, then check the weather in Mumbai today.", "output": "Send an invitation mail to arjun.pillai@founderstack.com for our startup pitch demo on 9th July\ncheck the weather in Mumbai today"}
{"input": "Email the scanned admission documents to admissions@lawacademy.in and confirm the document checklist, then play 'Memories' by Maroon 5.", "output": "Email the scanned admission documents to admissions@lawacademy.in and confirm the document checklist\nplay 'Memories' by Maroon 5"}
{"input": "Send an email to events@coderfest.io asking for the final agenda and speaker list, then check tech news updates.", "output": "Send an email to events@coderfest.io asking for the final agenda and speaker list\ncheck tech news updates"}
{"input": "Mail the scanned passport copy to visa.help@travelbuddy.in and ask for next steps, then check weather for Zurich on 12th June.", "output": "Mail the scanned passport copy to visa.help@travelbuddy.in and ask for next steps\ncheck weather for Zurich on 12th June"}
{"input": "Send the monthly report to priya.mehta@greeninitiative.org and ask for comments on the water conservation section, then play nature sounds.", "output": "Send the monthly report to priya.mehta@greeninitiative.org and ask for comments on the water conservation section\nplay nature sounds"}
{"input": "Email my updated CV to recruiter@softworld.in with a note about my availability, then check if it’s raining in Ahmedabad now.", "output": "Email my updated CV to recruiter@softworld.in with a note about my availability\ncheck if it’s raining in Ahmedabad now"}
{"input": "Send event details to anjali.k@artsycircle.in and attach the artwork guidelines, then play classical Indian instrumental.", "output": "Send event details to anjali.k@artsycircle.in and attach the artwork guidelines\nplay classical Indian instrumental"}
{"input": "Email weekly scrum notes to all@aiinnovate.com and tag pending tasks, then check weather in Hyderabad on Monday.", "output": "Email weekly scrum notes to all@aiinnovate.com and tag pending tasks\ncheck weather in Hyderabad on Monday"}
{"input": "Send complaint email to support@bluestreamtv.com regarding streaming issues during matches, then check sports news headlines.", "output": "Send complaint email to support@bluestreamtv.com regarding streaming issues during matches\ncheck sports news headlines"}
{"input": "Mail appreciation note to volunteer@youthaction.org for organizing the tree plantation, then play upbeat morning music.", "output": "Mail appreciation note to volunteer@youthaction.org for organizing the tree plantation\nplay upbeat morning music"}
{"input": "Send congratulations email to amit.s@finshots.in for his award win and attach the article draft, then check finance headlines.", "output": "Send congratulations email to amit.s@finshots.in for his award win and attach the article draft\ncheck finance headlines"}
{"input": "Email cancellation request to bookings@hotelluxura.in and ask about refund timelines, then check weather forecast in Goa this weekend.", "output": "Email cancellation request to bookings@hotelluxura.in and ask about refund timelines\ncheck weather forecast in Goa this weekend"}
{"input": "Mail the conference slides to speaker.team@eduleaders.in and confirm my session timing, then play motivational Hindi songs.", "output": "Mail the conference slides to speaker.team@eduleaders.in and confirm my session timing\nplay motivational Hindi songs"}
{"input": "Email signed MoU to legal@startuplaw.co.in with subject 'Partnership - ZipBot AI' and ask for notarized copy, then check today’s business news.", "output": "Email signed MoU to legal@startuplaw.co.in with subject 'Partnership - ZipBot AI' and ask for notarized copy\ncheck today’s business news"}
{"input": "Send an inquiry email to admissions@neodesignschool.edu about their UI/UX course deadlines, then play Lo-fi chill beats playlist.", "output": "Send an inquiry email to admissions@neodesignschool.edu about their UI/UX course deadlines\nplay Lo-fi chill beats playlist"}
{"input": "Mail acknowledgment receipt to contact@ecoexchangenetwork.org for donation ID 4743 and thank them, then check climate-related news updates.", "output": "Mail acknowledgment receipt to contact@ecoexchangenetwork.org for donation ID 4743 and thank them\ncheck climate-related news updates"}
{"input": "Send the visa approval documents to support@visamadeeasy.com and request confirmation email, then check temperature in Toronto today.", "output": "Send the visa approval documents to support@visamadeeasy.com and request confirmation email\ncheck temperature in Toronto today"}
{"input": "Send a follow-up email to karan.bhatt@techventures.com about the UI feedback and include the new wireframe images, then check the weather in Bangalore.", "output": "Send a follow-up email to karan.bhatt@techventures.com about the UI feedback and include the new wireframe images\ncheck the weather in Bangalore"}
{"input": "Play 'Imagine' by John Lennon and draft an email to alex.cho@musicscene.org thanking him for the concert tickets.", "output": "Play 'Imagine' by John Lennon\ndraft an email to alex.cho@musicscene.org thanking him for the concert tickets"}
{"input": "Set a reminder for the client call at 3 PM and send an email to jyoti.r@bizconnect.in summarizing the agenda.", "output": "Set a reminder for the client call at 3 PM\nsend an email to jyoti.r@bizconnect.in summarizing the agenda"}
{"input": "Email the bug report to qa.team@webengine.com and attach the screen recording, then play some ambient music.", "output": "Email the bug report to qa.team@webengine.com and attach the screen recording\nplay some ambient music"}
{"input": "Check tomorrow’s weather in Ooty and email the packing list to arya.mehta@explorers.co for our trip.", "output": "Check tomorrow’s weather in Ooty\nemail the packing list to arya.mehta@explorers.co for our trip"}
{"input": "Send a polite email to support@fastcourier.in regarding the delayed package with the tracking ID, and then check the news.", "output": "Send a polite email to support@fastcourier.in regarding the delayed package with the tracking ID\ncheck the news"}
{"input": "Schedule a reminder to renew the gym membership next Monday and email the invoice to finance@lifestylehub.com.", "output": "Schedule a reminder to renew the gym membership next Monday\nemail the invoice to finance@lifestylehub.com"}
{"input": "Email the client at tanvi.r@mediclinic.org confirming the delivery of the medical kits and attach the invoice, then check the weather in Jaipur.", "output": "Email the client at tanvi.r@mediclinic.org confirming the delivery of the medical kits and attach the invoice\ncheck the weather in Jaipur"}
{"input": "Send an email to sushil.singh@trainerspace.net with my workout logs from the last 2 weeks and then play some gym music.", "output": "Send an email to sushil.singh@trainerspace.net with my workout logs from the last 2 weeks\nplay some gym music"}
{"input": "Check if it will snow in Shimla this weekend and then send an email to rhea.kapoor@adventuremail.com with my itinerary.", "output": "Check if it will snow in Shimla this weekend\nsend an email to rhea.kapoor@adventuremail.com with my itinerary"}
{"input": "Play 'Bohemian Rhapsody' by Queen and send a thank-you note to nikhil.b@learninglabs.edu for the online workshop.", "output": "Play 'Bohemian Rhapsody' by Queen\nsend a thank-you note to nikhil.b@learninglabs.edu for the online workshop"}
{"input": "Send a detailed status update email to pooja.r@cloudsync.net and attach the performance graph from this quarter, then check today’s headlines.", "output": "Send a detailed status update email to pooja.r@cloudsync.net and attach the performance graph from this quarter\ncheck today’s headlines"}
{"input": "Draft an email to surbhi.accounts@paytrust.org clarifying the last two transactions and request a statement, then play acoustic guitar music.", "output": "Draft an email to surbhi.accounts@paytrust.org clarifying the last two transactions and request a statement\nplay acoustic guitar music"}
{"input": "Set a reminder to wish mom happy birthday tomorrow morning and email the party invite to close.family@outlook.com.", "output": "Set a reminder to wish mom happy birthday tomorrow morning\nemail the party invite to close.family@outlook.com"}
{"input": "Send a mail to tarun.bajaj@dailyblog.io pitching my article idea about sustainable travel, then check the weather in Kochi.", "output": "Send a mail to tarun.bajaj@dailyblog.io pitching my article idea about sustainable travel\ncheck the weather in Kochi"}
{"input": "Play morning meditation music and email my wellness tracker to coach.rina@mindspace.fit.", "output": "Play morning meditation music\nemail my wellness tracker to coach.rina@mindspace.fit"}
{"input": "Send a note of appreciation to hemant.gupta@openbuild.com for helping with the architecture sketches, then check if it’s windy in Surat.", "output": "Send a note of appreciation to hemant.gupta@openbuild.com for helping with the architecture sketches\ncheck if it’s windy in Surat"}
{"input": "Check today’s news in technology and forward the highlights to ritu.shah@devtalks.in.", "output": "Check today’s news in technology\nforward the highlights to ritu.shah@devtalks.in"}
{"input": "Email all scanned documents to admissions@globaluniv.ac.in and request an application status update, then play some instrumental focus music.", "output": "Email all scanned documents to admissions@globaluniv.ac.in and request an application status update\nplay some instrumental focus music"}
{"input": "Set a reminder to call grandma at 6 PM and email the doctor appointment details to mom.kavita@caremail.org.", "output": "Set a reminder to call grandma at 6 PM\nemail the doctor appointment details to mom.kavita@caremail.org"}
{"input": "Play 'Channa Mereya' and send a support ticket to helpdesk@mobitech.io about the non-responsive screen issue.", "output": "Play 'Channa Mereya'\nsend a support ticket to helpdesk@mobitech.io about the non-responsive screen issue"}
{"input": "Email my academic transcript to lavanya.k@gradschool.in with a note requesting feedback, then check if there’s rain expected in Lucknow.", "output": "Email my academic transcript to lavanya.k@gradschool.in with a note requesting feedback\ncheck if there’s rain expected in Lucknow"}
{"input": "Send a birthday greeting email to neha.d@bakersclub.com and attach the cake photo from yesterday, then play some cheerful tunes.", "output": "Send a birthday greeting email to neha.d@bakersclub.com and attach the cake photo from yesterday\nplay some cheerful tunes"}
{"input": "Check today’s weather in Varanasi and send a follow-up email to mr.ali@heritagegroup.com about the cultural trip proposal.", "output": "Check today’s weather in Varanasi\nsend a follow-up email to mr.ali@heritagegroup.com about the cultural trip proposal"}
{"input": "Email the contract draft to prakash.legal@rightsandco.com and confirm the review date, then play relaxing jazz music.", "output": "Email the contract draft to prakash.legal@rightsandco.com and confirm the review date\nplay relaxing jazz music"}
{"input": "Set a schedule for weekly team syncs every Monday at 11 AM and email the invite to group.dev@infinitytech.com.", "output": "Set a schedule for weekly team syncs every Monday at 11 AM\nemail the invite to group.dev@infinitytech.com"}
{"input": "Send a follow-up email to recruiter@jobnetworks.com about the interview schedule and attach my availability, then play career coaching podcast.", "output": "Send a follow-up email to recruiter@jobnetworks.com about the interview schedule and attach my availability\nplay career coaching podcast"}
{"input": "Play 'Zinda' from Bhaag Milkha Bhaag and send a thank-you email to shalini.kapoor@eventify.org for the inspiring talk.", "output": "Play 'Zinda' from Bhaag Milkha Bhaag\nsend a thank-you email to shalini.kapoor@eventify.org for the inspiring talk"}
{"input": "Send an apology email to rahul.verma@freelanceworks.io for the delayed delivery and promise compensation, then check if it’s cloudy in Udaipur.", "output": "Send an apology email to rahul.verma@freelanceworks.io for the delayed delivery and promise compensation\ncheck if it’s cloudy in Udaipur"}
{"input": "Email a formal request to info@embassyconnect.org for visa processing help and attach my travel history, then play international instrumental music.", "output": "Email a formal request to info@embassyconnect.org for visa processing help and attach my travel history\nplay international instrumental music"}
{"input": "Check news updates about sports and email the summary to deepak.shah@sportslink.in.", "output": "Check news updates about sports\nemail the summary to deepak.shah@sportslink.in"}
{"input": "Play a rain sounds playlist and email my photography portfolio to sneha.gallery@showcase.com.", "output": "Play a rain sounds playlist\nemail my photography portfolio to sneha.gallery@showcase.com"}
{"input": "Set a reminder to renew my subscription on Friday and email the confirmation to my team at tools.access@workflowhub.com.", "output": "Set a reminder to renew my subscription on Friday\nemail the confirmation to my team at tools.access@workflowhub.com"}
{"input": "Send a detailed feedback email to helpdesk@fooddelivery.com about my last order and attach the receipt, then check the weather in Patna.", "output": "Send a detailed feedback email to helpdesk@fooddelivery.com about my last order and attach the receipt\ncheck the weather in Patna"}
{"input": "Check if it’s sunny in Nashik and then send an invitation email to rajesh.g@weekendbikers.com for a ride.", "output": "Check if it’s sunny in Nashik\nsend an invitation email to rajesh.g@weekendbikers.com for a ride"}
{"input": "Play 'Weightless' by Marconi Union and email the scanned notes to my study group at notes.sharing@edu.net.", "output": "Play 'Weightless' by Marconi Union\nemail the scanned notes to my study group at notes.sharing@edu.net"}
{"input": "Send an urgent mail to dr.nikita@healthtrack.com with test results attached and ask for advice, then check today’s medical news.", "output": "Send an urgent mail to dr.nikita@healthtrack.com with test results attached and ask for advice\ncheck today’s medical news"}
{"input": "Email the slides for tomorrow’s pitch to founders@startdeck.io and confirm the time, then play a confidence boosting playlist.", "output": "Email the slides for tomorrow’s pitch to founders@startdeck.io and confirm the time\nplay a confidence boosting playlist"}
{"input": "Check weather in Lonavala and send an email to bookings@hilltophotels.com confirming the stay dates.", "output": "Check weather in Lonavala\nsend an email to bookings@hilltophotels.com confirming the stay dates"}
{"input": "Set a reminder to submit tax documents next Tuesday and send a mail to taxhelp@finexpert.org asking for file format.", "output": "Set a reminder to submit tax documents next Tuesday\nsend a mail to taxhelp@finexpert.org asking for file format"}
{"input": "Send a job reference request to anjali.rana@workproof.com and attach my updated resume, then play energizing morning music.", "output": "Send a job reference request to anjali.rana@workproof.com and attach my updated resume\nplay energizing morning music"}
{"input": "Play nature sounds and email my daily reflection to self.journal@mindnote.app.", "output": "Play nature sounds\nemail my daily reflection to self.journal@mindnote.app"}
{"input": "Email a cancellation notice to reservations@urbanstay.com for next weekend’s booking and ask for refund policy, then check today’s news.", "output": "Email a cancellation notice to reservations@urbanstay.com for next weekend’s booking and ask for refund policy\ncheck today’s news"}
{"input": "Set a schedule for yoga every morning at 7 AM and email it to my calendar at routines@sync.me.", "output": "Set a schedule for yoga every morning at 7 AM\nemail it to my calendar at routines@sync.me"}
{"input": "Send a mail to nina@fashioncircle.in asking for updates on the order shipment, then play the latest Bollywood hits.", "output": "Send a mail to nina@fashioncircle.in asking for updates on the order shipment\nplay the latest Bollywood hits"}
{"input": "Email feedback on the app performance to devteam@apppulse.com with screenshots, then check weather in Guwahati.", "output": "Email feedback on the app performance to devteam@apppulse.com with screenshots\ncheck weather in Guwahati"}
{"input": "Email the final presentation slides to mentor.akshay@startuplabs.in and request feedback by Friday, then check the weather in Pune for tomorrow.", "output": "Email the final presentation slides to mentor.akshay@startuplabs.in and request feedback by Friday\ncheck the weather in Pune for tomorrow"}
{"input": "Send an email to hr@fintechcorp.com with my updated CV and ask about interview dates, then play 'Shape of You' by Ed Sheeran.", "output": "Send an email to hr@fintechcorp.com with my updated CV and ask about interview dates\nplay 'Shape of You' by Ed Sheeran"}
{"input": "Email client support at help@shopquick.in regarding delayed delivery and ask for refund status, then check if it will rain in Chennai today.", "output": "Email client support at help@shopquick.in regarding delayed delivery and ask for refund status\ncheck if it will rain in Chennai today"}
{"input": "Mail the quarterly budget report to finance.team@corporate.in and ask for approval, then check the latest stock market news.", "output": "Mail the quarterly budget report to finance.team@corporate.in and ask for approval\ncheck the latest stock market news"}
{"input": "Send a thank you email to coach.sanjay@sportsacademy.com for the training sessions, then play upbeat workout music.", "output": "Send a thank you email to coach.sanjay@sportsacademy.com for the training sessions\nplay upbeat workout music"}
{"input": "Email the event itinerary to priyanka.m@eventplanners.co and confirm vendor arrival times, then check weather forecast for Delhi on Sunday.", "output": "Email the event itinerary to priyanka.m@eventplanners.co and confirm vendor arrival times\ncheck weather forecast for Delhi on Sunday"}
{"input": "Send meeting minutes to team@techinnovators.net highlighting action points, then check upcoming tech conference news.", "output": "Send meeting minutes to team@techinnovators.net highlighting action points\ncheck upcoming tech conference news"}
{"input": "Email the signed contract to legal@greenenergy.org and request a countersigned copy, then play relaxing nature sounds.", "output": "Email the signed contract to legal@greenenergy.org and request a countersigned copy\nplay relaxing nature sounds"}
{"input": "Send a feedback email to feedback@movieflix.com about buffering issues experienced during last weekend, then check entertainment news updates.", "output": "Send a feedback email to feedback@movieflix.com about buffering issues experienced during last weekend\ncheck entertainment news updates"}
{"input": "Mail my internship application to hr@medtechsolutions.com and ask about the selection timeline, then check weather in Hyderabad for next Monday.", "output": "Mail my internship application to hr@medtechsolutions.com and ask about the selection timeline\ncheck weather in Hyderabad for next Monday"}
{"input": "Email a reminder to team.leads@softwarehub.io about code freeze deadline next week, then play instrumental focus music.", "output": "Email a reminder to team.leads@softwarehub.io about code freeze deadline next week\nplay instrumental focus music"}
{"input": "Send a complaint to support@internetproviders.in regarding slow connection and request a technician visit, then check if it will rain in Kolkata tomorrow.", "output": "Send a complaint to support@internetproviders.in regarding slow connection and request a technician visit\ncheck if it will rain in Kolkata tomorrow"}
{"input": "Mail the research paper draft to prof.kapoor@university.edu and ask for comments by Wednesday, then check academic news headlines.", "output": "Mail the research paper draft to prof.kapoor@university.edu and ask for comments by Wednesday\ncheck academic news headlines"}
{"input": "Send an email to booking@luxuryresort.com to confirm reservation for 4 guests on 15th July, then check Goa weather forecast for the weekend.", "output": "Send an email to booking@luxuryresort.com to confirm reservation for 4 guests on 15th July\ncheck Goa weather forecast for the weekend"}
{"input": "Email customer service at care@autotech.in regarding warranty claim status, then play jazz classics playlist.", "output": "Email customer service at care@autotech.in regarding warranty claim status\nplay jazz classics playlist"}
{"input": "Send invitation email to partners@biznetwork.com for networking event on 10th August, then check business news updates.", "output": "Send invitation email to partners@biznetwork.com for networking event on 10th August\ncheck business news updates"}
{"input": "Mail the project timeline to project.manager@buildcorp.com and ask about resource availability, then check weather forecast in Chennai for the weekend.", "output": "Mail the project timeline to project.manager@buildcorp.com and ask about resource availability\ncheck weather forecast in Chennai for the weekend"}
{"input": "Send application status inquiry to admissions@designschool.in, then play Lo-fi hip-hop beats.", "output": "Send application status inquiry to admissions@designschool.in\nplay Lo-fi hip-hop beats"}
{"input": "Email the support team at help@streamingworld.com about subscription renewal issues, then check entertainment news today.", "output": "Email the support team at help@streamingworld.com about subscription renewal issues\ncheck entertainment news today"}
{"input": "Mail updated sales figures to sales.head@marketleaders.in and request feedback, then check market trend news.", "output": "Mail updated sales figures to sales.head@marketleaders.in and request feedback\ncheck market trend news"}
{"input": "Send thank you email to recruiter@hiringzone.com for interview opportunity, then play acoustic guitar songs.", "output": "Send thank you email to recruiter@hiringzone.com for interview opportunity\nplay acoustic guitar songs"}
{"input": "Email complaint to complaints@fooddelivery.in about cold food delivery and request refund, then check weather forecast in Pune today.", "output": "Email complaint to complaints@fooddelivery.in about cold food delivery and request refund\ncheck weather forecast in Pune today"}
{"input": "Mail project status update to lead.dev@codefactory.io and ask about next milestones, then check latest tech news.", "output": "Mail project status update to lead.dev@codefactory.io and ask about next milestones\ncheck latest tech news"}
{"input": "Send feedback to feedback@fitnessapp.com about workout plan suggestions, then play energetic workout playlist.", "output": "Send feedback to feedback@fitnessapp.com about workout plan suggestions\nplay energetic workout playlist"}
{"input": "Email request to info@conferencehub.com about speaker slots availability, then check upcoming event news.", "output": "Email request to info@conferencehub.com about speaker slots availability\ncheck upcoming event news"}
{"input": "Send order confirmation email to customersupport@shopmart.in for order #45789, then check local weather in Mumbai today.", "output": "Send order confirmation email to customersupport@shopmart.in for order #45789\ncheck local weather in Mumbai today"}
{"input": "Mail newsletter draft to marketing@newsdaily.com and ask for approval, then play soft piano music.", "output": "Mail newsletter draft to marketing@newsdaily.com and ask for approval\nplay soft piano music"}
{"input": "Email the volunteer list to coordinator@helpinghands.org and confirm attendance numbers, then check charity event news.", "output": "Email the volunteer list to coordinator@helpinghands.org and confirm attendance numbers\ncheck charity event news"}
{"input": "Send reminder to team@projectx.io about submission deadline, then check weather forecast in Bangalore for next week.", "output": "Send reminder to team@projectx.io about submission deadline\ncheck weather forecast in Bangalore for next week"}
{"input": "Mail the invoice to accounts@webworks.com and ask for payment confirmation, then play relaxing jazz music.", "output": "Mail the invoice to accounts@webworks.com and ask for payment confirmation\nplay relaxing jazz music"}
{"input": "Send application follow-up email to admissions@artcollege.edu, then check art exhibition news updates.", "output": "Send application follow-up email to admissions@artcollege.edu\ncheck art exhibition news updates"}
{"input": "Email the error report to techsupport@cloudsolutions.com and request urgent fix, then play coding focus playlist.", "output": "Email the error report to techsupport@cloudsolutions.com and request urgent fix\nplay coding focus playlist"}
{"input": "Send sponsorship proposal to sponsors@charityrun.org and ask for meeting schedule, then check health and fitness news.", "output": "Send sponsorship proposal to sponsors@charityrun.org and ask for meeting schedule\ncheck health and fitness news"}
{"input": "Mail workshop attendance sheet to training@skillup.com and request certificate issuance, then check online learning news.", "output": "Mail workshop attendance sheet to training@skillup.com and request certificate issuance\ncheck online learning news"}
{"input": "Email new product launch details to marketing.team@retailhub.com and ask for campaign ideas, then play upbeat pop music.", "output": "Email new product launch details to marketing.team@retailhub.com and ask for campaign ideas\nplay upbeat pop music"}
{"input": "Send query email to info@travelguru.com about visa requirements for Japan, then check travel news updates.", "output": "Send query email to info@travelguru.com about visa requirements for Japan\ncheck travel news updates"}
{"input": "Mail final thesis draft to advisor@university.edu and request review, then check academic conference news.", "output": "Mail final thesis draft to advisor@university.edu and request review\ncheck academic conference news"}
{"input": "Send feedback email to support@gadgetrepair.com about repair delays, then play soothing instrumental music.", "output": "Send feedback email to support@gadgetrepair.com about repair delays\nplay soothing instrumental music"}
{"input": "Email RSVP to events@companyparty.com confirming attendance, then check weekend weather forecast.", "output": "Email RSVP to events@companyparty.com confirming attendance\ncheck weekend weather forecast"}
{"input": "Mail invoice receipt to client.accounts@designworks.com and thank for timely payment, then play classical music playlist.", "output": "Mail invoice receipt to client.accounts@designworks.com and thank for timely payment\nplay classical music playlist"}
{"input": "Send notification email to subscribers@newsletter.com about upcoming maintenance, then check technology news updates.", "output": "Send notification email to subscribers@newsletter.com about upcoming maintenance\ncheck technology news updates"}
{"input": "Email support@onlinecourses.com to reset my password and ask about course extensions, then play calm study music.", "output": "Email support@onlinecourses.com to reset my password and ask about course extensions\nplay calm study music"}
{"input": "Send inquiry to admissions@engineeringcollege.in about scholarship application deadlines, then check education news.", "output": "Send inquiry to admissions@engineeringcollege.in about scholarship application deadlines\ncheck education news"}
{"input": "Mail project proposal to partners@innovatehub.com and request collaboration meeting, then check startup news.", "output": "Mail project proposal to partners@innovatehub.com and request collaboration meeting\ncheck startup news"}
{"input": "Send follow-up email to hr@companyx.com regarding job application status, then play soft background music.", "output": "Send follow-up email to hr@companyx.com regarding job application status\nplay soft background music"}
{"input": "Send a progress update to neha.b@finstrategy.in summarizing last week's client feedback, then set a reminder for tomorrow's 11 AM call with the client.", "output": "Send a progress update to neha.b@finstrategy.in summarizing last week's client feedback\nset a reminder for tomorrow's 11 AM call with the client"}
{"input": "Email karan.r@buildtech.org regarding the blueprint revisions and attach the CAD file, then check the current weather in Ahmedabad.", "output": "Email karan.r@buildtech.org regarding the blueprint revisions and attach the CAD file\ncheck the current weather in Ahmedabad"}
{"input": "Set a schedule for my dentist appointment on Friday at 3 PM and then email the confirmation to clinic@smilespa.in.", "output": "Set a schedule for my dentist appointment on Friday at 3 PM\nemail the confirmation to clinic@smilespa.in"}
{"input": "Play 'Counting Stars' by OneRepublic and send a feedback email to yoga@zenzone.com about the new online class.", "output": "Play 'Counting Stars' by OneRepublic\nsend a feedback email to yoga@zenzone.com about the new online class"}
{"input": "Draft an email to my thesis advisor at rgupta@univmail.edu about final chapter edits and request a review timeline, then check the forecast for tomorrow in Chandigarh.", "output": "Draft an email to my thesis advisor at rgupta@univmail.edu about final chapter edits and request a review timeline\ncheck the forecast for tomorrow in Chandigarh"}
{"input": "Send meeting slides to sumit@ideaworks.io before 4 PM and also check today’s business headlines.", "output": "Send meeting slides to sumit@ideaworks.io before 4 PM\ncheck today’s business headlines"}
{"input": "Check the rain forecast in Udaipur and then email the cultural fest itinerary to anjali.fest@artsclub.net.", "output": "Check the rain forecast in Udaipur\nemail the cultural fest itinerary to anjali.fest@artsclub.net"}
{"input": "Play some ambient background music and email the lecture notes to batch2023@collegemail.org.", "output": "Play some ambient background music\nemail the lecture notes to batch2023@collegemail.org"}
{"input": "Email shweta.nair@designpilot.io about the banner mockup delays and ask for a revised timeline, then check the weather conditions in Surat.", "output": "Email shweta.nair@designpilot.io about the banner mockup delays and ask for a revised timeline\ncheck the weather conditions in Surat"}
{"input": "Send the final invoice to billing@clientconnect.com and then play some instrumental music.", "output": "Send the final invoice to billing@clientconnect.com\nplay some instrumental music"}
{"input": "Schedule a reminder for my performance review next Monday at 2 PM and email the calendar invite to my manager at a.mitra@teamfusion.co.", "output": "Schedule a reminder for my performance review next Monday at 2 PM\nemail the calendar invite to my manager at a.mitra@teamfusion.co"}
{"input": "Play 'Shallow' by Lady Gaga and email the song link to my friend at tara.musiclover@gmail.com.", "output": "Play 'Shallow' by Lady Gaga\nemail the song link to my friend at tara.musiclover@gmail.com"}
{"input": "Email satish@bizconnect.org the data analytics report and ask for feedback by Friday, then check if it’s sunny in Bhopal.", "output": "Email satish@bizconnect.org the data analytics report and ask for feedback by Friday\ncheck if it’s sunny in Bhopal"}
{"input": "Check today's top stories in tech and email them to rahul.techie@post.com.", "output": "Check today's top stories in tech\nemail them to rahul.techie@post.com"}
{"input": "Send an appreciation message to my assistant at v.kapoor@taskaid.in and attach the final weekly summary, then play some relaxing jazz.", "output": "Send an appreciation message to my assistant at v.kapoor@taskaid.in and attach the final weekly summary\nplay some relaxing jazz"}
{"input": "Play 'Bohemian Rhapsody' and email my sister at neeta.home@gmail.com about mom's birthday dinner.", "output": "Play 'Bohemian Rhapsody'\nemail my sister at neeta.home@gmail.com about mom's birthday dinner"}
{"input": "Set a reminder to water the plants every morning at 7 AM and email my gardener at greenspace.services@yahoo.com.", "output": "Set a reminder to water the plants every morning at 7 AM\nemail my gardener at greenspace.services@yahoo.com"}
{"input": "Email the meeting notes to office@urbaninfra.com and then check if it’s going to rain in Kochi today.", "output": "Email the meeting notes to office@urbaninfra.com\ncheck if it’s going to rain in Kochi today"}
{"input": "Send a formal complaint to support@broadbandindia.com about the frequent connection drop, then check the weather in Kolkata.", "output": "Send a formal complaint to support@broadbandindia.com about the frequent connection drop\ncheck the weather in Kolkata"}
{"input": "Schedule a reminder for dad's checkup this Saturday at 9:30 AM and email the appointment details to dr.sinha@cityclinic.org.", "output": "Schedule a reminder for dad's checkup this Saturday at 9:30 AM\nemail the appointment details to dr.sinha@cityclinic.org"}
{"input": "Play some romantic Bollywood songs and send a thank-you email to the photographer at rishi.frames@pixmail.com.", "output": "Play some romantic Bollywood songs\nsend a thank-you email to the photographer at rishi.frames@pixmail.com"}
{"input": "Email the new blog draft to content@writehub.com and ask for suggestions, then check the weekend weather in Ooty.", "output": "Email the new blog draft to content@writehub.com and ask for suggestions\ncheck the weekend weather in Ooty"}
{"input": "Send my report card to dad at anil.gupta@rediffmail.com and then play some instrumental flute music.", "output": "Send my report card to dad at anil.gupta@rediffmail.com\nplay some instrumental flute music"}
{"input": "Set a daily reminder to meditate at 6 AM and email the meditation guide to wellness@mindspace.in.", "output": "Set a daily reminder to meditate at 6 AM\nemail the meditation guide to wellness@mindspace.in"}
{"input": "Check the latest political news and forward it to my uncle at rajat.politics@mail.com.", "output": "Check the latest political news\nforward it to my uncle at rajat.politics@mail.com"}
{"input": "Send a summary of today’s classes to my tuition teacher at deepa.classes@gmail.com, then play concentration music.", "output": "Send a summary of today’s classes to my tuition teacher at deepa.classes@gmail.com\nplay concentration music"}
{"input": "Play 'Faded' by Alan Walker and email my school project to s.teacher@school.edu.", "output": "Play 'Faded' by Alan Walker\nemail my school project to s.teacher@school.edu"}
{"input": "Email my mentor at dr.malhotra@institute.org regarding the research article review and attach the draft, then check weather in Varanasi.", "output": "Email my mentor at dr.malhotra@institute.org regarding the research article review and attach the draft\ncheck weather in Varanasi"}
{"input": "Schedule a reminder to renew my insurance policy on June 15 and send a confirmation email to support@insureplus.com.", "output": "Schedule a reminder to renew my insurance policy on June 15\nsend a confirmation email to support@insureplus.com"}
{"input": "Check weather in Mangalore and send an itinerary mail to sujata.travel@vacayhub.org for next week's beach trip.", "output": "Check weather in Mangalore\nsend an itinerary mail to sujata.travel@vacayhub.org for next week's beach trip"}
{"input": "Send feedback to my online tutor at tutor.review@learnnow.in and then play soft piano music.", "output": "Send feedback to my online tutor at tutor.review@learnnow.in\nplay soft piano music"}
{"input": "Play 'Blinding Lights' by The Weeknd and email the song to anusha.music@gmail.com.", "output": "Play 'Blinding Lights' by The Weeknd\nemail the song to anusha.music@gmail.com"}
{"input": "Schedule a calendar event for my webinar on Thursday 8 PM and send a reminder email to audience@learntrack.org.", "output": "Schedule a calendar event for my webinar on Thursday 8 PM\nsend a reminder email to audience@learntrack.org"}
{"input": "Email a bug report with screenshots to dev.support@bugtrack.com and check news related to latest software updates.", "output": "Email a bug report with screenshots to dev.support@bugtrack.com\ncheck news related to latest software updates"}
{"input": "Send a message to hr@brightjobs.in confirming my availability for the interview, and then check tomorrow’s weather in Lucknow.", "output": "Send a message to hr@brightjobs.in confirming my availability for the interview\ncheck tomorrow’s weather in Lucknow"}
{"input": "Play a random upbeat track and email my schedule to avinash@workforcehub.com for review.", "output": "Play a random upbeat track\nemail my schedule to avinash@workforcehub.com for review"}
{"input": "Email the final event schedule to team.leads@conferencezone.com and then check weather in Jaipur for this weekend.", "output": "Email the final event schedule to team.leads@conferencezone.com\ncheck weather in Jaipur for this weekend"}
{"input": "Check news about India’s stock market today and send a summary to money@investorcircle.in.", "output": "Check news about India’s stock market today\nsend a summary to money@investorcircle.in"}
{"input": "Play 'Perfect' by Ed Sheeran and email wedding invite details to guestlist@weddingmail.com.", "output": "Play 'Perfect' by Ed Sheeran\nemail wedding invite details to guestlist@weddingmail.com"}
{"input": "Set a schedule to submit the report by 6 PM tomorrow and email a heads-up to project.manager@taskboard.net.", "output": "Set a schedule to submit the report by 6 PM tomorrow\nemail a heads-up to project.manager@taskboard.net"}
{"input": "Check today’s weather in Shimla and email trip details to shalini@getaways.in.", "output": "Check today’s weather in Shimla\nemail trip details to shalini@getaways.in"}
{"input": "Send the presentation deck to board@startupdeck.com and then play focus-enhancing music.", "output": "Send the presentation deck to board@startupdeck.com\nplay focus-enhancing music"}
{"input": "Email my sister at pooja.kapoor@family.org with the grocery list and check if it’s going to rain in Delhi.", "output": "Email my sister at pooja.kapoor@family.org with the grocery list\ncheck if it’s going to rain in Delhi"}
{"input": "Send reminder to rahul.office@workbay.com about tomorrow’s budget meeting and then check economic news.", "output": "Send reminder to rahul.office@workbay.com about tomorrow’s budget meeting\ncheck economic news"}
{"input": "Set a recurring reminder to walk at 6:30 AM daily and email it to my accountability group at wellness@dailytrack.org.", "output": "Set a recurring reminder to walk at 6:30 AM daily\nemail it to my accountability group at wellness@dailytrack.org"}
{"input": "Play devotional bhajans and send a birthday greeting email to uncle.ravi@family.net.", "output": "Play devotional bhajans\nsend a birthday greeting email to uncle.ravi@family.net"}
{"input": "Email bug log to it.support@techops.in and ask for a follow-up by Friday, then check weather in Gurgaon.", "output": "Email bug log to it.support@techops.in and ask for a follow-up by Friday\ncheck weather in Gurgaon"}
{"input": "Play 'Lovely' by Billie Eilish and Khalid and email lyrics to my friend at melissa.lyricslover@yahoo.com.", "output": "Play 'Lovely' by Billie Eilish and Khalid\nemail lyrics to my friend at melissa.lyricslover@yahoo.com"}
{"input": "Schedule a reminder to submit tax documents by next Wednesday 3 PM and email a checklist to finance@docsafe.net.", "output": "Schedule a reminder to submit tax documents by next Wednesday 3 PM\nemail a checklist to finance@docsafe.net"}
{"input": "Send a detailed update email to arjun.singh@finserve.com about the Q2 budget cuts and attach the revised Excel sheets, then check if it will rain in Ahmedabad today.", "output": "Send a detailed update email to arjun.singh@finserve.com about the Q2 budget cuts and attach the revised Excel sheets\ncheck if it will rain in Ahmedabad today"}
{"input": "Email the final draft of the research paper to dr.kaur@medicaluni.edu with all citations formatted, then play soothing piano music.", "output": "Email the final draft of the research paper to dr.kaur@medicaluni.edu with all citations formatted\nplay soothing piano music"}
{"input": "Send a progress report email to sanjay.patel@constructco.com outlining milestones achieved and include photos of site work, then check today’s temperature in Jaipur.", "output": "Send a progress report email to sanjay.patel@constructco.com outlining milestones achieved and include photos of site work\ncheck today’s temperature in Jaipur"}
{"input": "Email a request to support@softwaresolutions.io about a bug in the latest update and attach error logs, then play upbeat instrumental music.", "output": "Email a request to support@softwaresolutions.io about a bug in the latest update and attach error logs\nplay upbeat instrumental music"}
{"input": "Send an invitation email to priyanka.mehta@eventsco.com for the product launch event with RSVP details, then check weather forecast for Mumbai this weekend.", "output": "Send an invitation email to priyanka.mehta@eventsco.com for the product launch event with RSVP details\ncheck weather forecast for Mumbai this weekend"}
{"input": "Email my internship report with all charts embedded to rajesh.kumar@techacademy.in and thank him for the opportunity, then play classical violin music.", "output": "Email my internship report with all charts embedded to rajesh.kumar@techacademy.in and thank him for the opportunity\nplay classical violin music"}
{"input": "Send an email to hr@globalventures.com applying for the marketing analyst position and attach my updated resume and cover letter, then check the weather in Gurgaon.", "output": "Send an email to hr@globalventures.com applying for the marketing analyst position and attach my updated resume and cover letter\ncheck the weather in Gurgaon"}
{"input": "Email a feedback report to feedback@shopnship.com about delayed delivery and attach photos of the package condition, then play ambient relaxation music.", "output": "Email a feedback report to feedback@shopnship.com about delayed delivery and attach photos of the package condition\nplay ambient relaxation music"}
{"input": "Send a request to it.helpdesk@corpnet.com to reset my VPN access and mention urgency, then check the current temperature in Bangalore.", "output": "Send a request to it.helpdesk@corpnet.com to reset my VPN access and mention urgency\ncheck the current temperature in Bangalore"}
{"input": "Email the completed financial audit to cfo@smartfinance.com and include notes on discrepancies found, then play some light jazz.", "output": "Email the completed financial audit to cfo@smartfinance.com and include notes on discrepancies found\nplay some light jazz"}
{"input": "Send a follow-up email to neha.joshi@medtech.com thanking her for the interview opportunity and ask for the next steps, then check if it's sunny in Chennai.", "output": "Send a follow-up email to neha.joshi@medtech.com thanking her for the interview opportunity and ask for the next steps\ncheck if it's sunny in Chennai"}
{"input": "Email the marketing plan draft to prashant.sharma@brandbuzz.co with comments on budget allocations, then play some motivational background music.", "output": "Email the marketing plan draft to prashant.sharma@brandbuzz.co with comments on budget allocations\nplay some motivational background music"}
{"input": "Send a detailed request to client.support@softtek.com about feature integration timeline and attach the proposal document, then check weather forecast for Pune.", "output": "Send a detailed request to client.support@softtek.com about feature integration timeline and attach the proposal document\ncheck weather forecast for Pune"}
{"input": "Email the syllabus and study schedule to classmates.group@university.edu and attach the PDF, then play soft study music.", "output": "Email the syllabus and study schedule to classmates.group@university.edu and attach the PDF\nplay soft study music"}
{"input": "Send a complaint email to services@cloudstorage.com regarding data sync issues and attach screenshots, then check today’s news.", "output": "Send a complaint email to services@cloudstorage.com regarding data sync issues and attach screenshots\ncheck today’s news"}
{"input": "Email my graduation ceremony RSVP to registrar.office@university.edu and attach proof of payment, then play celebratory music.", "output": "Email my graduation ceremony RSVP to registrar.office@university.edu and attach proof of payment\nplay celebratory music"}
{"input": "Send a meeting request email to amit.singh@hrconsult.com with agenda and proposed timings, then check weather in New Delhi for tomorrow.", "output": "Send a meeting request email to amit.singh@hrconsult.com with agenda and proposed timings\ncheck weather in New Delhi for tomorrow"}
{"input": "Email the monthly newsletter draft to editor@newsflashdaily.com and attach photos for the header, then play upbeat news theme music.", "output": "Email the monthly newsletter draft to editor@newsflashdaily.com and attach photos for the header\nplay upbeat news theme music"}
{"input": "Send an apology email to teamlead@techsolutions.com about missing the project deadline and explain the delay, then play calming instrumental music.", "output": "Send an apology email to teamlead@techsolutions.com about missing the project deadline and explain the delay\nplay calming instrumental music"}
{"input": "Email the workshop presentation slides to instructor@skillhub.com and confirm my attendance, then check temperature in Kolkata.", "output": "Email the workshop presentation slides to instructor@skillhub.com and confirm my attendance\ncheck temperature in Kolkata"}
{"input": "Send a request email to support@internetprovider.com about slow connection speeds and attach speed test results, then play soft background music.", "output": "Send a request email to support@internetprovider.com about slow connection speeds and attach speed test results\nplay soft background music"}
{"input": "Email the final event report to coordinator@citymarathon.org and include participant feedback summaries, then check the weather in Hyderabad.", "output": "Email the final event report to coordinator@citymarathon.org and include participant feedback summaries\ncheck the weather in Hyderabad"}
{"input": "Send an email to finance@company.com requesting reimbursement details for travel expenses and attach receipts, then play smooth jazz music.", "output": "Send an email to finance@company.com requesting reimbursement details for travel expenses and attach receipts\nplay smooth jazz music"}
{"input": "Email the updated website design to uiux.team@creativespace.com with notes on responsive behavior, then check today's temperature in Mumbai.", "output": "Email the updated website design to uiux.team@creativespace.com with notes on responsive behavior\ncheck today's temperature in Mumbai"}
{"input": "Send a request email to library@university.edu for renewal of borrowed books and include book IDs, then play soft classical music.", "output": "Send a request email to library@university.edu for renewal of borrowed books and include book IDs\nplay soft classical music"}
{"input": "Email a sponsorship proposal to events@startupfest.com and attach the detailed plan, then check the weather forecast in Bangalore.", "output": "Email a sponsorship proposal to events@startupfest.com and attach the detailed plan\ncheck the weather forecast in Bangalore"}
{"input": "Send a bug report email to devteam@mobileapp.com about app crashes and attach error logs, then play chill electronic music.", "output": "Send a bug report email to devteam@mobileapp.com about app crashes and attach error logs\nplay chill electronic music"}
{"input": "Email the corrected invoice to accounts@vendorportal.com and confirm payment due date, then check rain chances in Chennai.", "output": "Email the corrected invoice to accounts@vendorportal.com and confirm payment due date\ncheck rain chances in Chennai"}
{"input": "Send a thank-you email to prof.agarwal@mathdept.edu for his guidance during the thesis and attach the final draft, then play relaxing piano music.", "output": "Send a thank-you email to prof.agarwal@mathdept.edu for his guidance during the thesis and attach the final draft\nplay relaxing piano music"}
{"input": "Email the job offer acceptance to hr@innovatech.com and attach signed contract, then check today's weather in Pune.", "output": "Email the job offer acceptance to hr@innovatech.com and attach signed contract\ncheck today's weather in Pune"}
{"input": "Send a request email to training@skillup.com for course extension and attach the payment receipt, then play motivational music.", "output": "Send a request email to training@skillup.com for course extension and attach the payment receipt\nplay motivational music"}
{"input": "Email the weekly sales report to manager@retailco.com and include graphs comparing last month, then check temperature in Ahmedabad.", "output": "Email the weekly sales report to manager@retailco.com and include graphs comparing last month\ncheck temperature in Ahmedabad"}
{"input": "Send an email to supplier@furnitech.com about delayed delivery and attach purchase order, then check if it will rain in Jaipur.", "output": "Send an email to supplier@furnitech.com about delayed delivery and attach purchase order\ncheck if it will rain in Jaipur"}
{"input": "Email a newsletter draft to marketing@foodiesclub.com with recipe updates and pictures, then play soft acoustic music.", "output": "Email a newsletter draft to marketing@foodiesclub.com with recipe updates and pictures\nplay soft acoustic music"}
{"input": "Send a query to customer.care@telecomservices.com regarding bill discrepancy and attach the previous bills, then check today’s news headlines.", "output": "Send a query to customer.care@telecomservices.com regarding bill discrepancy and attach the previous bills\ncheck today’s news headlines"}
{"input": "Email the final presentation slides to professor.singh@university.edu and ask for feedback by Friday, then play low-volume study music.", "output": "Email the final presentation slides to professor.singh@university.edu and ask for feedback by Friday\nplay low-volume study music"}
{"input": "Send an email to hr@alphatech.com scheduling my final interview and attach updated CV, then check weather in New Delhi tomorrow.", "output": "Send an email to hr@alphatech.com scheduling my final interview and attach updated CV\ncheck weather in New Delhi tomorrow"}
{"input": "Email the client onboarding documents to accounts@globalconsult.com and include contact info of the project manager, then play light jazz music.", "output": "Email the client onboarding documents to accounts@globalconsult.com and include contact info of the project manager\nplay light jazz music"}
{"input": "Send a complaint email to helpdesk@energysolutions.com about power outages and request update, then check if it will rain in Surat today.", "output": "Send a complaint email to helpdesk@energysolutions.com about power outages and request update\ncheck if it will rain in Surat today"}
{"input": "Email my thesis abstract and methodology section to dr.verma@researchinstitute.org and request review, then play peaceful ambient music.", "output": "Email my thesis abstract and methodology section to dr.verma@researchinstitute.org and request review\nplay peaceful ambient music"}
{"input": "Email the updated project proposal to manager.ravi@techsolutions.com and request feedback by Monday, then check weather in Ahmedabad for tomorrow.", "output": "Email the updated project proposal to manager.ravi@techsolutions.com and request feedback by Monday\ncheck weather in Ahmedabad for tomorrow"}
{"input": "Send an email to recruitment@finservices.com with my updated resume and ask about interview rounds, then play calm jazz music.", "output": "Send an email to recruitment@finservices.com with my updated resume and ask about interview rounds\nplay calm jazz music"}
{"input": "Email the billing department at billing@utilities.co.in about last month's electricity bill discrepancy and ask for correction, then check if it will rain in Jaipur today.", "output": "Email the billing department at billing@utilities.co.in about last month's electricity bill discrepancy and ask for correction\ncheck if it will rain in Jaipur today"}
{"input": "Mail the workshop schedule to training@corporateedu.com and confirm participant count, then check latest education news.", "output": "Mail the workshop schedule to training@corporateedu.com and confirm participant count\ncheck latest education news"}
{"input": "Send a thank you email to mentor.ashok@researchlab.org for his guidance, then play soft classical music.", "output": "Send a thank you email to mentor.ashok@researchlab.org for his guidance\nplay soft classical music"}
{"input": "Email the team leads at development@softwaresolutions.net about upcoming sprint deadlines, then check weather forecast for Mumbai this weekend.", "output": "Email the team leads at development@softwaresolutions.net about upcoming sprint deadlines\ncheck weather forecast for Mumbai this weekend"}
{"input": "Send an email to customerservice@bankinghelp.com regarding transaction failure and request resolution, then check financial news updates.", "output": "Send an email to customerservice@bankinghelp.com regarding transaction failure and request resolution\ncheck financial news updates"}
{"input": "Mail the sales report to sales.manager@retailcorp.com and ask for monthly targets, then play motivational workout playlist.", "output": "Mail the sales report to sales.manager@retailcorp.com and ask for monthly targets\nplay motivational workout playlist"}
{"input": "Send feedback email to appsupport@travelapp.com about recent bugs and request update timeline, then check travel advisories.", "output": "Send feedback email to appsupport@travelapp.com about recent bugs and request update timeline\ncheck travel advisories"}
{"input": "Email the meeting agenda to hr@startupincubator.com and confirm participants, then check startup ecosystem news.", "output": "Email the meeting agenda to hr@startupincubator.com and confirm participants\ncheck startup ecosystem news"}
{"input": "Send the annual budget proposal to finance@nonprofit.org and request board approval, then check global economy news.", "output": "Send the annual budget proposal to finance@nonprofit.org and request board approval\ncheck global economy news"}
{"input": "Mail the manuscript draft to editor@publishinghouse.com and ask for revision suggestions, then play relaxing instrumental music.", "output": "Mail the manuscript draft to editor@publishinghouse.com and ask for revision suggestions\nplay relaxing instrumental music"}
{"input": "Email the RSVP confirmation to events@charityball.org, then check local charity event news.", "output": "Email the RSVP confirmation to events@charityball.org\ncheck local charity event news"}
{"input": "Send complaint email to support@shoppingapp.com about wrong order delivery and request replacement, then check ecommerce news.", "output": "Send complaint email to support@shoppingapp.com about wrong order delivery and request replacement\ncheck ecommerce news"}
{"input": "Mail updated CV to jobs@creativeagency.com and inquire about job openings, then play indie pop playlist.", "output": "Mail updated CV to jobs@creativeagency.com and inquire about job openings\nplay indie pop playlist"}
{"input": "Send a thank you note to professor.singh@university.edu for recommendation letter, then check university news updates.", "output": "Send a thank you note to professor.singh@university.edu for recommendation letter\ncheck university news updates"}
{"input": "Email the client at client.relations@bizgroup.com with project status update and next steps, then check business news headlines.", "output": "Email the client at client.relations@bizgroup.com with project status update and next steps\ncheck business news headlines"}
{"input": "Send an email to logistics@freightco.com to confirm shipment delivery date, then check weather forecast in Kolkata tomorrow.", "output": "Send an email to logistics@freightco.com to confirm shipment delivery date\ncheck weather forecast in Kolkata tomorrow"}
{"input": "Mail the newsletter content to marketing@mediahouse.com and ask for feedback, then play upbeat pop music.", "output": "Mail the newsletter content to marketing@mediahouse.com and ask for feedback\nplay upbeat pop music"}
{"input": "Email the support team at helpdesk@softwaretools.com about login issues, then check latest tech updates.", "output": "Email the support team at helpdesk@softwaretools.com about login issues\ncheck latest tech updates"}
{"input": "Send application follow-up to admissions@businessschool.edu, then check MBA program news.", "output": "Send application follow-up to admissions@businessschool.edu\ncheck MBA program news"}
{"input": "Mail invoice to client.billing@consultingfirm.com and request payment confirmation, then play smooth jazz playlist.", "output": "Mail invoice to client.billing@consultingfirm.com and request payment confirmation\nplay smooth jazz playlist"}
{"input": "Send feedback to feedback@fooddeliveryapp.com about delivery time, then check local restaurant news.", "output": "Send feedback to feedback@fooddeliveryapp.com about delivery time\ncheck local restaurant news"}
{"input": "Email the volunteer schedule to coordinator@communityservice.org and confirm volunteer shifts, then check social work news.", "output": "Email the volunteer schedule to coordinator@communityservice.org and confirm volunteer shifts\ncheck social work news"}
{"input": "Send an inquiry email to support@techgadgets.com about product warranty, then play electronic music playlist.", "output": "Send an inquiry email to support@techgadgets.com about product warranty\nplay electronic music playlist"}
{"input": "Mail the project deliverables to client.contact@creativeagency.com and ask for feedback, then check marketing news updates.", "output": "Mail the project deliverables to client.contact@creativeagency.com and ask for feedback\ncheck marketing news updates"}
{"input": "Email the event invitation to guests@conference2025.com and ask for RSVPs, then check conference news.", "output": "Email the event invitation to guests@conference2025.com and ask for RSVPs\ncheck conference news"}
{"input": "Send reminder email to team@designstudio.com about final draft deadline, then play calm background music.", "output": "Send reminder email to team@designstudio.com about final draft deadline\nplay calm background music"}
{"input": "Mail the project budget summary to finance@startuphub.com and request approval, then check startup funding news.", "output": "Mail the project budget summary to finance@startuphub.com and request approval\ncheck startup funding news"}
{"input": "Email the customer at customer.care@retailstore.com about product return process, then check retail news updates.", "output": "Email the customer at customer.care@retailstore.com about product return process\ncheck retail news updates"}
{"input": "Send feedback to feedback@learningplatform.com about course content, then play study focus music.", "output": "Send feedback to feedback@learningplatform.com about course content\nplay study focus music"}
{"input": "Email the scholarship application to grants@educationfoundation.org and ask about interview schedule, then check education funding news.", "output": "Email the scholarship application to grants@educationfoundation.org and ask about interview schedule\ncheck education funding news"}
{"input": "Send inquiry email to travel@holidayplanner.com about group tour packages, then check travel deals.", "output": "Send inquiry email to travel@holidayplanner.com about group tour packages\ncheck travel deals"}
{"input": "Mail report to qualitycontrol@manufacturing.com and ask for inspection dates, then check manufacturing industry news.", "output": "Mail report to qualitycontrol@manufacturing.com and ask for inspection dates\ncheck manufacturing industry news"}
{"input": "Send an email to hr@hospitalitygroup.com with job application and request interview dates, then play relaxing spa music.", "output": "Send an email to hr@hospitalitygroup.com with job application and request interview dates\nplay relaxing spa music"}
{"input": "Email the invoice to accounts@lawfirm.com and confirm receipt, then check legal news updates.", "output": "Email the invoice to accounts@lawfirm.com and confirm receipt\ncheck legal news updates"}
{"input": "Send follow-up email to vendor@supplychain.com about shipment delays, then check logistics news.", "output": "Send follow-up email to vendor@supplychain.com about shipment delays\ncheck logistics news"}
{"input": "Mail the training feedback form to trainingdept@corporate.com and request summary report, then play soft acoustic music.", "output": "Mail the training feedback form to trainingdept@corporate.com and request summary report\nplay soft acoustic music"}
{"input": "Send notification email to members@bookclub.com about upcoming meeting, then check literary news.", "output": "Send notification email to members@bookclub.com about upcoming meeting\ncheck literary news"}
{"input": "Email the contract draft to legal@fintechstartup.com and ask for review comments, then play ambient focus music.", "output": "Email the contract draft to legal@fintechstartup.com and ask for review comments\nplay ambient focus music"}
{"input": "Send a thank you email to sponsor@communityevent.org, then check local event news.", "output": "Send a thank you email to sponsor@communityevent.org\ncheck local event news"}
{"input": "Mail request to support@smartdevice.com for software update instructions, then play electronic chill music.", "output": "Mail request to support@smartdevice.com for software update instructions\nplay electronic chill music"}
{"input": "Send inquiry to hr@educationboard.in about teacher recruitment process, then check education sector news.", "output": "Send inquiry to hr@educationboard.in about teacher recruitment process\ncheck education sector news"}
{"input": "Email the proposal summary to partners@greenenergy.com and request meeting availability, then check environment news.", "output": "Email the proposal summary to partners@greenenergy.com and request meeting availability\ncheck environment news"}
{"input": "Email a summary of the client discussion to kavita.r@projectedge.com and attach the call recording, then check weather conditions in Ahmedabad.", "output": "Email a summary of the client discussion to kavita.r@projectedge.com and attach the call recording\ncheck weather conditions in Ahmedabad"}
{"input": "Play 'Perfect' by Ed Sheeran and send a thank-you message to priya@weddingbliss.org for the wonderful coordination.", "output": "Play 'Perfect' by Ed Sheeran\nsend a thank-you message to priya@weddingbliss.org for the wonderful coordination"}
{"input": "Check today’s weather forecast in Indore and email the picnic checklist to amit.pandey@familymail.com.", "output": "Check today’s weather forecast in Indore\nemail the picnic checklist to amit.pandey@familymail.com"}
{"input": "Send an email to recruiter.hr@techdrive.com confirming the interview time and attach my updated resume, then play instrumental jazz.", "output": "Send an email to recruiter.hr@techdrive.com confirming the interview time and attach my updated resume\nplay instrumental jazz"}
{"input": "Email a complaint to admin@speednet.in about inconsistent broadband service, include screenshots, and check if it’s going to rain today.", "output": "Email a complaint to admin@speednet.in about inconsistent broadband service, include screenshots\ncheck if it’s going to rain today"}
{"input": "Schedule a reminder for project deadline on June 15th at 10 AM and email all documents to my supervisor at rajesh@collabworks.io.", "output": "Schedule a reminder for project deadline on June 15th at 10 AM\nemail all documents to my supervisor at rajesh@collabworks.io"}
{"input": "Play peaceful background music and send a message to aditya.seth@relaxhub.com about the meditation course.", "output": "Play peaceful background music\nsend a message to aditya.seth@relaxhub.com about the meditation course"}
{"input": "Check if the weather in Panchgani is suitable for hiking and email the plan to outdoor.group@exploremore.org.", "output": "Check if the weather in Panchgani is suitable for hiking\nemail the plan to outdoor.group@exploremore.org"}
{"input": "Email a correction request to records@univregistry.edu for the semester transcript, then play some soft music.", "output": "Email a correction request to records@univregistry.edu for the semester transcript\nplay some soft music"}
{"input": "Send an email to info@thepetstation.com regarding the vaccination schedule for Bruno and check the forecast in Noida.", "output": "Send an email to info@thepetstation.com regarding the vaccination schedule for Bruno\ncheck the forecast in Noida"}
{"input": "Set a reminder for the dentist appointment on Thursday at 11 AM and send the confirmation email to dr.anita@smiledental.com.", "output": "Set a reminder for the dentist appointment on Thursday at 11 AM\nsend the confirmation email to dr.anita@smiledental.com"}
{"input": "Play 'Clocks' by Coldplay and send the assignment submission email to assignments@elearnportal.com.", "output": "Play 'Clocks' by Coldplay\nsend the assignment submission email to assignments@elearnportal.com"}
{"input": "Email an invitation to neeraj.kapoor@eventguide.net for Saturday's art exhibition, then check if it’s cloudy in Chandigarh.", "output": "Email an invitation to neeraj.kapoor@eventguide.net for Saturday's art exhibition\ncheck if it’s cloudy in Chandigarh"}
{"input": "Send a confirmation to travel.support@flymore.in for my booking details and check weather conditions in Kolkata.", "output": "Send a confirmation to travel.support@flymore.in for my booking details\ncheck weather conditions in Kolkata"}
{"input": "Play 'Lose Yourself' by Eminem and email my application form to admissions@filmstudies.institute.", "output": "Play 'Lose Yourself' by Eminem\nemail my application form to admissions@filmstudies.institute"}
{"input": "Check the news headlines today and forward them to rahul.kumar@newsdigest.net with a quick comment.", "output": "Check the news headlines today\nforward them to rahul.kumar@newsdigest.net with a quick comment"}
{"input": "Send an apology email to harshita.singh@remoteworkplace.io for missing the daily standup, then play something upbeat.", "output": "Send an apology email to harshita.singh@remoteworkplace.io for missing the daily standup\nplay something upbeat"}
{"input": "Schedule a reminder to water the plants at 7 AM and email mom@greenhouse.in with updates on the balcony garden.", "output": "Schedule a reminder to water the plants at 7 AM\nemail mom@greenhouse.in with updates on the balcony garden"}
{"input": "Email the revised proposal to tanmay.r@interiorideas.com with floor plans attached, then check temperature in Nagpur.", "output": "Email the revised proposal to tanmay.r@interiorideas.com with floor plans attached\ncheck temperature in Nagpur"}
{"input": "Play soft indie music and email my internship experience summary to my professor at varun.kulkarni@campus.edu.", "output": "Play soft indie music\nemail my internship experience summary to my professor at varun.kulkarni@campus.edu"}
{"input": "Send a detailed progress email to amit@productvision.in and include screenshots from the app build, then check the weather in Bhopal.", "output": "Send a detailed progress email to amit@productvision.in and include screenshots from the app build\ncheck the weather in Bhopal"}
{"input": "Check today’s news and send a curated digest to my mailing list at techbriefs@newsletterhub.com.", "output": "Check today’s news\nsend a curated digest to my mailing list at techbriefs@newsletterhub.com"}
{"input": "Email a quick thank-you to neeti.das@volunteerforchange.org for organizing the event, then play a mellow instrumental track.", "output": "Email a quick thank-you to neeti.das@volunteerforchange.org for organizing the event\nplay a mellow instrumental track"}
{"input": "Play evening flute music and send out the meeting summary to our team list at team.sync@workflowpro.com.", "output": "Play evening flute music\nsend out the meeting summary to our team list at team.sync@workflowpro.com"}
{"input": "Set a schedule for daily writing from 9 to 10 AM and email the plan to my editor at articles@writelab.io.", "output": "Set a schedule for daily writing from 9 to 10 AM\nemail the plan to my editor at articles@writelab.io"}
{"input": "Check weather predictions in Raipur and send an email to arrange local transport via contact@citytravel.in.", "output": "Check weather predictions in Raipur\nsend an email to arrange local transport via contact@citytravel.in"}
{"input": "Email the scanned receipt to claims@healthsecure.com for reimbursement, then play relaxing ocean sounds.", "output": "Email the scanned receipt to claims@healthsecure.com for reimbursement\nplay relaxing ocean sounds"}
{"input": "Play the latest Bollywood romantic songs and send a holiday greetings email to office@technolink.com.", "output": "Play the latest Bollywood romantic songs\nsend a holiday greetings email to office@technolink.com"}
{"input": "Send the updated story draft to aarti.r@writingco.in and schedule a reminder for tomorrow’s review at 4 PM.", "output": "Send the updated story draft to aarti.r@writingco.in\nschedule a reminder for tomorrow’s review at 4 PM"}
{"input": "Email a product demo video to samarth.sales@geargrid.com and include the latest feature list, then check weather in Thiruvananthapuram.", "output": "Email a product demo video to samarth.sales@geargrid.com and include the latest feature list\ncheck weather in Thiruvananthapuram"}
{"input": "Play 'Don't Stop Believin'' by Journey and send a follow-up email to karishma.taneja@careermoves.net about the job role.", "output": "Play 'Don't Stop Believin'' by Journey\nsend a follow-up email to karishma.taneja@careermoves.net about the job role"}
{"input": "Email a note to my yoga teacher at poonam.arya@yogaflow.com sharing my weekly experience, then check if it's raining in Coonoor.", "output": "Email a note to my yoga teacher at poonam.arya@yogaflow.com sharing my weekly experience\ncheck if it's raining in Coonoor"}
{"input": "Check weather in Srinagar for the coming week and send itinerary suggestions to travel.buddies@plantrip.net.", "output": "Check weather in Srinagar for the coming week\nsend itinerary suggestions to travel.buddies@plantrip.net"}
{"input": "Play rain ambience and email the minutes of today’s finance review to accounts.board@finops.org.", "output": "Play rain ambience\nemail the minutes of today’s finance review to accounts.board@finops.org"}
{"input": "Email the upcoming event schedule to our volunteers at support.team@kindnesscircle.org, then check the local news.", "output": "Email the upcoming event schedule to our volunteers at support.team@kindnesscircle.org\ncheck the local news"}
{"input": "Set a reminder to take medicines daily at 8 PM and send the prescription copy to my doctor at health.first@clinicmail.com.", "output": "Set a reminder to take medicines daily at 8 PM\nsend the prescription copy to my doctor at health.first@clinicmail.com"}
{"input": "Send an email to nilesh.jain@blogcircle.org confirming my blog submission for this week, then play creative focus music.", "output": "Send an email to nilesh.jain@blogcircle.org confirming my blog submission for this week\nplay creative focus music"}
{"input": "Check the forecast in Darjeeling for tomorrow and email the details to local.tour@hillsideholidays.com.", "output": "Check the forecast in Darjeeling for tomorrow\nemail the details to local.tour@hillsideholidays.com"}
{"input": "Play some lo-fi chillhop and send a notification email to dev@teamflow.dev about the server restart tonight.", "output": "Play some lo-fi chillhop\nsend a notification email to dev@teamflow.dev about the server restart tonight"}
{"input": "Email a summary of this week’s tasks to my manager at neelam.sharma@taskline.co, then check if it's foggy in Ranchi.", "output": "Email a summary of this week’s tasks to my manager at neelam.sharma@taskline.co\ncheck if it's foggy in Ranchi"}
{"input": "Send an apology note to vipin@clienthub.com for the miscommunication and attach the updated report, then play a calm playlist.", "output": "Send an apology note to vipin@clienthub.com for the miscommunication and attach the updated report\nplay a calm playlist"}
{"input": "Schedule a reminder for book club discussion at 6 PM Sunday and email the list of titles to everyone at readers@groupmail.org.", "output": "Schedule a reminder for book club discussion at 6 PM Sunday\nemail the list of titles to everyone at readers@groupmail.org"}
{"input": "Check today’s political news and email an opinion summary to my team at research@factdaily.com.", "output": "Check today’s political news\nemail an opinion summary to my team at research@factdaily.com"}
{"input": "Play 'Firework' by Katy Perry and send a motivational email to interns@campusnext.in.", "output": "Play 'Firework' by Katy Perry\nsend a motivational email to interns@campusnext.in"}
{"input": "Send the weekly project updates to updates@progresstrack.org and check today’s forecast in Vishakhapatnam.", "output": "Send the weekly project updates to updates@progresstrack.org\ncheck today’s forecast in Vishakhapatnam"}
{"input": "Send an email to hr@techinnovators.com with my updated CV and ask about the software engineer vacancy, then check weather forecast in Bangalore for tomorrow.", "output": "Send an email to hr@techinnovators.com with my updated CV and ask about the software engineer vacancy\ncheck weather forecast in Bangalore for tomorrow"}
{"input": "Email the marketing team at marketing@fashionbrand.com to share the new campaign strategy and request feedback, then play upbeat pop music.", "output": "Email the marketing team at marketing@fashionbrand.com to share the new campaign strategy and request feedback\nplay upbeat pop music"}
{"input": "Send a complaint email to support@ecommerceplatform.com regarding delayed delivery and ask for compensation, then check ecommerce news.", "output": "Send a complaint email to support@ecommerceplatform.com regarding delayed delivery and ask for compensation\ncheck ecommerce news"}
{"input": "Mail the project timeline update to project.manager@constructionco.com and confirm next milestone, then check weather forecast in Chennai this weekend.", "output": "Mail the project timeline update to project.manager@constructionco.com and confirm next milestone\ncheck weather forecast in Chennai this weekend"}
{"input": "Email the customer support at helpdesk@telecomprovider.com about network issues in my area, then play calming instrumental music.", "output": "Email the customer support at helpdesk@telecomprovider.com about network issues in my area\nplay calming instrumental music"}
{"input": "Send feedback to feedback@onlinecourseplatform.com about the new UI, then check education technology news.", "output": "Send feedback to feedback@onlinecourseplatform.com about the new UI\ncheck education technology news"}
{"input": "Email the finance department at finance@hospital.org to request the expense reimbursement form, then check healthcare news updates.", "output": "Email the finance department at finance@hospital.org to request the expense reimbursement form\ncheck healthcare news updates"}
{"input": "Mail the quarterly report to ceo@startupventures.com and ask for comments, then play electronic chill music.", "output": "Mail the quarterly report to ceo@startupventures.com and ask for comments\nplay electronic chill music"}
{"input": "Send invitation email to attendees@webinar2025.com and request confirmations, then check technology news headlines.", "output": "Send invitation email to attendees@webinar2025.com and request confirmations\ncheck technology news headlines"}
{"input": "Email the HR team at hr@corporatefinance.com to schedule an exit interview, then check business news updates.", "output": "Email the HR team at hr@corporatefinance.com to schedule an exit interview\ncheck business news updates"}
{"input": "Send an email to admin@citycouncil.gov to request information about public services, then check local government news.", "output": "Send an email to admin@citycouncil.gov to request information about public services\ncheck local government news"}
{"input": "Mail the software bug report to devteam@softwarehouse.com and ask for fix timeline, then play focus music.", "output": "Mail the software bug report to devteam@softwarehouse.com and ask for fix timeline\nplay focus music"}
{"input": "Email the reservations team at reservations@luxuryhotels.com to confirm booking details, then check travel news updates.", "output": "Email the reservations team at reservations@luxuryhotels.com to confirm booking details\ncheck travel news updates"}
{"input": "Send a thank you email to professor.kim@university.edu for the research guidance, then check academic news.", "output": "Send a thank you email to professor.kim@university.edu for the research guidance\ncheck academic news"}
{"input": "Email the event organizers at events@musicfestival.com about vendor registration, then play festival playlist.", "output": "Email the event organizers at events@musicfestival.com about vendor registration\nplay festival playlist"}
{"input": "Send inquiry email to sales@automotivedealers.com about latest car models, then check automotive news.", "output": "Send inquiry email to sales@automotivedealers.com about latest car models\ncheck automotive news"}
{"input": "Mail the invoice to accounting@logisticsfirm.com and request payment status, then check logistics industry updates.", "output": "Mail the invoice to accounting@logisticsfirm.com and request payment status\ncheck logistics industry updates"}
{"input": "Send complaint email to support@onlinebanking.com regarding unauthorized transaction, then check financial news.", "output": "Send complaint email to support@onlinebanking.com regarding unauthorized transaction\ncheck financial news"}
{"input": "Email the training coordinator at training@corporatetraining.com to confirm session dates, then play motivational music.", "output": "Email the training coordinator at training@corporatetraining.com to confirm session dates\nplay motivational music"}
{"input": "Send an email to publisher@bookhouse.com with manuscript submission, then check publishing news.", "output": "Send an email to publisher@bookhouse.com with manuscript submission\ncheck publishing news"}
{"input": "Mail request to customer.care@retailchain.com for product warranty details, then play light jazz music.", "output": "Mail request to customer.care@retailchain.com for product warranty details\nplay light jazz music"}
{"input": "Send feedback to app.support@fitnessapp.com about workout tracking, then check health tech news.", "output": "Send feedback to app.support@fitnessapp.com about workout tracking\ncheck health tech news"}
{"input": "Email the scholarship office at scholarships@educationfund.org to inquire about application deadlines, then check education news.", "output": "Email the scholarship office at scholarships@educationfund.org to inquire about application deadlines\ncheck education news"}
{"input": "Send an email to hr@hospitalitygroup.com with my job application and ask about interview rounds, then play lounge music.", "output": "Send an email to hr@hospitalitygroup.com with my job application and ask about interview rounds\nplay lounge music"}
{"input": "Mail the delivery confirmation to logistics@courierservice.com and request tracking updates, then check courier news.", "output": "Mail the delivery confirmation to logistics@courierservice.com and request tracking updates\ncheck courier news"}
{"input": "Send an inquiry email to support@smartphones.com about software update, then play chill electronic music.", "output": "Send an inquiry email to support@smartphones.com about software update\nplay chill electronic music"}
{"input": "Email the client at client.services@adagency.com with campaign report, then check advertising news.", "output": "Email the client at client.services@adagency.com with campaign report\ncheck advertising news"}
{"input": "Send notification email to members@photographyclub.com about upcoming meet, then check photography news.", "output": "Send notification email to members@photographyclub.com about upcoming meet\ncheck photography news"}
{"input": "Mail the project proposal to ceo@greenenergy.com and request funding update, then check environment news.", "output": "Mail the project proposal to ceo@greenenergy.com and request funding update\ncheck environment news"}
{"input": "Send follow-up email to vendor@supplychain.com about order status, then check supply chain news.", "output": "Send follow-up email to vendor@supplychain.com about order status\ncheck supply chain news"}
{"input": "Email the event coordinator at events@cityfest.com to confirm volunteer slots, then play upbeat festival music.", "output": "Email the event coordinator at events@cityfest.com to confirm volunteer slots\nplay upbeat festival music"}
{"input": "Send complaint email to support@onlinegaming.com about account issues, then check gaming news.", "output": "Send complaint email to support@onlinegaming.com about account issues\ncheck gaming news"}
{"input": "Mail the invoice to accounts@lawfirm.com and ask for payment update, then check legal industry news.", "output": "Mail the invoice to accounts@lawfirm.com and ask for payment update\ncheck legal industry news"}
{"input": "Send inquiry to hr@educationboard.gov about teacher recruitment, then check education sector news.", "output": "Send inquiry to hr@educationboard.gov about teacher recruitment\ncheck education sector news"}
{"input": "Email the support team at helpdesk@softwaresolutions.com about bug fixes, then play calm instrumental music.", "output": "Email the support team at helpdesk@softwaresolutions.com about bug fixes\nplay calm instrumental music"}
{"input": "Send thank you email to sponsor@communityevent.org for their support, then check community news.", "output": "Send thank you email to sponsor@communityevent.org for their support\ncheck community news"}
{"input": "Mail request to support@smartdevice.com for troubleshooting guide, then play electronic ambient music.", "output": "Mail request to support@smartdevice.com for troubleshooting guide\nplay electronic ambient music"}
{"input": "Send feedback to feedback@onlinelearning.com about course quality, then check education news updates.", "output": "Send feedback to feedback@onlinelearning.com about course quality\ncheck education news updates"}
{"input": "Email the scholarship committee at scholarships@university.edu about application status, then check academic news.", "output": "Email the scholarship committee at scholarships@university.edu about application status\ncheck academic news"}
{"input": "Send invitation email to partners@businesssummit.com for next conference, then check business news.", "output": "Send invitation email to partners@businesssummit.com for next conference\ncheck business news"}
{"input": "Mail the product feedback to support@techgadgets.com and request replacement details, then play tech news podcast.", "output": "Mail the product feedback to support@techgadgets.com and request replacement details\nplay tech news podcast"}
{"input": "Send inquiry to hr@nonprofit.org about volunteer programs, then check nonprofit news.", "output": "Send inquiry to hr@nonprofit.org about volunteer programs\ncheck nonprofit news"}
{"input": "Email the client.contact@mediaagency.com with campaign analytics report, then check media news.", "output": "Email the client.contact@mediaagency.com with campaign analytics report\ncheck media news"}
{"input": "Send reminder email to team@creativeagency.com about project deadline, then play focus music playlist.", "output": "Send reminder email to team@creativeagency.com about project deadline\nplay focus music playlist"}
{"input": "Mail the donation receipt to donor@charity.org and thank them for their generosity, then check charity event news.", "output": "Mail the donation receipt to donor@charity.org and thank them for their generosity\ncheck charity event news"}
{"input": "Send notification email to members@fitnessclub.com about schedule changes, then play workout playlist.", "output": "Send notification email to members@fitnessclub.com about schedule changes\nplay workout playlist"}
{"input": "Email the training feedback to hr@corporate.com and request report summary, then check HR news.", "output": "Email the training feedback to hr@corporate.com and request report summary\ncheck HR news"}
{"input": "Send an email to manager.suresh@techworld.com summarizing the latest sprint progress and include blockers reported by the team, then check weather forecast for Bangalore.", "output": "Send an email to manager.suresh@techworld.com summarizing the latest sprint progress and include blockers reported by the team\ncheck weather forecast for Bangalore"}
{"input": "Email hr.recruitment@innoventures.com expressing my interest in the data scientist role and attach my portfolio and CV, then play some chill lo-fi music.", "output": "Email hr.recruitment@innoventures.com expressing my interest in the data scientist role and attach my portfolio and CV\nplay some chill lo-fi music"}
{"input": "Send a detailed complaint email to support@webhostingpro.com about frequent downtime and attach server logs from last week, then check today's temperature in Pune.", "output": "Send a detailed complaint email to support@webhostingpro.com about frequent downtime and attach server logs from last week\ncheck today's temperature in Pune"}
{"input": "Email the updated project timeline to client.relations@designfirm.co with explanations for the delays, then play relaxing classical music.", "output": "Email the updated project timeline to client.relations@designfirm.co with explanations for the delays\nplay relaxing classical music"}
{"input": "Send an invitation email to prashant.jain@conference.org for the upcoming tech summit with agenda attached, then check if it will rain tomorrow in Mumbai.", "output": "Send an invitation email to prashant.jain@conference.org for the upcoming tech summit with agenda attached\ncheck if it will rain tomorrow in Mumbai"}
{"input": "Email the internship feedback report with detailed comments to mentor.singh@internships.com and thank him for the support, then play soft acoustic music.", "output": "Email the internship feedback report with detailed comments to mentor.singh@internships.com and thank him for the support\nplay soft acoustic music"}
{"input": "Send an application email to careers@nextgeninnovations.com for the front-end developer position and attach my resume and cover letter, then check weather forecast for Hyderabad.", "output": "Send an application email to careers@nextgeninnovations.com for the front-end developer position and attach my resume and cover letter\ncheck weather forecast for Hyderabad"}
{"input": "Email customer.support@smartgadgets.com reporting an issue with my new device and attach photos, then play some upbeat pop music.", "output": "Email customer.support@smartgadgets.com reporting an issue with my new device and attach photos\nplay some upbeat pop music"}
{"input": "Send a request email to it.support@globaltech.com for software installation approval and mention project urgency, then check current temperature in Chennai.", "output": "Send a request email to it.support@globaltech.com for software installation approval and mention project urgency\ncheck current temperature in Chennai"}
{"input": "Email the final audit report to finance.head@corporate.com and highlight key financial discrepancies found, then play some smooth jazz.", "output": "Email the final audit report to finance.head@corporate.com and highlight key financial discrepancies found\nplay some smooth jazz"}
{"input": "Send a follow-up email to recruiter.raj@talentbridge.com thanking for the interview and asking about the selection timeline, then check if it’s sunny in Kolkata today.", "output": "Send a follow-up email to recruiter.raj@talentbridge.com thanking for the interview and asking about the selection timeline\ncheck if it’s sunny in Kolkata today"}
{"input": "Email the draft marketing strategy to strategy.team@marketwise.com and include budget suggestions, then play motivational instrumental music.", "output": "Email the draft marketing strategy to strategy.team@marketwise.com and include budget suggestions\nplay motivational instrumental music"}
{"input": "Send a detailed feature request email to devs@mobileapp.com with screenshots and attach user feedback, then check weather forecast for Jaipur.", "output": "Send a detailed feature request email to devs@mobileapp.com with screenshots and attach user feedback\ncheck weather forecast for Jaipur"}
{"input": "Email study group members at studygroup@uni.edu with meeting notes and attach slides, then play soft concentration music.", "output": "Email study group members at studygroup@uni.edu with meeting notes and attach slides\nplay soft concentration music"}
{"input": "Send a complaint email to complaints@ecommerce.com about delayed order delivery and attach photos of damaged packaging, then check today’s news headlines.", "output": "Send a complaint email to complaints@ecommerce.com about delayed order delivery and attach photos of damaged packaging\ncheck today’s news headlines"}
{"input": "Email my RSVP confirmation to events@university.edu for the annual alumni meet and attach payment receipt, then play celebratory music.", "output": "Email my RSVP confirmation to events@university.edu for the annual alumni meet and attach payment receipt\nplay celebratory music"}
{"input": "Send a meeting request to manager.kiran@consulting.com with proposed agenda and timings, then check weather in New Delhi tomorrow.", "output": "Send a meeting request to manager.kiran@consulting.com with proposed agenda and timings\ncheck weather in New Delhi tomorrow"}
{"input": "Email the monthly newsletter draft to editor@citynews.com and attach photos for the front page, then play upbeat news theme music.", "output": "Email the monthly newsletter draft to editor@citynews.com and attach photos for the front page\nplay upbeat news theme music"}
{"input": "Send an apology email to project.lead@techcorp.com about missing the deadline and explain reasons, then play calming instrumental music.", "output": "Send an apology email to project.lead@techcorp.com about missing the deadline and explain reasons\nplay calming instrumental music"}
{"input": "Email the workshop slides to instructor@learninghub.com and confirm attendance, then check temperature in Mumbai.", "output": "Email the workshop slides to instructor@learninghub.com and confirm attendance\ncheck temperature in Mumbai"}
{"input": "Send a support request email to support@internetprovider.com about slow internet speeds and attach speed test results, then play soft background music.", "output": "Send a support request email to support@internetprovider.com about slow internet speeds and attach speed test results\nplay soft background music"}
{"input": "Email the final event report to coordinator@marathon.org with participant feedback summaries, then check the weather in Hyderabad.", "output": "Email the final event report to coordinator@marathon.org with participant feedback summaries\ncheck the weather in Hyderabad"}
{"input": "Send an email to accounts@financecorp.com requesting reimbursement for travel expenses and attach receipts, then play smooth jazz music.", "output": "Send an email to accounts@financecorp.com requesting reimbursement for travel expenses and attach receipts\nplay smooth jazz music"}
{"input": "Email the updated website design files to design.team@creatives.com and include notes on responsiveness, then check today’s temperature in Pune.", "output": "Email the updated website design files to design.team@creatives.com and include notes on responsiveness\ncheck today’s temperature in Pune"}
{"input": "Send a book renewal request to library@university.edu with book IDs and due dates, then play soft classical music.", "output": "Send a book renewal request to library@university.edu with book IDs and due dates\nplay soft classical music"}
{"input": "Email a sponsorship proposal to sponsors@startupfest.com and attach detailed plans, then check weather forecast in Bangalore.", "output": "Email a sponsorship proposal to sponsors@startupfest.com and attach detailed plans\ncheck weather forecast in Bangalore"}
{"input": "Send a bug report email to bugs@mobileapp.com describing crashes and attach error logs, then play chill electronic music.", "output": "Send a bug report email to bugs@mobileapp.com describing crashes and attach error logs\nplay chill electronic music"}
{"input": "Email the corrected invoice to billing@vendorportal.com confirming payment due dates, then check rain chances in Chennai.", "output": "Email the corrected invoice to billing@vendorportal.com confirming payment due dates\ncheck rain chances in Chennai"}
{"input": "Send a thank-you email to prof.khan@university.edu for thesis guidance and attach the final draft, then play relaxing piano music.", "output": "Send a thank-you email to prof.khan@university.edu for thesis guidance and attach the final draft\nplay relaxing piano music"}
{"input": "Email job offer acceptance to hr@techcorp.com and attach signed contract, then check today's weather in Pune.", "output": "Email job offer acceptance to hr@techcorp.com and attach signed contract\ncheck today's weather in Pune"}
{"input": "Send a course extension request to training@skillsacademy.com and attach payment proof, then play motivational music.", "output": "Send a course extension request to training@skillsacademy.com and attach payment proof\nplay motivational music"}
{"input": "Email weekly sales report to sales.manager@retailco.com including graphs comparing last month, then check temperature in Ahmedabad.", "output": "Email weekly sales report to sales.manager@retailco.com including graphs comparing last month\ncheck temperature in Ahmedabad"}
{"input": "Send an email to supplier@furnitureco.com about delayed shipments and attach purchase orders, then check if it will rain in Jaipur.", "output": "Send an email to supplier@furnitureco.com about delayed shipments and attach purchase orders\ncheck if it will rain in Jaipur"}
{"input": "Email newsletter draft to marketing@foodiesclub.com with recipe updates and images, then play soft acoustic music.", "output": "Email newsletter draft to marketing@foodiesclub.com with recipe updates and images\nplay soft acoustic music"}
{"input": "Send a billing query to customer.care@telecom.com about discrepancies and attach previous bills, then check today’s news headlines.", "output": "Send a billing query to customer.care@telecom.com about discrepancies and attach previous bills\ncheck today’s news headlines"}
{"input": "Email final presentation slides to prof.rao@university.edu and request feedback by Friday, then play low-volume study music.", "output": "Email final presentation slides to prof.rao@university.edu and request feedback by Friday\nplay low-volume study music"}
{"input": "Send an interview scheduling email to hr@alphatech.com with updated CV, then check weather in New Delhi tomorrow.", "output": "Send an interview scheduling email to hr@alphatech.com with updated CV\ncheck weather in New Delhi tomorrow"}
{"input": "Email client onboarding documents to accounts@globalconsult.com including project manager contact, then play light jazz music.", "output": "Email client onboarding documents to accounts@globalconsult.com including project manager contact\nplay light jazz music"}
{"input": "Send a power outage complaint to helpdesk@energysolutions.com requesting updates, then check if it will rain in Surat today.", "output": "Send a power outage complaint to helpdesk@energysolutions.com requesting updates\ncheck if it will rain in Surat today"}
{"input": "Email thesis abstract and methodology to dr.verma@researchinstitute.org requesting review, then play peaceful ambient music.", "output": "Email thesis abstract and methodology to dr.verma@researchinstitute.org requesting review\nplay peaceful ambient music"}
{"input": "Send a mail to recruitment@jobzone.com confirming my interview at 10 AM tomorrow and then check the weather in Bengaluru.", "output": "Send a mail to recruitment@jobzone.com confirming my interview at 10 AM tomorrow\ncheck the weather in Bengaluru"}
{"input": "Play 'Levitating' by Dua Lipa and then email the link to my friend at rishi.musicfan@mail.com.", "output": "Play 'Levitating' by Dua Lipa\nemail the link to my friend at rishi.musicfan@mail.com"}
{"input": "Set a schedule for a dentist appointment on Friday at 11 AM and notify the clinic at smilecare@dental.org.", "output": "Set a schedule for a dentist appointment on Friday at 11 AM\nnotify the clinic at smilecare@dental.org"}
{"input": "Check the news related to global markets and send a summary to my boss at a.verma@financeplus.com.", "output": "Check the news related to global markets\nsend a summary to my boss at a.verma@financeplus.com"}
{"input": "Play some classic rock music and email my travel itinerary to travelbuddy@plans.com.", "output": "Play some classic rock music\nemail my travel itinerary to travelbuddy@plans.com"}
{"input": "Send meeting minutes to team@collabmail.com and check the forecast in Hyderabad for this weekend.", "output": "Send meeting minutes to team@collabmail.com\ncheck the forecast in Hyderabad for this weekend"}
{"input": "Email my certificate to hr@newjob.in and set a reminder to call them on Monday at noon.", "output": "Email my certificate to hr@newjob.in\nset a reminder to call them on Monday at noon"}
{"input": "Play some lo-fi music and email the playlist to amrita.relax@gmail.com.", "output": "Play some lo-fi music\nemail the playlist to amrita.relax@gmail.com"}
{"input": "Check today’s weather in Chennai and send it to my cousin at karan.c@familymail.com.", "output": "Check today’s weather in Chennai\nsend it to my cousin at karan.c@familymail.com"}
{"input": "Set a reminder for my passport renewal next Thursday and send a notification to travel@paperwork.in.", "output": "Set a reminder for my passport renewal next Thursday\nsend a notification to travel@paperwork.in"}
{"input": "Email my holiday plan to vacation@funtrips.com and check the current weather in Manali.", "output": "Email my holiday plan to vacation@funtrips.com\ncheck the current weather in Manali"}
{"input": "Play 'Shape of You' by Ed Sheeran and forward it to my friend at sharad.tunes@music.com.", "output": "Play 'Shape of You' by Ed Sheeran\nforward it to my friend at sharad.tunes@music.com"}
{"input": "Check tech news and email the highlights to updates@dailydigest.org.", "output": "Check tech news\nemail the highlights to updates@dailydigest.org"}
{"input": "Set a schedule for my yoga session at 6 AM daily and send an email to my coach at priya.health@gmail.com.", "output": "Set a schedule for my yoga session at 6 AM daily\nsend an email to my coach at priya.health@gmail.com"}
{"input": "Email the invitation to family@functions.com and check the weather in Lucknow for Saturday.", "output": "Email the invitation to family@functions.com\ncheck the weather in Lucknow for Saturday"}
{"input": "Play some chill music and email the album art to dev@designpeek.net.", "output": "Play some chill music\nemail the album art to dev@designpeek.net"}
{"input": "Send my resume to careers@nextgig.io and schedule a reminder to follow up in three days.", "output": "Send my resume to careers@nextgig.io\nschedule a reminder to follow up in three days"}
{"input": "Check news about the Indian elections and forward it to uncle.ravi@updates.in.", "output": "Check news about the Indian elections\nforward it to uncle.ravi@updates.in"}
{"input": "Email the class notes to tutor@coaching.com and set a reminder to review them at 5 PM.", "output": "Email the class notes to tutor@coaching.com\nset a reminder to review them at 5 PM"}
{"input": "Play devotional songs and send one to my mother at mom.blessings@family.com.", "output": "Play devotional songs\nsend one to my mother at mom.blessings@family.com"}
{"input": "Set a reminder to feed the dog every day at 8 AM and email the pet food order to supplies@pawcart.in.", "output": "Set a reminder to feed the dog every day at 8 AM\nemail the pet food order to supplies@pawcart.in"}
{"input": "Check the weather in Goa and email a beach gear list to ananya.trip@vacay.in.", "output": "Check the weather in Goa\nemail a beach gear list to ananya.trip@vacay.in"}
{"input": "Play 'Hotel California' and send the lyrics to my dad at classic.rock@musicmail.com.", "output": "Play 'Hotel California'\nsend the lyrics to my dad at classic.rock@musicmail.com"}
{"input": "Email the rent receipt to landlord@housemail.com and schedule a reminder to pay next month’s rent.", "output": "Email the rent receipt to landlord@housemail.com\nschedule a reminder to pay next month’s rent"}
{"input": "Check the forecast for Shimla tomorrow and email a packing checklist to meera@tripready.com.", "output": "Check the forecast for Shimla tomorrow\nemail a packing checklist to meera@tripready.com"}
{"input": "Play 'Senorita' by Shawn Mendes and Camila Cabello, then email the video to a.friend@beats.com.", "output": "Play 'Senorita' by Shawn Mendes and Camila Cabello\nemail the video to a.friend@beats.com"}
{"input": "Send a mail to support@delivery.in about late package and check weather in my city.", "output": "Send a mail to support@delivery.in about late package\ncheck weather in my city"}
{"input": "Email the grocery list to mom@home.org and set a reminder to shop at 6 PM.", "output": "Email the grocery list to mom@home.org\nset a reminder to shop at 6 PM"}
{"input": "Play some instrumental music and send a track to my art group at art@creativehues.in.", "output": "Play some instrumental music\nsend a track to my art group at art@creativehues.in"}
{"input": "Set a birthday reminder for Megha on July 3rd and send a gift suggestion email to gifts@ideabox.com.", "output": "Set a birthday reminder for Megha on July 3rd\nsend a gift suggestion email to gifts@ideabox.com"}
{"input": "Check today’s weather in Pune and send it to my friend at meet.weather@city.com.", "output": "Check today’s weather in Pune\nsend it to my friend at meet.weather@city.com"}
{"input": "Play 'Photograph' by Ed Sheeran and forward it to my sister at nostalgia@memories.in.", "output": "Play 'Photograph' by Ed Sheeran\nforward it to my sister at nostalgia@memories.in"}
{"input": "Send the updated CV to apply@newroles.com and check latest hiring news.", "output": "Send the updated CV to apply@newroles.com\ncheck latest hiring news"}
{"input": "Schedule reminder to pay electricity bill on 5th and send a mail to alerts@bills.in.", "output": "Schedule reminder to pay electricity bill on 5th\nsend a mail to alerts@bills.in"}
{"input": "Email the new password to admin@secure.com and play white noise for focus.", "output": "Email the new password to admin@secure.com\nplay white noise for focus"}
{"input": "Check political news today and email highlights to deepak@civics.org.", "output": "Check political news today\nemail highlights to deepak@civics.org"}
{"input": "Play rain sounds and email a photo of today’s clouds to weather@natureview.in.", "output": "Play rain sounds\nemail a photo of today’s clouds to weather@natureview.in"}
{"input": "Email new login credentials to hr@onboard.com and set a reminder to follow up after 2 days.", "output": "Email new login credentials to hr@onboard.com\nset a reminder to follow up after 2 days"}
{"input": "Set a schedule for gym every evening at 7 and email trainer@fitzone.com.", "output": "Set a schedule for gym every evening at 7\nemail trainer@fitzone.com"}
{"input": "Play latest Arijit Singh songs and send a link to rahul@musicfan.in.", "output": "Play latest Arijit Singh songs\nsend a link to rahul@musicfan.in"}
{"input": "Send a mail to mentor@careercoach.com asking for resume feedback and check job news.", "output": "Send a mail to mentor@careercoach.com asking for resume feedback\ncheck job news"}
{"input": "Set a reminder for water delivery on Monday and email the provider at aqua@watersupply.com.", "output": "Set a reminder for water delivery on Monday\nemail the provider at aqua@watersupply.com"}
{"input": "Check weather in Nainital for next weekend and email a plan to tanvi.trips@gmail.com.", "output": "Check weather in Nainital for next weekend\nemail a plan to tanvi.trips@gmail.com"}
{"input": "Play a peaceful mantra and send it to my aunt at aunt.blessings@mail.com.", "output": "Play a peaceful mantra\nsend it to my aunt at aunt.blessings@mail.com"}
{"input": "Send feedback to course@edtech.io and set a schedule to finish remaining modules by Thursday.", "output": "Send feedback to course@edtech.io\nset a schedule to finish remaining modules by Thursday"}
{"input": "Email train ticket details to dad@home.org and check weather in Delhi for his journey.", "output": "Email train ticket details to dad@home.org\ncheck weather in Delhi for his journey"}
{"input": "Play instrumental flute music and email it to arts.club@creatives.org.", "output": "Play instrumental flute music\nemail it to arts.club@creatives.org"}
{"input": "Send an email to admissions@university.edu requesting information about the master's program and application deadlines, then check weather in New York for this weekend.", "output": "Send an email to admissions@university.edu requesting information about the master's program and application deadlines\ncheck weather in New York for this weekend"}
{"input": "Email the support team at support@cloudservices.com reporting an outage issue and ask for estimated fix time, then play relaxing music.", "output": "Email the support team at support@cloudservices.com reporting an outage issue and ask for estimated fix time\nplay relaxing music"}
{"input": "Send a job application email to careers@fintechstartup.com attaching my resume and cover letter, then check finance news.", "output": "Send a job application email to careers@fintechstartup.com attaching my resume and cover letter\ncheck finance news"}
{"input": "Mail the monthly sales report to salesmanager@retailcorp.com and ask for feedback, then check retail industry news.", "output": "Mail the monthly sales report to salesmanager@retailcorp.com and ask for feedback\ncheck retail industry news"}
{"input": "Send an inquiry email to hr@logisticscompany.com about job openings in warehouse management, then play upbeat pop music.", "output": "Send an inquiry email to hr@logisticscompany.com about job openings in warehouse management\nplay upbeat pop music"}
{"input": "Email customer.service@hotelchain.com to confirm my reservation and request early check-in, then check travel alerts.", "output": "Email customer.service@hotelchain.com to confirm my reservation and request early check-in\ncheck travel alerts"}
{"input": "Send feedback email to support@educationplatform.com about recent platform updates, then check edtech news.", "output": "Send feedback email to support@educationplatform.com about recent platform updates\ncheck edtech news"}
{"input": "Mail the contract draft to legal@consultancyfirm.com and request review comments, then play classical music.", "output": "Mail the contract draft to legal@consultancyfirm.com and request review comments\nplay classical music"}
{"input": "Email the marketing team at marketing@adagency.com with the new social media plan, then check social media trends.", "output": "Email the marketing team at marketing@adagency.com with the new social media plan\ncheck social media trends"}
{"input": "Send a thank you email to professor.saito@university.edu for recommendation letter, then check academic conferences news.", "output": "Send a thank you email to professor.saito@university.edu for recommendation letter\ncheck academic conferences news"}
{"input": "Email hr@manufacturingco.com to schedule an interview and ask about job role details, then play motivational music.", "output": "Email hr@manufacturingco.com to schedule an interview and ask about job role details\nplay motivational music"}
{"input": "Send an email to client.support@softwarehouse.com reporting a software bug and requesting a fix, then check tech news.", "output": "Send an email to client.support@softwarehouse.com reporting a software bug and requesting a fix\ncheck tech news"}
{"input": "Mail the project budget to finance@constructionfirm.com and ask for approval status, then check construction industry news.", "output": "Mail the project budget to finance@constructionfirm.com and ask for approval status\ncheck construction industry news"}
{"input": "Send inquiry email to info@travelagency.com about group tour packages, then play travel playlist.", "output": "Send inquiry email to info@travelagency.com about group tour packages\nplay travel playlist"}
{"input": "Email the conference organizers at events@techsummit.com requesting registration details, then check technology news.", "output": "Email the conference organizers at events@techsummit.com requesting registration details\ncheck technology news"}
{"input": "Send a follow-up email to vendor@supplychain.com about shipment delays, then check logistics news.", "output": "Send a follow-up email to vendor@supplychain.com about shipment delays\ncheck logistics news"}
{"input": "Mail the customer complaint to support@retailstore.com and request urgent resolution, then play calm music.", "output": "Mail the customer complaint to support@retailstore.com and request urgent resolution\nplay calm music"}
{"input": "Send email to hr@healthcareprovider.com to request job application status, then check healthcare news.", "output": "Send email to hr@healthcareprovider.com to request job application status\ncheck healthcare news"}
{"input": "Email the training department at training@corporate.com about upcoming workshops, then play office playlist.", "output": "Email the training department at training@corporate.com about upcoming workshops\nplay office playlist"}
{"input": "Send an invitation email to partners@businessnetwork.com for the annual meetup, then check business news.", "output": "Send an invitation email to partners@businessnetwork.com for the annual meetup\ncheck business news"}
{"input": "Mail the feedback form to customers@fooddelivery.com and request ratings, then play cafe music.", "output": "Mail the feedback form to customers@fooddelivery.com and request ratings\nplay cafe music"}
{"input": "Email the scholarships@educationfoundation.org to ask about eligibility criteria, then check scholarship news.", "output": "Email the scholarships@educationfoundation.org to ask about eligibility criteria\ncheck scholarship news"}
{"input": "Send complaint email to support@bankingservices.com about transaction failure, then check financial news.", "output": "Send complaint email to support@bankingservices.com about transaction failure\ncheck financial news"}
{"input": "Email the editorial team at editor@newsportal.com with article submission, then check current affairs news.", "output": "Email the editorial team at editor@newsportal.com with article submission\ncheck current affairs news"}
{"input": "Mail the payment receipt to billing@utilitiescompany.com and request confirmation, then check utility news.", "output": "Mail the payment receipt to billing@utilitiescompany.com and request confirmation\ncheck utility news"}
{"input": "Send inquiry email to hr@charity.org about volunteer opportunities, then check nonprofit news.", "output": "Send inquiry email to hr@charity.org about volunteer opportunities\ncheck nonprofit news"}
{"input": "Email client.services@designagency.com with project update, then check design industry news.", "output": "Email client.services@designagency.com with project update\ncheck design industry news"}
{"input": "Send reminder email to team@marketingfirm.com about campaign deadline, then play focus music.", "output": "Send reminder email to team@marketingfirm.com about campaign deadline\nplay focus music"}
{"input": "Mail the donation receipt to donor@fundraiser.org and thank them, then check charity event news.", "output": "Mail the donation receipt to donor@fundraiser.org and thank them\ncheck charity event news"}
{"input": "Send notification email to members@sportsclub.com about match schedule changes, then play sports playlist.", "output": "Send notification email to members@sportsclub.com about match schedule changes\nplay sports playlist"}
{"input": "Email the HR department at hr@corporate.com to request employee benefits info, then check HR news.", "output": "Email the HR department at hr@corporate.com to request employee benefits info\ncheck HR news"}
{"input": "Send an email to admissions@artschool.edu to ask about portfolio submission guidelines, then check art news.", "output": "Send an email to admissions@artschool.edu to ask about portfolio submission guidelines\ncheck art news"}
{"input": "Email support@softwarefirm.com reporting login issues, then play ambient music.", "output": "Email support@softwarefirm.com reporting login issues\nplay ambient music"}
{"input": "Send feedback to feedback@restaurantchain.com about recent dining experience, then check food news.", "output": "Send feedback to feedback@restaurantchain.com about recent dining experience\ncheck food news"}
{"input": "Mail the quarterly newsletter to subscribers@newsletter.com and ask for feedback, then play jazz music.", "output": "Mail the quarterly newsletter to subscribers@newsletter.com and ask for feedback\nplay jazz music"}
{"input": "Send inquiry email to sales@electronicsstore.com about warranty options, then check tech product news.", "output": "Send inquiry email to sales@electronicsstore.com about warranty options\ncheck tech product news"}
{"input": "Email the booking team at bookings@eventvenue.com to confirm event date, then play party playlist.", "output": "Email the booking team at bookings@eventvenue.com to confirm event date\nplay party playlist"}
{"input": "Send a thank you email to mentor@startupincubator.com for guidance, then check startup news.", "output": "Send a thank you email to mentor@startupincubator.com for guidance\ncheck startup news"}
{"input": "Mail request to customer.support@ecommerce.com for return policy details, then play shopping playlist.", "output": "Mail request to customer.support@ecommerce.com for return policy details\nplay shopping playlist"}
{"input": "Send inquiry email to support@mobileapp.com about app crashes, then play chill music.", "output": "Send inquiry email to support@mobileapp.com about app crashes\nplay chill music"}
{"input": "Email hr@hospital.com to inquire about nursing jobs, then check healthcare news.", "output": "Email hr@hospital.com to inquire about nursing jobs\ncheck healthcare news"}
{"input": "Send follow-up email to vendor@suppliers.com about delayed payment, then check supply chain news.", "output": "Send follow-up email to vendor@suppliers.com about delayed payment\ncheck supply chain news"}
{"input": "Mail the project summary to project.manager@itfirm.com and request next steps, then play work playlist.", "output": "Mail the project summary to project.manager@itfirm.com and request next steps\nplay work playlist"}
{"input": "Send invitation email to partners@techconference.com for panel discussion, then check tech news.", "output": "Send invitation email to partners@techconference.com for panel discussion\ncheck tech news"}
{"input": "Email the customer care at care@utilitieservice.com regarding billing issue, then check utility news.", "output": "Email the customer care at care@utilitieservice.com regarding billing issue\ncheck utility news"}
{"input": "Send feedback to feedback@travelagency.com about recent trip, then play travel music.", "output": "Send feedback to feedback@travelagency.com about recent trip\nplay travel music"}
{"input": "Mail the invoice to accounts@legalfirm.com and ask for payment update, then check legal news.", "output": "Mail the invoice to accounts@legalfirm.com and ask for payment update\ncheck legal news"}
{"input": "Send inquiry to info@charityfoundation.org about fundraising events, then check nonprofit news.", "output": "Send inquiry to info@charityfoundation.org about fundraising events\ncheck nonprofit news"}
{"input": "Send a follow-up email to dev.support@cloudteam.io about the unresolved ticket, and check if it’s sunny in Jaipur.", "output": "Send a follow-up email to dev.support@cloudteam.io about the unresolved ticket\ncheck if it’s sunny in Jaipur"}
{"input": "Play 'Shallow' by Lady Gaga and Bradley Cooper and email my music review to blog@audiophilewrites.com.", "output": "Play 'Shallow' by Lady Gaga and Bradley Cooper\nemail my music review to blog@audiophilewrites.com"}
{"input": "Set a schedule to run every evening at 6 PM and email the routine to fitplanner@healthlog.in.", "output": "Set a schedule to run every evening at 6 PM\nemail the routine to fitplanner@healthlog.in"}
{"input": "Check weather forecast for Mysore tomorrow and email it to reena.travels@exploreplanner.com.", "output": "Check weather forecast for Mysore tomorrow\nemail it to reena.travels@exploreplanner.com"}
{"input": "Email a formal complaint to admin@hostelservices.org about the water shortage, and then play soft background music.", "output": "Email a formal complaint to admin@hostelservices.org about the water shortage\nplay soft background music"}
{"input": "Play 'Viva La Vida' by Coldplay and email my thoughts on the song to my group at musiccircle@audiovibes.in.", "output": "Play 'Viva La Vida' by Coldplay\nemail my thoughts on the song to my group at musiccircle@audiovibes.in"}
{"input": "Send an appreciation email to info@cleanearthfoundation.com for organizing the cleanup drive, then check today’s weather in Surat.", "output": "Send an appreciation email to info@cleanearthfoundation.com for organizing the cleanup drive\ncheck today’s weather in Surat"}
{"input": "Email the weekly reading list to my students at litclass@educationhub.edu and set a reminder to review it on Friday.", "output": "Email the weekly reading list to my students at litclass@educationhub.edu\nset a reminder to review it on Friday"}
{"input": "Play relaxing ambient sounds and email a quick update to my cofounder at rina.joshi@buildwithus.io.", "output": "Play relaxing ambient sounds\nemail a quick update to my cofounder at rina.joshi@buildwithus.io"}
{"input": "Check the news about the stock market and email the summary to investments@finstrategy.com.", "output": "Check the news about the stock market\nemail the summary to investments@finstrategy.com"}
{"input": "Set a reminder for tomorrow’s client meeting at 3 PM and email the agenda to sales.team@dealpushers.com.", "output": "Set a reminder for tomorrow’s client meeting at 3 PM\nemail the agenda to sales.team@dealpushers.com"}
{"input": "Email a detailed recipe to priya.sharma@cooklog.in and then play some upbeat kitchen music.", "output": "Email a detailed recipe to priya.sharma@cooklog.in\nplay some upbeat kitchen music"}
{"input": "Send an email to principal@greenschool.edu about the upcoming parent-teacher meeting and then check the forecast for Shimla.", "output": "Send an email to principal@greenschool.edu about the upcoming parent-teacher meeting\ncheck the forecast for Shimla"}
{"input": "Play soft piano instrumentals and send a reminder email to the design team at uiux@pixelforge.co.", "output": "Play soft piano instrumentals\nsend a reminder email to the design team at uiux@pixelforge.co"}
{"input": "Email the ticket details to rohit.kumar@eventgenix.com and check the weather for Bengaluru today.", "output": "Email the ticket details to rohit.kumar@eventgenix.com\ncheck the weather for Bengaluru today"}
{"input": "Set a reminder for yoga class on Monday at 7 AM and send an email to coach.meena@wellnessline.org confirming attendance.", "output": "Set a reminder for yoga class on Monday at 7 AM\nsend an email to coach.meena@wellnessline.org confirming attendance"}
{"input": "Send a birthday greeting to my niece at sana.khan@familymail.com and play cheerful birthday music.", "output": "Send a birthday greeting to my niece at sana.khan@familymail.com\nplay cheerful birthday music"}
{"input": "Play 'A Sky Full of Stars' by Coldplay and email a photo of the night sky to galaxywatchers@astroinbox.net.", "output": "Play 'A Sky Full of Stars' by Coldplay\nemail a photo of the night sky to galaxywatchers@astroinbox.net"}
{"input": "Email my shopping list to groceries@homeneeds.in and then set a reminder to buy everything this Saturday morning.", "output": "Email my shopping list to groceries@homeneeds.in\nset a reminder to buy everything this Saturday morning"}
{"input": "Send an RSVP to vip.events@celebrategroup.org for the gala dinner and check weather in Hyderabad for Friday.", "output": "Send an RSVP to vip.events@celebrategroup.org for the gala dinner\ncheck weather in Hyderabad for Friday"}
{"input": "Check today’s news and send a summary email to my colleague at neha.rathi@digifinance.io.", "output": "Check today’s news\nsend a summary email to my colleague at neha.rathi@digifinance.io"}
{"input": "Play nature forest sounds and send my monthly report to manager@greenworks.in.", "output": "Play nature forest sounds\nsend my monthly report to manager@greenworks.in"}
{"input": "Send a reminder email to my doctor at clinic.contact@healhub.com for my test results and set an appointment reminder for next week.", "output": "Send a reminder email to my doctor at clinic.contact@healhub.com\nset an appointment reminder for next week"}
{"input": "Set a schedule to water garden plants every evening at 6 PM and email the checklist to dad@homeplanner.in.", "output": "Set a schedule to water garden plants every evening at 6 PM\nemail the checklist to dad@homeplanner.in"}
{"input": "Check the latest weather updates in Udaipur and forward them to raj.trips@vacayline.com.", "output": "Check the latest weather updates in Udaipur\nforward them to raj.trips@vacayline.com"}
{"input": "Send a congratulations email to my teammate at devika.malik@brightteam.org for completing the project and play upbeat music.", "output": "Send a congratulations email to my teammate at devika.malik@brightteam.org for completing the project\nplay upbeat music"}
{"input": "Play 'Hall of Fame' by The Script and email my speech draft to speakingclub@oratorygroup.com.", "output": "Play 'Hall of Fame' by The Script\nemail my speech draft to speakingclub@oratorygroup.com"}
{"input": "Send a schedule of my classes to coordinator@artsacademy.edu and set a reminder for the art exhibition on Sunday.", "output": "Send a schedule of my classes to coordinator@artsacademy.edu\nset a reminder for the art exhibition on Sunday"}
{"input": "Email my travel insurance documents to help@tripsecure.com and check if it’s raining in Kochi.", "output": "Email my travel insurance documents to help@tripsecure.com\ncheck if it’s raining in Kochi"}
{"input": "Check current weather in Agra and email it to info@tajvisitplanner.com.", "output": "Check current weather in Agra\nemail it to info@tajvisitplanner.com"}
{"input": "Set a reminder for monthly rent payment on the 1st and email landlord@aptrentals.com about last month’s receipt.", "output": "Set a reminder for monthly rent payment on the 1st\nemail landlord@aptrentals.com about last month’s receipt"}
{"input": "Play classic rock playlist and email music suggestions to club@vinylculture.net.", "output": "Play classic rock playlist\nemail music suggestions to club@vinylculture.net"}
{"input": "Send an email to sanjay.bora@healthtrack.com summarizing the fitness progress this week and set a reminder to weigh in Sunday.", "output": "Send an email to sanjay.bora@healthtrack.com summarizing the fitness progress this week\nset a reminder to weigh in Sunday"}
{"input": "Email the scanned homework to teacher.rahul@classportal.edu and play some peaceful focus music.", "output": "Email the scanned homework to teacher.rahul@classportal.edu\nplay some peaceful focus music"}
{"input": "Play morning bhajans and send a good morning note to mom@familyconnect.in.", "output": "Play morning bhajans\nsend a good morning note to mom@familyconnect.in"}
{"input": "Email the presentation deck to startup.pitch@accelerators.org and check weather in Pune tomorrow morning.", "output": "Email the presentation deck to startup.pitch@accelerators.org\ncheck weather in Pune tomorrow morning"}
{"input": "Set a reminder for my language class every Tuesday at 4 PM and email the schedule to mentor.language@learnfast.in.", "output": "Set a reminder for my language class every Tuesday at 4 PM\nemail the schedule to mentor.language@learnfast.in"}
{"input": "Play motivational Hindi songs and email my study plan to my tutor at vidya.kapoor@studynow.edu.", "output": "Play motivational Hindi songs\nemail my study plan to my tutor at vidya.kapoor@studynow.edu"}
{"input": "Send a thank-you email to ms.kiran@mentorshipcircle.com for reviewing my resume and play something mellow.", "output": "Send a thank-you email to ms.kiran@mentorshipcircle.com for reviewing my resume\nplay something mellow"}
{"input": "Email the delivery complaint to support@quickparcel.in and check if there’s rain in Ludhiana tonight.", "output": "Email the delivery complaint to support@quickparcel.in\ncheck if there’s rain in Ludhiana tonight"}
{"input": "Check today's headlines and forward them to editor@dailybyte.org.", "output": "Check today's headlines\nforward them to editor@dailybyte.org"}
{"input": "Play 'Let It Be' by The Beatles and send a report update to data.team@analyticslab.net.", "output": "Play 'Let It Be' by The Beatles\nsend a report update to data.team@analyticslab.net"}
{"input": "Set a reminder for eye check-up next Wednesday at 5 PM and email the confirmation to care@visionplus.in.", "output": "Set a reminder for eye check-up next Wednesday at 5 PM\nemail the confirmation to care@visionplus.in"}
{"input": "Send a motivational message to interns@launchacademy.io and play some calm concentration music.", "output": "Send a motivational message to interns@launchacademy.io\nplay some calm concentration music"}
{"input": "Play background lounge music and email the invoice to billing@rentacar.in.", "output": "Play background lounge music\nemail the invoice to billing@rentacar.in"}
{"input": "Email class notes to archana.v@studentlife.edu and check weather updates for Varanasi.", "output": "Email class notes to archana.v@studentlife.edu\ncheck weather updates for Varanasi"}
{"input": "Send the list of supplies to orders@eventneeds.in and set a reminder for follow-up on Tuesday.", "output": "Send the list of supplies to orders@eventneeds.in\nset a reminder for follow-up on Tuesday"}
{"input": "Send an email to hr@techcorp.com to request information about remote work policies and available job openings, then check technology news updates.", "output": "Send an email to hr@techcorp.com to request information about remote work policies and available job openings\ncheck technology news updates"}
{"input": "Email the finance department at finance@startup.com to submit the quarterly expense report and ask for reimbursement timeline, then play instrumental music.", "output": "Email the finance department at finance@startup.com to submit the quarterly expense report and ask for reimbursement timeline\nplay instrumental music"}
{"input": "Send a customer support email to helpdesk@internetprovider.com about slow internet speeds and ask for troubleshooting steps, then check internet speed status.", "output": "Send a customer support email to helpdesk@internetprovider.com about slow internet speeds and ask for troubleshooting steps\ncheck internet speed status"}
{"input": "Mail the project proposal to projects@constructionfirm.com and request a meeting to discuss further details, then check construction market news.", "output": "Mail the project proposal to projects@constructionfirm.com and request a meeting to discuss further details\ncheck construction market news"}
{"input": "Send an inquiry email to info@conferencecenter.com about venue availability and pricing, then play conference playlist.", "output": "Send an inquiry email to info@conferencecenter.com about venue availability and pricing\nplay conference playlist"}
{"input": "Email admissions@medschool.edu to ask about application requirements and deadline extensions, then check medical education news.", "output": "Email admissions@medschool.edu to ask about application requirements and deadline extensions\ncheck medical education news"}
{"input": "Send a follow-up email to hr@recruitmentagency.com about interview scheduling and required documents, then play calm background music.", "output": "Send a follow-up email to hr@recruitmentagency.com about interview scheduling and required documents\nplay calm background music"}
{"input": "Mail the invoice to billing@marketingagency.com and ask for payment confirmation, then check marketing trends news.", "output": "Mail the invoice to billing@marketingagency.com and ask for payment confirmation\ncheck marketing trends news"}
{"input": "Email the support team at support@softwareapp.com to report a recurring bug and request an update, then play focus music.", "output": "Email the support team at support@softwareapp.com to report a recurring bug and request an update\nplay focus music"}
{"input": "Send a thank you email to mentor@entrepreneurship.org for guidance and support, then check startup news.", "output": "Send a thank you email to mentor@entrepreneurship.org for guidance and support\ncheck startup news"}
{"input": "Email hr@hospital.org to inquire about available nursing positions and shift timings, then check healthcare news.", "output": "Email hr@hospital.org to inquire about available nursing positions and shift timings\ncheck healthcare news"}
{"input": "Mail the performance report to manager@corporate.com and request feedback, then play relaxing music.", "output": "Mail the performance report to manager@corporate.com and request feedback\nplay relaxing music"}
{"input": "Send inquiry email to info@eventplanner.com about wedding planning packages and availability, then play romantic playlist.", "output": "Send inquiry email to info@eventplanner.com about wedding planning packages and availability\nplay romantic playlist"}
{"input": "Email the customer care at care@utilitycompany.com to report billing discrepancies and ask for resolution, then check utility news.", "output": "Email the customer care at care@utilitycompany.com to report billing discrepancies and ask for resolution\ncheck utility news"}
{"input": "Send invitation email to partners@businessnetwork.com for the upcoming networking event, then check business news.", "output": "Send invitation email to partners@businessnetwork.com for the upcoming networking event\ncheck business news"}
{"input": "Mail the donation acknowledgment to donors@charityfoundation.org and thank them, then play charity event music.", "output": "Mail the donation acknowledgment to donors@charityfoundation.org and thank them\nplay charity event music"}
{"input": "Email editor@publication.com submitting an article draft and requesting feedback, then check publishing industry news.", "output": "Email editor@publication.com submitting an article draft and requesting feedback\ncheck publishing industry news"}
{"input": "Send reminder email to team@marketingfirm.com about the deadline for the advertising campaign, then play upbeat music.", "output": "Send reminder email to team@marketingfirm.com about the deadline for the advertising campaign\nplay upbeat music"}
{"input": "Email hr@educationboard.org to ask about teacher recruitment policies and upcoming exams, then check education news.", "output": "Email hr@educationboard.org to ask about teacher recruitment policies and upcoming exams\ncheck education news"}
{"input": "Send feedback to support@hotelchain.com about recent stay and service quality, then play relaxing hotel playlist.", "output": "Send feedback to support@hotelchain.com about recent stay and service quality\nplay relaxing hotel playlist"}
{"input": "Mail the project documentation to techlead@softwarecompany.com and request code review, then check software development news.", "output": "Mail the project documentation to techlead@softwarecompany.com and request code review\ncheck software development news"}
{"input": "Send inquiry email to info@artgallery.com about exhibition schedules and artist registration, then play classical music.", "output": "Send inquiry email to info@artgallery.com about exhibition schedules and artist registration\nplay classical music"}
{"input": "Email customer.support@electronicsstore.com reporting a faulty product and requesting replacement, then check electronics news.", "output": "Email customer.support@electronicsstore.com reporting a faulty product and requesting replacement\ncheck electronics news"}
{"input": "Send a thank you email to professor.jones@university.edu for academic support, then check education news.", "output": "Send a thank you email to professor.jones@university.edu for academic support\ncheck education news"}
{"input": "Email hr@retailchain.com to request information about seasonal job openings, then check retail news.", "output": "Email hr@retailchain.com to request information about seasonal job openings\ncheck retail news"}
{"input": "Mail the updated resume to careers@techstartup.com and request interview opportunity, then play startup music.", "output": "Mail the updated resume to careers@techstartup.com and request interview opportunity\nplay startup music"}
{"input": "Send complaint email to support@internetprovider.com about frequent outages, then check internet news.", "output": "Send complaint email to support@internetprovider.com about frequent outages\ncheck internet news"}
{"input": "Email admissions@university.edu to request scholarship application details and deadline, then check education funding news.", "output": "Email admissions@university.edu to request scholarship application details and deadline\ncheck education funding news"}
{"input": "Send a follow-up email to hr@consultingfirm.com about job application status, then play calm music.", "output": "Send a follow-up email to hr@consultingfirm.com about job application status\nplay calm music"}
{"input": "Mail the monthly newsletter to subscribers@newsletter.com and ask for feedback, then check media news.", "output": "Mail the monthly newsletter to subscribers@newsletter.com and ask for feedback\ncheck media news"}
{"input": "Send inquiry email to info@travelagency.com about honeymoon packages and deals, then play romantic music.", "output": "Send inquiry email to info@travelagency.com about honeymoon packages and deals\nplay romantic music"}
{"input": "Email support@mobileapp.com reporting app crashes after update, then check app news.", "output": "Email support@mobileapp.com reporting app crashes after update\ncheck app news"}
{"input": "Send feedback to feedback@restaurantchain.com about menu variety and service, then play jazz music.", "output": "Send feedback to feedback@restaurantchain.com about menu variety and service\nplay jazz music"}
{"input": "Mail the payment confirmation to accounts@lawfirm.com and request receipt, then check legal news.", "output": "Mail the payment confirmation to accounts@lawfirm.com and request receipt\ncheck legal news"}
{"input": "Send inquiry to hr@ngo.org about volunteer programs and application process, then check NGO news.", "output": "Send inquiry to hr@ngo.org about volunteer programs and application process\ncheck NGO news"}
{"input": "Email client.services@designagency.com with project status update and ask for feedback, then play design music.", "output": "Email client.services@designagency.com with project status update and ask for feedback\nplay design music"}
{"input": "Send reminder email to team@marketingfirm.com about client meeting schedule, then play office playlist.", "output": "Send reminder email to team@marketingfirm.com about client meeting schedule\nplay office playlist"}
{"input": "Mail the donation receipt to donors@fundraiser.org and thank them sincerely, then play charity music.", "output": "Mail the donation receipt to donors@fundraiser.org and thank them sincerely\nplay charity music"}
{"input": "Send notification email to members@sportsclub.com about upcoming tournament dates, then play sports playlist.", "output": "Send notification email to members@sportsclub.com about upcoming tournament dates\nplay sports playlist"}
{"input": "Email hr@corporate.com to inquire about employee benefits and leave policies, then check HR news.", "output": "Email hr@corporate.com to inquire about employee benefits and leave policies\ncheck HR news"}
{"input": "Send an email to admissions@artschool.edu asking for portfolio submission guidelines and deadlines, then check art news.", "output": "Send an email to admissions@artschool.edu asking for portfolio submission guidelines and deadlines\ncheck art news"}
{"input": "Email support@softwarefirm.com reporting login issues with two-factor authentication, then play ambient music.", "output": "Email support@softwarefirm.com reporting login issues with two-factor authentication\nplay ambient music"}
{"input": "Send feedback to feedback@restaurantchain.com about hygiene and customer service, then check food news.", "output": "Send feedback to feedback@restaurantchain.com about hygiene and customer service\ncheck food news"}
{"input": "Mail the quarterly newsletter to subscribers@newsletter.com with updates and request feedback, then play jazz music.", "output": "Mail the quarterly newsletter to subscribers@newsletter.com with updates and request feedback\nplay jazz music"}
{"input": "Send inquiry email to sales@electronicsstore.com about product warranty and return policy, then check tech product news.", "output": "Send inquiry email to sales@electronicsstore.com about product warranty and return policy\ncheck tech product news"}
{"input": "Email booking@eventvenue.com to confirm event booking and ask for setup details, then play party playlist.", "output": "Email booking@eventvenue.com to confirm event booking and ask for setup details\nplay party playlist"}
{"input": "Send a thank you email to mentor@startupincubator.com expressing gratitude for support, then check startup news.", "output": "Send a thank you email to mentor@startupincubator.com expressing gratitude for support\ncheck startup news"}
{"input": "Mail request to customer.support@ecommerce.com asking about return policy and shipping time, then play shopping playlist.", "output": "Mail request to customer.support@ecommerce.com asking about return policy and shipping time\nplay shopping playlist"}
{"input": "Send inquiry email to support@mobileapp.com about app update features, then play chill music.", "output": "Send inquiry email to support@mobileapp.com about app update features\nplay chill music"}
{"input": "Email hr@hospital.com to inquire about nursing job openings and shift details, then check healthcare news.", "output": "Email hr@hospital.com to inquire about nursing job openings and shift details\ncheck healthcare news"}
{"input": "Send follow-up email to vendor@suppliers.com about payment status and delivery schedule, then check supply chain news.", "output": "Send follow-up email to vendor@suppliers.com about payment status and delivery schedule\ncheck supply chain news"}
{"input": "Send a follow-up email to recruiter.rahul@jobportal.com thanking for the interview opportunity and asking about next steps, then check weather forecast in Chennai.", "output": "Send a follow-up email to recruiter.rahul@jobportal.com thanking for the interview opportunity and asking about next steps\ncheck weather forecast in Chennai"}
{"input": "Email the quarterly sales analysis report to director.sales@bizcorp.com and highlight key performance areas, then play relaxing instrumental music.", "output": "Email the quarterly sales analysis report to director.sales@bizcorp.com and highlight key performance areas\nplay relaxing instrumental music"}
{"input": "Send a support request to tech.support@websolutions.com describing website downtime and attach screenshots, then check temperature in Mumbai.", "output": "Send a support request to tech.support@websolutions.com describing website downtime and attach screenshots\ncheck temperature in Mumbai"}
{"input": "Email the revised budget proposal to finance.team@enterprise.com with detailed cost breakdown, then play some soft piano music.", "output": "Email the revised budget proposal to finance.team@enterprise.com with detailed cost breakdown\nplay some soft piano music"}
{"input": "Send an email to hr@company.com requesting clarification on leave policy and attach relevant documents, then check if it will rain tomorrow in Bangalore.", "output": "Send an email to hr@company.com requesting clarification on leave policy and attach relevant documents\ncheck if it will rain tomorrow in Bangalore"}
{"input": "Email my presentation slides to team.lead@startup.com and request feedback before Friday, then play upbeat background music.", "output": "Email my presentation slides to team.lead@startup.com and request feedback before Friday\nplay upbeat background music"}
{"input": "Send a complaint email to support@onlinebank.com about unauthorized transaction and attach bank statements, then check today’s weather in Pune.", "output": "Send a complaint email to support@onlinebank.com about unauthorized transaction and attach bank statements\ncheck today’s weather in Pune"}
{"input": "Email an invitation to client@bigcorp.com for the product launch event and attach agenda, then check temperature in Kolkata.", "output": "Email an invitation to client@bigcorp.com for the product launch event and attach agenda\ncheck temperature in Kolkata"}
{"input": "Send a follow-up email to vendor@logistics.com about shipment delays and request updated delivery timeline, then play calm instrumental music.", "output": "Send a follow-up email to vendor@logistics.com about shipment delays and request updated delivery timeline\nplay calm instrumental music"}
{"input": "Email updated project documentation to dev.team@softwareinc.com and highlight recent changes, then check weather forecast for Hyderabad.", "output": "Email updated project documentation to dev.team@softwareinc.com and highlight recent changes\ncheck weather forecast for Hyderabad"}
{"input": "Send a thank-you email to prof.agarwal@university.edu for supervising my thesis and attach the final draft, then play soft acoustic music.", "output": "Send a thank-you email to prof.agarwal@university.edu for supervising my thesis and attach the final draft\nplay soft acoustic music"}
{"input": "Email the training schedule to trainees@skillhub.com and attach orientation materials, then check today's temperature in Jaipur.", "output": "Email the training schedule to trainees@skillhub.com and attach orientation materials\ncheck today's temperature in Jaipur"}
{"input": "Send a detailed feedback email to product.team@techgadgets.com about recent device issues and suggest improvements, then play soothing jazz music.", "output": "Send a detailed feedback email to product.team@techgadgets.com about recent device issues and suggest improvements\nplay soothing jazz music"}
{"input": "Email meeting minutes to manager.hr@corporate.com with action items and deadlines, then check weather forecast in Ahmedabad.", "output": "Email meeting minutes to manager.hr@corporate.com with action items and deadlines\ncheck weather forecast in Ahmedabad"}
{"input": "Send a request email to facilities@officepark.com about air conditioning maintenance and attach complaint form, then check if it will rain today in Surat.", "output": "Send a request email to facilities@officepark.com about air conditioning maintenance and attach complaint form\ncheck if it will rain today in Surat"}
{"input": "Email the finalized contract to legal.team@firm.com for signature and confirm next steps, then play classical music.", "output": "Email the finalized contract to legal.team@firm.com for signature and confirm next steps\nplay classical music"}
{"input": "Send a reminder email to participants@webinar.com about tomorrow's online session and attach access links, then check weather in New Delhi.", "output": "Send a reminder email to participants@webinar.com about tomorrow's online session and attach access links\ncheck weather in New Delhi"}
{"input": "Email the research paper draft to advisor.sen@university.edu requesting review comments, then play calm study music.", "output": "Email the research paper draft to advisor.sen@university.edu requesting review comments\nplay calm study music"}
{"input": "Send a request email to it.department@company.com for VPN access and attach approval form, then check temperature in Chennai.", "output": "Send a request email to it.department@company.com for VPN access and attach approval form\ncheck temperature in Chennai"}
{"input": "Email customer.feedback@onlineretail.com about recent shopping experience and attach photos of product, then play soft background music.", "output": "Email customer.feedback@onlineretail.com about recent shopping experience and attach photos of product\nplay soft background music"}
{"input": "Send an invitation email to partners@businessgroup.com for annual meeting and attach agenda, then check today’s temperature in Bangalore.", "output": "Send an invitation email to partners@businessgroup.com for annual meeting and attach agenda\ncheck today’s temperature in Bangalore"}
{"input": "Email the updated invoice to accounts@services.com with payment details and due date, then play relaxing jazz music.", "output": "Email the updated invoice to accounts@services.com with payment details and due date\nplay relaxing jazz music"}
{"input": "Send a support ticket email to helpdesk@cloudservices.com about data sync issues and attach error logs, then check weather forecast in Pune.", "output": "Send a support ticket email to helpdesk@cloudservices.com about data sync issues and attach error logs\ncheck weather forecast in Pune"}
{"input": "Email the new employee onboarding documents to hr@company.com and attach policy manuals, then play light instrumental music.", "output": "Email the new employee onboarding documents to hr@company.com and attach policy manuals\nplay light instrumental music"}
{"input": "Send a notification email to customers@shoppingportal.com about upcoming sale and attach promotional banners, then check temperature in Kolkata.", "output": "Send a notification email to customers@shoppingportal.com about upcoming sale and attach promotional banners\ncheck temperature in Kolkata"}
{"input": "Email project status update to project.manager@buildcorp.com highlighting milestones achieved and risks, then play smooth jazz music.", "output": "Email project status update to project.manager@buildcorp.com highlighting milestones achieved and risks\nplay smooth jazz music"}
{"input": "Send a feedback email to trainer@learnonline.com about course quality and suggest improvements, then check if it will rain in Jaipur tomorrow.", "output": "Send a feedback email to trainer@learnonline.com about course quality and suggest improvements\ncheck if it will rain in Jaipur tomorrow"}
{"input": "Email the product catalog update to sales.team@retail.com and attach price lists, then play soft pop music.", "output": "Email the product catalog update to sales.team@retail.com and attach price lists\nplay soft pop music"}
{"input": "Send an email to landlord@realestate.com about maintenance issues and request urgent repair, then check today's weather in Surat.", "output": "Send an email to landlord@realestate.com about maintenance issues and request urgent repair\ncheck today's weather in Surat"}
{"input": "Email registration confirmation to events@conference.com and attach payment receipt, then play ambient music.", "output": "Email registration confirmation to events@conference.com and attach payment receipt\nplay ambient music"}
{"input": "Send a newsletter draft to editor@magazine.com with article summaries and attach images, then check weather forecast in Ahmedabad.", "output": "Send a newsletter draft to editor@magazine.com with article summaries and attach images\ncheck weather forecast in Ahmedabad"}
{"input": "Email technical support at devices@smarttech.com reporting battery issues and attach device photos, then play soft classical music.", "output": "Email technical support at devices@smarttech.com reporting battery issues and attach device photos\nplay soft classical music"}
{"input": "Send an application email to internships@techfirm.com attaching cover letter and resume, then check temperature in New Delhi.", "output": "Send an application email to internships@techfirm.com attaching cover letter and resume\ncheck temperature in New Delhi"}
{"input": "Email schedule changes to team@marketing.com and attach revised calendar, then play light jazz music.", "output": "Email schedule changes to team@marketing.com and attach revised calendar\nplay light jazz music"}
{"input": "Send an email to supplier@rawmaterials.com requesting stock update and attach purchase history, then check today's weather in Bangalore.", "output": "Send an email to supplier@rawmaterials.com requesting stock update and attach purchase history\ncheck today's weather in Bangalore"}
{"input": "Email customer complaints summary to quality@products.com and attach survey results, then play calm instrumental music.", "output": "Email customer complaints summary to quality@products.com and attach survey results\nplay calm instrumental music"}
{"input": "Send a request email to transport@logistics.com for vehicle availability and attach booking form, then check temperature in Chennai.", "output": "Send a request email to transport@logistics.com for vehicle availability and attach booking form\ncheck temperature in Chennai"}
{"input": "Email the updated training manual to hr.training@company.com and request feedback, then play soft background music.", "output": "Email the updated training manual to hr.training@company.com and request feedback\nplay soft background music"}
{"input": "Send an inquiry email to support@softwaretools.com about feature availability and attach screenshots, then check weather forecast in Pune.", "output": "Send an inquiry email to support@softwaretools.com about feature availability and attach screenshots\ncheck weather forecast in Pune"}
{"input": "Email the feedback report to client.services@consulting.com and attach survey data, then play light acoustic music.", "output": "Email the feedback report to client.services@consulting.com and attach survey data\nplay light acoustic music"}
{"input": "Send an email to anita.singh@mediconnect.org about the rescheduled appointment and include the new prescription, then play a relaxing playlist.", "output": "Send an email to anita.singh@mediconnect.org about the rescheduled appointment and include the new prescription\nplay a relaxing playlist"}
{"input": "Email my presentation deck to neha.j@pitchtech.com before the 4 PM review and check the temperature in Kolkata.", "output": "Email my presentation deck to neha.j@pitchtech.com before the 4 PM review\ncheck the temperature in Kolkata"}
{"input": "Schedule a project milestone for Friday 3 PM and notify the team via email at dev.team@stackflow.io.", "output": "Schedule a project milestone for Friday 3 PM\nnotify the team via email at dev.team@stackflow.io"}
{"input": "Check tomorrow’s weather in Jaipur and send the update to raj@roadtrips.com.", "output": "Check tomorrow’s weather in Jaipur\nsend the update to raj@roadtrips.com"}
{"input": "Play 'Counting Stars' and email the lyrics to sahil.music@outlook.com.", "output": "Play 'Counting Stars'\nemail the lyrics to sahil.music@outlook.com"}
{"input": "Send an invoice to client.billing@finserve.net with the updated amount and due date, then set a payment reminder for Tuesday.", "output": "Send an invoice to client.billing@finserve.net with the updated amount and due date\nset a payment reminder for Tuesday"}
{"input": "Email our internship certificates to students@campusmail.edu and check today’s weather in Noida.", "output": "Email our internship certificates to students@campusmail.edu\ncheck today’s weather in Noida"}
{"input": "Set a daily water reminder for 9 AM, 1 PM, and 6 PM, and also email this schedule to my dietician at plan@healthwise.in.", "output": "Set a daily water reminder for 9 AM, 1 PM, and 6 PM\nemail this schedule to my dietician at plan@healthwise.in"}
{"input": "Check weather in Leh for next week and send a packing list to priya.trek@outlook.com.", "output": "Check weather in Leh for next week\nsend a packing list to priya.trek@outlook.com"}
{"input": "Play morning bhajans and forward the playlist to mom@dailyprayers.in.", "output": "Play morning bhajans\nforward the playlist to mom@dailyprayers.in"}
{"input": "Send a mail to admissions@techcamp.in requesting a seat confirmation and play some upbeat music.", "output": "Send a mail to admissions@techcamp.in requesting a seat confirmation\nplay some upbeat music"}
{"input": "Set a follow-up reminder with the real estate agent at 5 PM today and email property shortlist to buyer@homehunt.com.", "output": "Set a follow-up reminder with the real estate agent at 5 PM today\nemail property shortlist to buyer@homehunt.com"}
{"input": "Check news related to India’s startup funding and email highlights to startupintel@bizmail.com.", "output": "Check news related to India’s startup funding\nemail highlights to startupintel@bizmail.com"}
{"input": "Play 'Blinding Lights' and schedule a reminder to call Aryan at 6 PM.", "output": "Play 'Blinding Lights'\nschedule a reminder to call Aryan at 6 PM"}
{"input": "Send a mail to courier@expressship.com asking about the missing parcel, then check weather in Kochi.", "output": "Send a mail to courier@expressship.com asking about the missing parcel\ncheck weather in Kochi"}
{"input": "Email today’s meeting summary to team.leads@quickboard.ai and play some jazz instrumentals.", "output": "Email today’s meeting summary to team.leads@quickboard.ai\nplay some jazz instrumentals"}
{"input": "Set a recurring schedule for yoga every Saturday at 8 AM and email the class link to wellness@rebootlife.org.", "output": "Set a recurring schedule for yoga every Saturday at 8 AM\nemail the class link to wellness@rebootlife.org"}
{"input": "Check today’s air quality in Delhi and email the report to enviro.watch@ngo.net.", "output": "Check today’s air quality in Delhi\nemail the report to enviro.watch@ngo.net"}
{"input": "Play 'Bohemian Rhapsody' and email the album cover to rocklegends@musicfan.com.", "output": "Play 'Bohemian Rhapsody'\nemail the album cover to rocklegends@musicfan.com"}
{"input": "Send the survey feedback to support@mobilesolutions.com and set a reminder to uninstall the app on Sunday.", "output": "Send the survey feedback to support@mobilesolutions.com\nset a reminder to uninstall the app on Sunday"}
{"input": "Email the scanned receipts to finance@expensetracker.in and check weather in Nagpur.", "output": "Email the scanned receipts to finance@expensetracker.in\ncheck weather in Nagpur"}
{"input": "Play 'Tera Yaar Hoon Main' and forward it to anuj.emotions@feelings.com.", "output": "Play 'Tera Yaar Hoon Main'\nforward it to anuj.emotions@feelings.com"}
{"input": "Set a schedule to water the plants every morning at 7 and send this plan to home@routine.com.", "output": "Set a schedule to water the plants every morning at 7\nsend this plan to home@routine.com"}
{"input": "Email report cards to parents@schoolupdates.edu and check today’s forecast in Bhopal.", "output": "Email report cards to parents@schoolupdates.edu\ncheck today’s forecast in Bhopal"}
{"input": "Send a mail to chef.institute@cookingclass.net to request recipe notes and play some light jazz.", "output": "Send a mail to chef.institute@cookingclass.net to request recipe notes\nplay some light jazz"}
{"input": "Set a study reminder for 8 PM tonight and email the reading list to literature@classmail.org.", "output": "Set a study reminder for 8 PM tonight\nemail the reading list to literature@classmail.org"}
{"input": "Check political headlines for today and email them to arun.socio@newsdump.com.", "output": "Check political headlines for today\nemail them to arun.socio@newsdump.com"}
{"input": "Play 'Zinda' from Bhaag Milkha Bhaag and set a workout reminder for 6 AM daily.", "output": "Play 'Zinda' from Bhaag Milkha Bhaag\nset a workout reminder for 6 AM daily"}
{"input": "Email the quarterly update to board@investgroup.com and check today’s weather in Surat.", "output": "Email the quarterly update to board@investgroup.com\ncheck today’s weather in Surat"}
{"input": "Send a complaint email to billing@utilitycorp.com about double charges and schedule a callback for Monday.", "output": "Send a complaint email to billing@utilitycorp.com about double charges\nschedule a callback for Monday"}
{"input": "Check today’s news on climate change and email a summary to green.team@earthconserve.org.", "output": "Check today’s news on climate change\nemail a summary to green.team@earthconserve.org"}
{"input": "Play 'Ocean Eyes' by Billie Eilish and forward it to rhea.music@vibes.net.", "output": "Play 'Ocean Eyes' by Billie Eilish\nforward it to rhea.music@vibes.net"}
{"input": "Set a reminder to take my medication every evening at 9 and email this routine to health@checkin.ai.", "output": "Set a reminder to take my medication every evening at 9\nemail this routine to health@checkin.ai"}
{"input": "Email design feedback to ux@freshthemes.io and play some ambient background music.", "output": "Email design feedback to ux@freshthemes.io\nplay some ambient background music"}
{"input": "Check tomorrow’s forecast for Chandigarh and send an alert to my travel partner at bhavna.roads@gmail.com.", "output": "Check tomorrow’s forecast for Chandigarh\nsend an alert to my travel partner at bhavna.roads@gmail.com"}
{"input": "Send an apology email to ritu.singh@projectsync.io for missing the deadline and schedule a catch-up call tomorrow.", "output": "Send an apology email to ritu.singh@projectsync.io for missing the deadline\nschedule a catch-up call tomorrow"}
{"input": "Play soft meditation music and send a link to my therapist at calm.space@mindclinic.org.", "output": "Play soft meditation music\nsend a link to my therapist at calm.space@mindclinic.org"}
{"input": "Email an RSVP to weddings@celebrate.in for the upcoming reception and check weather in Udaipur.", "output": "Email an RSVP to weddings@celebrate.in for the upcoming reception\ncheck weather in Udaipur"}
{"input": "Set a schedule for online coding class every Tuesday and email the access link to learners@codebootcamp.com.", "output": "Set a schedule for online coding class every Tuesday\nemail the access link to learners@codebootcamp.com"}
{"input": "Check top news in sports and email highlights to amit.fanclub@stadium.net.", "output": "Check top news in sports\nemail highlights to amit.fanclub@stadium.net"}
{"input": "Play 'Perfect' by Ed Sheeran and email the song dedication to my partner at love.notes@hearts.org.", "output": "Play 'Perfect' by Ed Sheeran\nemail the song dedication to my partner at love.notes@hearts.org"}
{"input": "Send an appreciation note to my assistant at tanvi.support@admin.in and check the temperature in Thiruvananthapuram.", "output": "Send an appreciation note to my assistant at tanvi.support@admin.in\ncheck the temperature in Thiruvananthapuram"}
{"input": "Set a reminder for monthly budget review and send an update to finance.manager@walletwatch.io.", "output": "Set a reminder for monthly budget review\nsend an update to finance.manager@walletwatch.io"}
{"input": "Email the event photos to gallery@festflash.com and play a party playlist.", "output": "Email the event photos to gallery@festflash.com\nplay a party playlist"}
{"input": "Play latest indie pop hits and forward your favorite track to dev@musicmood.in.", "output": "Play latest indie pop hits\nforward your favorite track to dev@musicmood.in"}
{"input": "Send the subscription cancellation email to help@streamflix.in and check current weather in Mumbai.", "output": "Send the subscription cancellation email to help@streamflix.in\ncheck current weather in Mumbai"}
{"input": "Set a reminder for book club at 8 PM and email reading list to everyone@readcircle.com.", "output": "Set a reminder for book club at 8 PM\nemail reading list to everyone@readcircle.com"}
{"input": "Email an update on the software deployment to ops@silverstack.com and then check the weather in Kolkata today.", "output": "Email an update on the software deployment to ops@silverstack.com\ncheck the weather in Kolkata today"}
{"input": "Play 'Aaj Jaane Ki Zid Na Karo' and send a thank-you email to shazia@poetrycircle.in for the workshop invite.", "output": "Play 'Aaj Jaane Ki Zid Na Karo'\nsend a thank-you email to shazia@poetrycircle.in for the workshop invite"}
{"input": "Set a schedule to study Spanish every weekday at 6 PM and email the plan to tutor@lingoschool.com.", "output": "Set a schedule to study Spanish every weekday at 6 PM\nemail the plan to tutor@lingoschool.com"}
{"input": "Check tomorrow’s weather in Kolkata and email the forecast to travel@holidayplanner.in.", "output": "Check tomorrow’s weather in Kolkata\nemail the forecast to travel@holidayplanner.in"}
{"input": "Send a reminder email to it.support@metriclevel.com about the weekly backup and play some calm focus music.", "output": "Send a reminder email to it.support@metriclevel.com about the weekly backup\nplay some calm focus music"}
{"input": "Play 'Believer' by Imagine Dragons and send my game review to gamercommunity@playzone.net.", "output": "Play 'Believer' by Imagine Dragons\nsend my game review to gamercommunity@playzone.net"}
{"input": "Email the finalized event brochure to events@cityfests.com and then check if it’s raining in Bengaluru.", "output": "Email the finalized event brochure to events@cityfests.com\ncheck if it’s raining in Bengaluru"}
{"input": "Set a reminder for monthly software updates on the first Monday and email the notice to it.team@company.com.", "output": "Set a reminder for monthly software updates on the first Monday\nemail the notice to it.team@company.com"}
{"input": "Play instrumental yoga music and email my practice log to coach@yogacircle.in.", "output": "Play instrumental yoga music\nemail my practice log to coach@yogacircle.in"}
{"input": "Check today’s news about climate change and forward the highlights to environment@blogsphere.org.", "output": "Check today’s news about climate change\nforward the highlights to environment@blogsphere.org"}
{"input": "Send an email to hr@talentsearch.com with my updated availability and set a reminder to follow up next week.", "output": "Send an email to hr@talentsearch.com with my updated availability\nset a reminder to follow up next week"}
{"input": "Email the quarterly sales report to sales.head@marketdrive.io and then play upbeat corporate music.", "output": "Email the quarterly sales report to sales.head@marketdrive.io\nplay upbeat corporate music"}
{"input": "Play 'Shape of You' and email my playlist suggestions to musicteam@streamcloud.com.", "output": "Play 'Shape of You'\nemail my playlist suggestions to musicteam@streamcloud.com"}
{"input": "Check if it will rain tomorrow in Aurangabad and email the forecast to flightops@airtravel.net.", "output": "Check if it will rain tomorrow in Aurangabad\nemail the forecast to flightops@airtravel.net"}
{"input": "Send an email to design@archinnovate.com attaching the new façade concept, then check today’s weather in Pune.", "output": "Send an email to design@archinnovate.com attaching the new façade concept\ncheck today’s weather in Pune"}
{"input": "Set a schedule for daily mindfulness at 8 PM and email the reminder to selfcare@mindmatters.in.", "output": "Set a schedule for daily mindfulness at 8 PM\nemail the reminder to selfcare@mindmatters.in"}
{"input": "Play 'Levitating' by Dua Lipa and send my concert ticket confirmation to bookings@livemusic.org.", "output": "Play 'Levitating' by Dua Lipa\nsend my concert ticket confirmation to bookings@livemusic.org"}
{"input": "Email a confirmation to subscriptions@filmclub.com and then check the weather forecast for Shimla.", "output": "Email a confirmation to subscriptions@filmclub.com\ncheck the weather forecast for Shimla"}
{"input": "Send a follow-up email to api.support@devhub.co about the endpoint issue and play soft background music.", "output": "Send a follow-up email to api.support@devhub.co about the endpoint issue\nplay soft background music"}
{"input": "Play 'Viva La Vida' and email the lyrics breakdown to songfans@musicaffair.com.", "output": "Play 'Viva La Vida'\nemail the lyrics breakdown to songfans@musicaffair.com"}
{"input": "Check today’s news on finance and email a summary to finance@wealthinsight.com.", "output": "Check today’s news on finance\nemail a summary to finance@wealthinsight.com"}
{"input": "Set a reminder for my webinar on Thursday at 2 PM and email the invite to participants@learninghub.edu.", "output": "Set a reminder for my webinar on Thursday at 2 PM\nemail the invite to participants@learninghub.edu"}
{"input": "Email a request to edits@publishinghouse.com for the manuscript updates and check if it’s cloudy in Udaipur.", "output": "Email a request to edits@publishinghouse.com for the manuscript updates\ncheck if it’s cloudy in Udaipur"}
{"input": "Play calming rain sounds and send an email to it@teamalert.com to restart the server at midnight.", "output": "Play calming rain sounds\nsend an email to it@teamalert.com to restart the server at midnight"}
{"input": "Send a reminder for dentist appointment at 4 PM and email the confirmation to clinic@smilecare.in.", "output": "Send a reminder for dentist appointment at 4 PM\nemail the confirmation to clinic@smilecare.in"}
{"input": "Email the travel itinerary to support@tripplanner.in and check tomorrow’s weather in Darjeeling.", "output": "Email the travel itinerary to support@tripplanner.in\ncheck tomorrow’s weather in Darjeeling"}
{"input": "Play 'Blinding Lights' by The Weeknd and email a summary of lyrics to songdiscuss@lyriclounge.org.", "output": "Play 'Blinding Lights' by The Weeknd\nemail a summary of lyrics to songdiscuss@lyriclounge.org"}
{"input": "Check today’s weather in Chandigarh and email the update to realestate@propertyzone.com.", "output": "Check today’s weather in Chandigarh\nemail the update to realestate@propertyzone.com"}
{"input": "Set a schedule to backup files every Friday at 5 PM and email the backup report to it@cybersecure.io.", "output": "Set a schedule to backup files every Friday at 5 PM\nemail the backup report to it@cybersecure.io"}
{"input": "Send an email to hr@boardinghouse.com with my late check-in request and play soft instrumental music.", "output": "Send an email to hr@boardinghouse.com with my late check-in request\nplay soft instrumental music"}
{"input": "Email my tax documents to accounts@fintrack.com and then check weather in Ahmedabad for tomorrow.", "output": "Email my tax documents to accounts@fintrack.com\ncheck weather in Ahmedabad for tomorrow"}
{"input": "Play 'Someone You Loved' and send my feedback to wellness@therapycenter.com.", "output": "Play 'Someone You Loved'\nsend my feedback to wellness@therapycenter.com"}
{"input": "Check today’s news about sports and email highlights to news@sportshub.in.", "output": "Check today’s news about sports\nemail highlights to news@sportshub.in"}
{"input": "Send a reminder for team lunch at 1 PM and email the details to catering@officeeats.com.", "output": "Send a reminder for team lunch at 1 PM\nemail the details to catering@officeeats.com"}
{"input": "Email a service request to plumber@homemaintain.in and check if it's raining in Nashik.", "output": "Email a service request to plumber@homemaintain.in\ncheck if it's raining in Nashik"}
{"input": "Set a schedule to meditate daily at 7 AM and email the log to guru@yogainstitute.org.", "output": "Set a schedule to meditate daily at 7 AM\nemail the log to guru@yogainstitute.org"}
{"input": "Play 'Fix You' by Coldplay and email my reflective notes to journal@mindjourney.com.", "output": "Play 'Fix You' by Coldplay\nemail my reflective notes to journal@mindjourney.com"}
{"input": "Email the meeting minutes to client@progresspartners.com and then check weather in Varanasi.", "output": "Email the meeting minutes to client@progresspartners.com\ncheck weather in Varanasi"}
{"input": "Check today’s headline about tech startups and email a summary to startup.news@venturepulse.com.", "output": "Check today’s headline about tech startups\nemail a summary to startup.news@venturepulse.com"}
{"input": "Send an email to rental@stayz.com confirming booking details and play soft jazz music.", "output": "Send an email to rental@stayz.com confirming booking details\nplay soft jazz music"}
{"input": "Email the business proposal to investor@futuresplus.com and check tomorrow’s weather in Chennai.", "output": "Email the business proposal to investor@futuresplus.com\ncheck tomorrow’s weather in Chennai"}
{"input": "Play 'Counting Stars' and email my review to streaming@playlistreview.com.", "output": "Play 'Counting Stars'\nemail my review to streaming@playlistreview.com"}
{"input": "Set a reminder for friend’s wedding on Saturday at 10 AM and email the invite to guests@weddingadmin.in.", "output": "Set a reminder for friend’s wedding on Saturday at 10 AM\nemail the invite to guests@weddingadmin.in"}
{"input": "Email a complaint to support@taxiservice.in and check if it's cloudy in Lucknow today.", "output": "Email a complaint to support@taxiservice.in\ncheck if it's cloudy in Lucknow today"}
{"input": "Play some ambient lo-fi and send an email to it@remoteteams.com about today's sync link.", "output": "Play some ambient lo-fi\nsend an email to it@remoteteams.com about today's sync link"}
{"input": "Email the new product specs to dev@hardwarelab.in and set a reminder to follow up on Wednesday.", "output": "Email the new product specs to dev@hardwarelab.in\nset a reminder to follow up on Wednesday"}
{"input": "Check tomorrow's forecast in Srinagar and email it to weather@avalancheresearch.org.", "output": "Check tomorrow's forecast in Srinagar\nemail it to weather@avalancheresearch.org"}
{"input": "Play 'Stand by Me' and send the lyrics to poetry@lyriclover.net.", "output": "Play 'Stand by Me'\nsend the lyrics to poetry@lyriclover.net"}
{"input": "Send a reminder to self to submit feedback by Friday and email the feedback to studies@eduplatform.com.", "output": "Send a reminder to self to submit feedback by Friday\nemail the feedback to studies@eduplatform.com"}
